{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"### Describe the solution you'd like\n\n~It was originally thought that if nothing in user code was referencing a suspended fiber anymore, it would get garbage collected (this is how tasks work in .NET). However, threads actually keep a strong reference to suspended fibers and we reuse threads. On workflow eviction, any number of fibers may be suspended, including the primary one.~\n\n~The only way to remove a strong reference to a fiber on a thread is to complete the fiber, and the only way to complete the fiber is resume until complete (potentially raising an exception inside it to force it to resume). So we should go over known fibers and raise a non-standard-error exception inside them. This needs to take an approach similar to https://github.com/temporalio/sdk-python/pull/499 where we ignore any side-effects that could be caused by raising (e.g. don't make an activity command if the user did it inside `ensure`). Make sure there is a test that tries to make uncollected fibers in any way it can and confirm. The `test_confirm_garbage_collect` test (that we had to skip pending this issue) has some utilities/designs here.~\n\nEDIT: These statements about threads holding strong references to fibers are no longer deemed accurate, see first comment.","closedAt":null,"comments":[{"id":"IC_kwDOHI0NyM7DmN8n","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"After some research, it seems that even suspended fibers are subject to garbage collection if all references to them are removed (which means the scheduler is garbage collected).\n\nHowever, we are struggling to provide a good test that proves this due to GC inconsistencies. Can look at efforts in #336, where we fashioned a test that works when just executing the single garbage collect test, but not when running with the whole suite. Can also look at efforts in #335 where we did even more test attempts and have an implementation of force-finishing fibers when we thought that was required.\n\nOverall, we do not believe there is a memory leak, but we struggle to write a deterministic test for this. We can revisit if issues appear.","createdAt":"2025-09-11T15:55:37Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-ruby/issues/334#issuecomment-3281575719","viewerDidAuthor":false}],"createdAt":"2025-09-08T20:16:12Z","labels":[{"id":"LA_kwDOHI0NyM7vFHIK","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":334,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Ensure fibers and workflow instances are properly GC'd on workflow eviction","updatedAt":"2025-09-11T15:55:37Z","url":"https://github.com/temporalio/sdk-ruby/issues/334"}
