{"assignees":[],"author":{"id":"U_kgDOB4nb9A","is_bot":false,"login":"kumarprateek27","name":""},"body":"\n**Is your feature request related to a problem? Please describe.**\n\nWhen running Temporal at high scale with PostgreSQL, our production database is under significant, constant load from the archival service's DELETE operations. This leads to performance degradation, table bloat, and high resource consumption (IOPS, CPU), making it a major operational bottleneck. It forces us to perform aggressive database maintenance and over-provision resources to cope with the inefficient, row-by-row deletion pattern on massive tables.\n\n**Describe the solution you'd like**\n\nI'd like a new, opt-in archival mode for PostgreSQL that is \"partition-aware.\" Instead of deleting rows, the Temporal service would manage the lifecycle of entire table partitions.\n\nThe process would be:\n\n1. Detach: The server automatically detaches partitions older than the retention period based on a user-configurable frequency (e.g., weekly).\n\n2. Archive: The archival service then reads the entire contents of that standalone, detached table and uploads it to the configured blob store (S3, GCS, etc.).\n \n3. Drop: After a successful archival, the server issues a DROP TABLE command on the detached partition, which instantly reclaims all storage space.\n\nThis replaces the expensive DELETE workload with highly efficient, metadata-only operations.\n\n**Describe alternatives you've considered**\n\n1. Current Archival Process: We use the standard archival feature. While it works, the DELETEs do not scale efficiently and cause the performance problems described above.\n\n2. Manual Partitioning + Standard Archival: We considered manually partitioning the tables. This helps performance by isolating DELETEs to older partitions (via partition pruning) but still relies on the inefficient DELETE command itself.\n\n3. Custom ETL Pipeline: We considered building a custom script to detach partitions, upload them to S3, and drop them. This completely bypasses Temporal's tooling, making the archived data invisible to the platform\n\n**Additional context**\nOpen Question: An important design consideration is how partition creation is handled. Should this feature also manage creating future partitions, or should it require users to handle that externally (e.g., via pg_partman)?","closedAt":"2025-09-25T22:55:51Z","comments":[{"id":"IC_kwDODNqesM7Ghhni","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"If I understand correctly, you are suggesting that the partitions would be time based. I will respond here with this assumption.\n\nData that we write to the DB may have varying lifespans. For example a two workflows may be started at the same time and run for completely different durations as well as be in namespaces that have completely different retention policies. There is no clear cut to just dropping a data partition by time.\nThe server also needs to deduplicate start requests and relies on having a single workflow ID in a predictable shard.\n\nA more reasonable approach would be to throttle the archival process to a degree that it wouldn't affect live workloads.\n\nYou can try to tune these dynamic configs and see if that helps your situation:\n\n- `history.archivalBackendMaxRPS`\n- `history.archivalTaskBatchSize`","createdAt":"2025-09-24T20:54:04Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8287#issuecomment-3330677218","viewerDidAuthor":false},{"id":"IC_kwDODNqesM7G2gQ3","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"Closing as not planned due to the reasons I gave above.","createdAt":"2025-09-25T22:55:51Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8287#issuecomment-3336176695","viewerDidAuthor":false}],"createdAt":"2025-09-05T10:17:58Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":8287,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":2}}],"state":"CLOSED","title":"[Proposal] Archival for Postgres Tables","updatedAt":"2025-09-25T22:55:51Z","url":"https://github.com/temporalio/temporal/issues/8287"}
