{"assignees":[],"author":{"id":"MDQ6VXNlcjIxMjMxOQ==","is_bot":false,"login":"listaction","name":"Kaarthik N Ramaswamy"},"body":"hi @mfateev , \r\n with this change - could you please share what would happen to uber cadence?","closedAt":"2020-04-12T00:32:04Z","comments":[{"id":"MDEyOklzc3VlQ29tbWVudDYxMjU0MzQ5NA==","author":{"login":"mfateev"},"authorAssociation":"MEMBER","body":"I would ask this question to the Uber Cadence team. This is what they posted to the Cadence Slack Channel:\r\n\r\n> I’m Emrah from the Cadence team at Uber. I joined the community about a year ago while working for another company and then had the privilege to join the Cadence team at Uber back in January as the tech lead. Liang, the Engineering Manager for the Cadence team, and I wanted to share an update about the Cadence project.\r\n> We want to reinforce that Uber’s Cadence team is committed to the growth and open source development of the Cadence project. Today, Cadence powers 100+ different use cases within Uber and that number grows quickly. Collectively, there are 50M+ ongoing executions at any moment on average and our customers finish 3B+ executions per month. Outside of Uber, we also know that many engineering teams at various companies have already adopted Cadence for their business-critical workflows. We are excited to continue evolving Cadence as an open-source project in a backward-compatible way with an increased focus on reliability, scalability, and maintainability in the near term. \r\n> Stay tuned for more updates and additions to the Cadence project from our team!\r\n> Going forward, we look forward to collaborating with Maxim and Samar and the rest of the open-source community!  \r\n> If you have any questions, please feel free to reach out to us here in Slack or via email at emrah@uber.com and meiliang@uber.com.","createdAt":"2020-04-12T00:32:04Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/296#issuecomment-612543494","viewerDidAuthor":true},{"id":"MDEyOklzc3VlQ29tbWVudDYxMzQ4OTIzNw==","author":{"login":"listaction"},"authorAssociation":"NONE","body":"good story - nicely cleaned up :) ","createdAt":"2020-04-14T14:51:32Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/296#issuecomment-613489237","viewerDidAuthor":false}],"createdAt":"2020-04-12T00:10:39Z","labels":[{"id":"MDU6TGFiZWwyMDE5OTA0OTIw","name":"discussion","description":"","color":"3ffcb0"}],"milestone":null,"number":296,"reactionGroups":[],"state":"CLOSED","title":"what happens to uber cadence now?","updatedAt":"2020-04-27T20:23:51Z","url":"https://github.com/temporalio/temporal/issues/296"}
