{"assignees":[],"author":{"id":"MDQ6VXNlcjQ1MjM5NTU=","is_bot":false,"login":"longquanzheng","name":"Quanzheng Long"},"body":"## Is your feature request related to a problem? Please describe \r\nThere are two use cases that this feature will be super helpful for Temporal applications:\r\n### Use case 1: Making async activity completion more reliable and efficient. \r\nAsync activity completion is very handy/powerful/useful in certain scenario, when a workflow want to invoke an external action, and then wait for a response from external. This could be done by activity + signal, however, async activity completion could be more natural, less code to write, and more efficient (less events in history).\r\n\r\nHowever, the current async activity completion has a potential reliability issue. \r\n\r\nThe activity needs to pass down the activity taskToken(or at least the activityId) to external system so that the activity task can be completed by sending the token/taskId to Temporal service. So the async activity has be  be implemented this below sequence.\r\n(see [doc](https://docs.temporal.io/application-development/features#asynchronous-activity-completion) )\r\n```golang \r\nactivityMethodForAsyncCompletion(ctx Context ){\r\n    // Retrieve the activity information needed to asynchronously complete the activity.\r\n    activityInfo := cadence.GetActivityInfo(ctx)\r\n    taskToken := activityInfo.TaskToken\r\n\r\n    // Send the taskToken to the external service that will complete the activity.\r\n    ...\r\n\r\n    // Return from the activity a function indicating that Cadence should wait for an async completion\r\n    // message.\r\n    return \"\", activity.ErrResultPending\r\n}\r\n``` \r\nBut anything could happen in `Send the taskToken to the external service that will complete the activity`. There could be a timeout, or a worker sudden disruption. Note that right now SDK doesn't do anything to `activity.ErrResultPending` (just n[ot respond anything to server](https://github.com/temporalio/sdk-go/blob/1b62656a17d39001201bace9a01be646663dea49/internal/internal_task_pollers.go#L1070) )\r\n\r\nWhen the failure happens, if the start to close timeout is very long, then the external system will not receive the token until next retry. \r\n\r\nAs a workaround, application has to set very short start to close timeout, and then keep retrying on the activity. This leads to issues:\r\na. If the external system uses a async mechanism like message queue to receive the token, then it will receive a lot of duplicates\r\nb. If the external system use a database to store it, then additional logic must be implemented with atomic/traditional operation for adding the token. \r\nThe workaround not along cause a lot of complication, but also very in-efficient to do. Because in reality , this is a very extremely rare case (but we can't ignore it for some critical system, and it's against the Temporal's strong consistency guarantee). \r\n\r\nOne solution to this is to let activity set a smaller heartbeat timeout initially, and then update the heartbeat timeout to infinite()) after successfully sending the token to external system. \r\n\r\n### Use case 2: Allow using different backoff retry/timeout strategy for different errors\r\nRight now the backoff retry and policy is set as a global for all types of errors. This is inconvenient for some use cases that some retriable error can do a much bigger backoff than others. \r\n\r\nIf allowing update the timeout config, then SDK can return back a different config based on different errors returned from the application(activity results).\r\n\r\n## Describe the solution you'd like**\r\nThe started activities with retry have the timeout/retry config stored in mutable state, it should be straightforward to introduce an API to allow updating it. Also, the activity retry won't write down started even until closing so it should cause any problem for history replay. \r\n\r\n## Describe alternatives you've considered**\r\nFor use case 1(async activity), an alternative could be letting SDK send back the `activity.ErrResultPending` to server, so that server can stop retry for the activity. Right now SDK doesn't do anything to `activity.ErrResultPending` (just n[ot respond anything to server](https://github.com/temporalio/sdk-go/blob/1b62656a17d39001201bace9a01be646663dea49/internal/internal_task_pollers.go#L1070) )\r\n\r\n## Additional context**\r\nhttps://temporalio.slack.com/archives/CTQU95E84/p1681159067543939\r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM52hKC-","author":{"login":"airhorns"},"authorAssociation":"NONE","body":"If I could add another use case in here it'd be making activities retry only after some deadline an external system hands them. When making calls to 3rd party APIs that are rate limited, if you exceed your rate limit, the service often replies with a `Retry-After` header. We know any more calls to the API before that time won't work, so it is inefficient to retry on a fixed schedule until then. Better would be having the activity adjust the retry options (somehow) to say \"don't retry again until this point in time\" at which point it may succeed or may fail again. ","createdAt":"2024-03-11T13:08:18Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4151#issuecomment-1988403390","viewerDidAuthor":false}],"createdAt":"2023-04-10T20:36:43Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":4151,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":2}}],"state":"OPEN","title":"Allow update timeout/retry config for started activities with retry","updatedAt":"2024-03-11T13:08:42Z","url":"https://github.com/temporalio/temporal/issues/4151"}
