{"assignees":[],"author":{"id":"MDQ6VXNlcjI4NDg5","is_bot":false,"login":"shanna","name":"Shane Hanna"},"body":"**Is your feature request related to a problem? Please describe.**\r\nI'm a fan of self hosting early stage and startup projects on micro budgets (think 5USD to 100USD a month at most). I've been using Temporal on work projects but more recently I've been playing with Temporalite using sqlite replicated with https://litestream.io to https://min.io. It has worked out great in development but I'd like to take Temporal (or Temporalite) to production without clusting, postgres, elasticsearch etc which all blow out small budgets in a heartbeat.\r\n\r\n**Describe the solution you'd like**\r\nOfficially support sqlite in production.\r\n\r\nI think this would involve (at least):\r\n* Add sqlite as an option to the sql tool.\r\n* Add sqlite support to the auto-setup shell scripts.\r\n* Add sqlite visibility support? (perhaps requiring the fulltext search extension?).\r\n\r\n**Describe alternatives you've considered**\r\nI have been tempted to use temporalite in production despite all the risks and downsides.\r\n\r\n**Additional context**\r\nI don't fully utilise Temporal. Generally my workflows are for service to service coordination and short lived so I'm OK with a single nodes and short stretches of downtime which I understand probably isn't typical for Temporal users.\r\n\r\nI asked about future plans for sqlite support here https://community.temporal.io/t/future-sqlite3-support/5915?u=shane\r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5L-x4-","author":{"login":"jlegrone"},"authorAssociation":"CONTRIBUTOR","body":"FYI, the vision is for Temporalite to be used in production contexts. I might make a milestone to make tracking easier, but this depends on https://github.com/temporalio/temporalite/issues/23, https://github.com/temporalio/temporalite/issues/110, and signoff from more Temporal server maintainers. I'd love to get published benchmarks, which are in the works.\r\n\r\nOf course you are free to use the regular Temporal server binary with the sqlite driver as well! Any improvements to performance and stability will also be available in Temporalite.\r\n\r\n-----\r\n\r\nAlso, ðŸ‘ for litestream. I haven't gotten around to playing with it yet, but glad to know it's working for you with Temporalite!","createdAt":"2022-10-11T14:07:09Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3366#issuecomment-1274748478","viewerDidAuthor":false},{"id":"IC_kwDODNqesM52ZZmt","author":{"login":"evgenii-moriakhin"},"authorAssociation":"NONE","body":"Hello\r\n\r\nThere is no progress or discussion on this issue? I see the problem has been reopened\r\n\r\nI'm interested because I too want to use temporal with sqlite on a virtualization product where thousands of hosts may have agents that don't have broad access to the enterprise network, but I'd like to be able to execute temporal workflows on them without having to deploy a \"serious\" DBMS like PostgreSQL on each host, but take advantage of temporal. \r\n\r\nI read this topic https://community.temporal.io/t/future-sqlite3-support/5915/6?u=shane\r\nand find the use cases completely similar to mine\r\n\r\nand I had the question after reading this topic, if these points\r\n\r\n> One reason is it starts all server roles in the same container and in a single process (similar to auto-setup) which makes it hard to scale and tune among other things\r\n\r\n are not critical for me, can I use temporal with sqlite in production?\r\n\r\n@shanna , did you finally get it to work?\r\n\r\n","createdAt":"2024-03-08T20:26:09Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":5}}],"url":"https://github.com/temporalio/temporal/issues/3366#issuecomment-1986369965","viewerDidAuthor":false},{"id":"IC_kwDODNqesM60xrUK","author":{"login":"robholland"},"authorAssociation":"MEMBER","body":"The Temporal CLI dev-server (https://docs.temporal.io/cli#start-dev-server) supports having the SQLite database on-disk. Is that sufficient for your use case? ","createdAt":"2025-07-03T16:47:03Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3366#issuecomment-3032921354","viewerDidAuthor":false},{"id":"IC_kwDODNqesM7BFk8k","author":{"login":"raymondsze"},"authorAssociation":"NONE","body":"@robholland\nIs it possible to support something like rqlite? Some usecase for me is we may not able to offer a database like postgres or mysql, but we still want to have some kind of durability.\n\nI can configure a litestream to periodically backup the data to s3 compatible storage. But its is a sidecar container, not guarantee 100% durability.","createdAt":"2025-08-30T19:01:46Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3366#issuecomment-3239464740","viewerDidAuthor":false}],"createdAt":"2022-09-12T09:28:36Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":3366,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":16}}],"state":"OPEN","title":"Support sqlite in production.","updatedAt":"2025-08-30T19:02:30Z","url":"https://github.com/temporalio/temporal/issues/3366"}
