{"assignees":[],"author":{"id":"MDQ6VXNlcjg0NDExMDE0","is_bot":false,"login":"yiminc","name":"Yimin Chen"},"body":"Currently server would truncate activity failure if it exceeds 4KB (default threshold). This make sense if there is many pending activities (like thousands), but it does not make sense if there is only one activity. \n\nA better solution is to only truncate if the aggregated failure from all pending activities exceeds some lager threshold. \n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM6fUety","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"Some context: \n\nWe enforce a fixed 2kb activity failure size limit for each activity. This has a couple of issues:\n- The limit maybe too low if a workflow only have 1 or 2 activities. We have received requests from cluster before saying we need a higher limit.\n- The limit is too high when workflow has lots of pending activities (max 2k pending activities), causing entire mutable state size to reach limit and workflow get terminated.\n- When combined with other things like buffered events,  the total mutable state size may reach the limit and get workflow terminated.\n\n\n\nSome ideas:\n- A total failure size limit across activities. \n- When ms size reaches the limit, before directly terminating the workflow, see if we can flush buffered events or truncate activity failure message. ","createdAt":"2025-02-20T23:32:57Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/7367#issuecomment-2672946034","viewerDidAuthor":false}],"createdAt":"2025-02-20T18:18:42Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":7367,"reactionGroups":[],"state":"OPEN","title":"Do not truncate activity failure info if there is not many of them","updatedAt":"2025-02-20T23:32:58Z","url":"https://github.com/temporalio/temporal/issues/7367"}
