{"assignees":[],"author":{"id":"MDQ6VXNlcjczNjUxNDU=","is_bot":false,"login":"nnoto","name":"Nicholas Noto"},"body":"**Is your feature request related to a problem? Please describe.**\r\nI would like to track workflow executions via some unique identifier such as the run_id, including future workflow executions defined by a schedule. \r\n\r\n**Describe the solution you'd like**\r\nSchedule information currently only provides a run_id for a workflow execution that has already begun. workflow_id isn't guaranteed to be unique when factoring in scheduled and on-demand workflows. Temporal documentation mentions a unique identifier of a workflow execution is the namespace + workflow_id + run_id.  Since future_action_times are provided for some portion of future schedule executions, it would be helpful to prepopulate the run_id as well is possible.\r\n\r\n**Describe alternatives you've considered**\r\nIncluding the schedule information (if applicable) that led to a workflow execution in the workflow description via list_workflows is helpful, but does not provide context for future workflow executions.\r\n\r\n**Additional context**\r\nExisting implementation: \r\n```\r\n{  \r\n    recent_actions {\r\n        schedule_time {\r\n            seconds: 1695312900\r\n        }\r\n        actual_time {\r\n            seconds: 1695312900\r\n            nanos: 405395930\r\n        }\r\n        start_workflow_result {\r\n            workflow_id: \"your-workflow-id-2023-09-21T16:15:00Z\"\r\n            run_id: \"bae2a0b4-37b8-48f2-8a63-b6afc7d01b0f\"\r\n        }\r\n    }\r\n    future_action_times {\r\n        seconds: 1695330900\r\n    }\r\n}\r\n```\r\nProposed change:\r\n```\r\n{  \r\n    recent_actions {\r\n        schedule_time {\r\n            seconds: 1695312900\r\n        }\r\n        actual_time {\r\n            seconds: 1695312900\r\n            nanos: 405395930\r\n        }\r\n        start_workflow_result {\r\n            workflow_id: \"your-workflow-id-2023-09-21T16:15:00Z\"\r\n            run_id: \"bae2a0b4-37b8-48f2-8a63-b6afc7d01b0f\"\r\n        }\r\n    }\r\n    future_actions {\r\n        workflow_id: <workflow_id>\r\n        run_id: <workflow run_id>\r\n        schedule_time {\r\n            seconds: 1695330900\r\n        }\r\n    }\r\n}\r\n```\r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5nlD05","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"Currently `run_id` is generated at start time and I don't think we want to change that, so we can't predict the `run_id` ahead of time.\r\n\r\nCan you use the workflow id (prefix + `-` + start time) or the value of the `TemporalScheduledStartTime` search attribute? The catch with using those is that those will use the time before jitter is added, while the time in `future_action_time` has the \"actual\" time including jitter. We could add a new field parallel to `future_action_time` that has the time without jitter so it'll match the workflow id ","createdAt":"2023-09-27T16:59:01Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4887#issuecomment-1737768249","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5nyq7v","author":{"login":"nnoto"},"authorAssociation":"NONE","body":"@dnr Yes, using the workflow id is possible. The field parallel to future_action_time that has the time without jitter would be much appreciated if possible.\r\n\r\nHas generating the run_ids based on the same method used for scheduled workflow ids (workflow prefix + - + start time) when the scheduled workflow executes been considered? Currently the run_ids seem to be some UUID regardless of whether the workflow was run on-demand or scheduled.\r\nThe way I understand workflows is that the workflow id is essentially just the identifier for the action/routine comprising a set of activities and can be used for many executions of the workflow, so the workflow prefix should suffice for the workflow id even in the context of scheduled workflows. Since run ids are unique and represent an execution of a workflow, using the start time suffix seems more appropriate for the run_ids. ","createdAt":"2023-09-29T18:42:50Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4887#issuecomment-1741336303","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5n5ssz","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"Run ids are explicitly represented as UUIDs in various database schemas so I'm afraid changing that isn't possible now. If it were a free-form string then yes, the timestamp would make sense. I think client-provided UUID run ids (where you could embed a timestamp, for example) could also violate certain assumptions in the rest of the system about uniqueness, so I don't think we can go there either.\r\n\r\nThe reason we put the timestamp in the workflow id itself instead of letting scheduled workflows reuse the workflow id is that schedules can be configured to allow scheduled workflows to run concurrently instead of enforcing exclusion. Only one workflow execution with the same workflow id can be running at once, and that's a basic invariant of Temporal.\r\n\r\nThat said, in configurations where we do enforce exclusion, we could reuse the workflow id (still with random run ids). That's requested in #4795.","createdAt":"2023-10-02T14:57:49Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4887#issuecomment-1743178547","viewerDidAuthor":false}],"createdAt":"2023-09-21T18:09:08Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":4887,"reactionGroups":[],"state":"OPEN","title":"Prepopulate run_id in schedule future_action_times","updatedAt":"2023-10-02T14:57:49Z","url":"https://github.com/temporalio/temporal/issues/4887"}
