{"assignees":[],"author":{"id":"MDQ6VXNlcjEwNDMxNg==","is_bot":false,"login":"zboralski","name":"Anthony Zboralski"},"body":"**Is your feature request related to a problem? Please describe.**\r\nYes, it involves managing rate limits using Temporal's `WorkerActivitiesPerSecond` parameter. As of now, this parameter resets when a worker restarts or migrates, causing problems with rate limiting strategies. It's especially tricky when third-party downstream rate limits need observing.\r\n\r\n**Describe the solution you'd like**\r\nHere are two changes that would help:\r\n\r\n1. Allow the `WorkerActivitiesPerSecond` limit to stick around when a worker restarts or moves to a new machine. This way, the worker's rate limit settings don't get lost if it restarts or changes location.\r\n2. Make it possible to change the `WorkerActivitiesPerSecond` limit after the worker is created. This flexibility would let the system adapt to new situations without the need for a new worker.\r\n\r\nThe state could be tied to the worker id for better management.\r\n\r\n**Describe alternatives you've considered**\r\nTo work around this issue, there's an idea to use Gubernator, another rate limiting system. It means adding extra activities to check and register hits with Gubernator. But this adds complexity that could be avoided.\r\n\r\n**Additional context**\r\nThis feature would simplify things for developers by offering better control over rate limiting within Temporal. It would be helpful not just in this scenario, but in others where there's a need for detailed and lasting control over worker activity rates.\r\n","closedAt":"2023-05-19T22:02:50Z","comments":[{"id":"IC_kwDODNqesM5csK3-","author":{"login":"zboralski"},"authorAssociation":"NONE","body":"Upon reviewing the rate limiter's implementation (go sdk), I believe the concerns previously mentioned may not pose significant issues. It's worth noting that the rate limiter utilizes a burst value of one and doesn't employ the use of allow or reservation.\r\n\r\n- In the event that a worker is restarted only once during the replenishment period of the token, we might slightly exceed the limit by just one event. \r\n\r\n- This might be more of an issue if the worker is restarted multiple times within that same interval.\r\n\r\n- However, if the worker is restarted after the token has already been replenished, this would not affect the rate limit at all.\r\n\r\nA potential useful improvement could be to provide an option to skip the first event upon creating the limiter, by calling 'Wait'.  \r\n\r\nThis could be particularly helpful in situations where an activity bug may cause a worker to crash and restart multiple times. Implementing this option would guard the user against exceeding their downstream API quota due to repeated worker restarts.","createdAt":"2023-05-19T18:39:55Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4361#issuecomment-1555082750","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5ctCKi","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"Look like it is not longer a big concern for you.\r\nYou might consider a workaround to put a sleep (over the duration of concern for one token) in worker's main method.","createdAt":"2023-05-19T22:02:50Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4361#issuecomment-1555309218","viewerDidAuthor":false}],"createdAt":"2023-05-18T10:45:49Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":4361,"reactionGroups":[],"state":"CLOSED","title":"Persist and Modify Rate Limits Tied to Worker IDs in Temporal","updatedAt":"2023-05-19T22:02:50Z","url":"https://github.com/temporalio/temporal/issues/4361"}
