{"assignees":[{"id":"MDQ6VXNlcjI3NzM2MTIy","login":"rylandg","name":"Ryland Goldstein","databaseId":0},{"id":"MDQ6VXNlcjg0NDExMDE0","login":"yiminc","name":"Yimin Chen","databaseId":0}],"author":{"id":"MDQ6VXNlcjIwOTUwMjU=","is_bot":false,"login":"etherops","name":"Patrick K"},"body":"**Is your feature request related to a problem? Please describe.**\r\nMy team is implementing a temporal cluster for several others team at my company. The teams we serve will build workflows in ruby, go and python.  We are providing both the hosted temporal cluster as well as SDK shim layers for workflow developers to use.  We are using a 3rd party vendor to host the database, Cassandra.  Due to compliance and regulation we require the data to be logically encrypted at rest (AWS EBS level encryption is not enough) on the vendor site.  After reviewing the docs and community forum it is clear that the only way to currently achieve this is through client/SDK side encryption - meaning that the client workers need to be aware of and choose encryption through the SDK `DataConverter` object.  \r\n\r\nAnother piece of context: we do _not_ need the data to be encrypted while in transit/memory while in the Temporal data center since we fundamentally trust our own selves with the data.  It is _only_ when it is in our 3rd party vendor site that we need additional logical encryption.\r\n\r\nThe problem with implementing client/SDK side encryption for our purposes is 3fold: 1 - we will have to reimplement the same custom DataConvert class/logic 3 times and keep those systems in parity since we support multiple SDK languages, 2 - we have to trust the clients to \"do the right thing\" in order to ensure that the server side encrypts at the database level and 3 - we do not need the added complexity/overhead of encryption while data is in transit in the Temporal cluster so this will make debugging harder for no return on investment.\r\n\r\n**Describe the solution you'd like**\r\nIdeally an out of the box solution where we can provide the backend server with a secret or secret and salt to encrypt data in the database with.  It is also acceptable if we need to write a custom DataConverter class for the backend/server side.\r\n\r\n**Describe alternatives you've considered**\r\nWe investigate whether this is currently available and it is not.\r\n\r\n**Additional context**\r\nI reviewing the similar topics below I posted this topic https://community.temporal.io/t/server-side-encryption/2081 on the community forum and Wenquan Xing asked me to file this feature request, thanks Wenquan!  I also believe my company is in talks with your team about mutual support engagements, please reach out to me if you want more details on which company I am with.  Thanks!\r\n\r\n**Similar posts:**\r\nhttps://community.temporal.io/t/what-are-best-practices-for-making-temporal-gdpr-compliant/622\r\nhttps://community.temporal.io/t/secrets-pii-in-request-response/1616\r\nhttps://community.temporal.io/t/passing-sensitive-data-from-workflow-to-activity/505\r\n","closedAt":"2023-05-16T15:53:58Z","comments":[{"id":"MDEyOklzc3VlQ29tbWVudDgzNTg4Nzk4Mg==","author":{"login":"rylandg"},"authorAssociation":"CONTRIBUTOR","body":"Hey etherops, thanks for such a well constructed and communicated feature request. I can say that I definitely agree that this is a high value feature that adds a lot of confidence to users looking for a secure Temporal deployment. We have discussed this feature internally in the past and it was always received quite positively.\r\n\r\nThere has never been a formal scoping of work to determine how much effort this feature would require. The current belief is that it requires minimal to moderate effort, which makes it quite appealing. I can't give you a concrete answer or idea of priority yet, but let us have some internal discussions and understand if we have time/resources to fit this in. I think I can safely say it will happen at some point, it's just a matter of when.\r\n\r\nWill keep you updated and thanks again.","createdAt":"2021-05-09T20:59:07Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1531#issuecomment-835887982","viewerDidAuthor":false},{"id":"MDEyOklzc3VlQ29tbWVudDgzNzI4Njc3Mg==","author":{"login":"etherops"},"authorAssociation":"NONE","body":"Thanks for the response @rylandg.  I know we would be very interested in adopting this if/when the team picks this up.  As I understand my people will be reaching out to your people too ;) Thanks!","createdAt":"2021-05-10T20:28:02Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1531#issuecomment-837286772","viewerDidAuthor":false},{"id":"MDEyOklzc3VlQ29tbWVudDg0NTUxMDA4MQ==","author":{"login":"etherops"},"authorAssociation":"NONE","body":"Per [discussion in Slack ](https://temporalio.slack.com/archives/CTQU95E84/p1621022297063300) w/ @wxing1292 and @mfateev the following will be needed to implement this issue:\r\n* refactor the persistency layer, not using the hard code serializer / deserializer\r\n* (optionally) refactor cassandra layer\r\n* expose `PayloadSerializer` in `temporal/server_options.go`","createdAt":"2021-05-20T22:05:59Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1531#issuecomment-845510081","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5cSpRl","author":{"login":"solongtony"},"authorAssociation":"NONE","body":"@rylandg @yiminc Can someone summarize the current state of this? It seems some work has been done but it is not finished. This is necessary for my company to be able to use temporal.","createdAt":"2023-05-15T18:56:31Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1531#issuecomment-1548391525","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5cYixT","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"There is no plan to add this support directly. However, you can achieve this by having a proxy in front of temporal server and do server side encryption there. This proxy solution works for both self-hosted server and temporal cloud. See samples of how to do that via proxy: https://github.com/temporalio/samples-go/tree/main/grpc-proxy","createdAt":"2023-05-16T15:53:58Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1531#issuecomment-1549937747","viewerDidAuthor":false}],"createdAt":"2021-05-07T05:00:31Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwzMDAxNDk5NzYw","name":"operations","description":"","color":"f9d0c4"}],"milestone":null,"number":1531,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":4}}],"state":"CLOSED","title":"Server Side Encryption","updatedAt":"2023-05-16T15:53:59Z","url":"https://github.com/temporalio/temporal/issues/1531"}
