{"assignees":[],"author":{"id":"MDQ6VXNlcjYwODEwNjc0","is_bot":false,"login":"phuongdnguyen","name":"D.Phuong Nguyen"},"body":"## Expected Behavior\nThe scavenger should not perform history garbage collection on workflow that have mutable state exist in the database.\n\n## Actual Behavior\nI have a case where a workflow stucks, retrieving the workflow through Temporal WebUI shows \"workflow execution history not found\". \n\nThen I looking at the log and found an DataLoss error (in-contiguous event branch) logged from Frontend Server. \n\nThen I found a tombstone for the record with the workflow runID as `tree_id` in the DB, indicate that Temporal executed a deletion against this workflow's history.\n\nThe log for Temporal also show \"deleting history garbage\" matches the time of the tombstone.\n\nAt this point, it clearly shown that Temporal was execute a history clean up against the running workflow. Please note that we can still get the mutable state from DB at this time (2 records: executions and current executions), only the history is lost.\n\nI did some review on the component that performed the deletion: history scavenger. And found out that there are 2 safeguards for a deletion to be executed:\n- history branch fork time is at least `historyScannerMinDataAge`\n- describe mutable state returns either `serviceerror.NotFound` or `serviceerror.NamespaceNotFound`.\n\nThe safeguard #1 is satisfied given our workflow is quite old.\nThe safeguard#2 I think it's the cause. Another key point is we also have [execution data cleaner](https://github.com/temporalio/temporal/blob/0f5469c0e5598e81d3c10c01ca6d246c79d0f421/service/worker/scanner/history/scavenger.go#L267) enabled. So I suspect since we can still get the mutable state, the problem lies somewhere in the namespace registry. I reviewed the namespace registry and found this [line](https://github.com/temporalio/temporal/blob/0f5469c0e5598e81d3c10c01ca6d246c79d0f421/common/namespace/nsregistry/registry.go#L559) can be problematic, it swallow any error returned from persistence and convert it to a NamespaceNotFound error, make safeguard #2 to be satisfied also.\n\n\n## Steps to Reproduce the Problem\n\n\n\n## Specifications\n\n  - Version: 1.22.0, but I think the [latest](https://github.com/temporalio/temporal/blob/ab20b732ca948c05da2c5e398a93c7d41231dff0/service/worker/scanner/history/scavenger.go#L271) code still have this issue.\n  - Platform:\n","closedAt":null,"comments":[],"createdAt":"2026-01-14T02:54:48Z","labels":[{"id":"MDU6TGFiZWwyMDE5ODE3MzQ2","name":"potential-bug","description":"","color":"66b9cc"}],"milestone":null,"number":9021,"reactionGroups":[],"state":"OPEN","title":"Possible premature deletion in History Scavenger","updatedAt":"2026-01-16T11:59:45Z","url":"https://github.com/temporalio/temporal/issues/9021"}
