{"assignees":[],"author":{"id":"MDQ6VXNlcjE3NTA2NDQx","is_bot":false,"login":"rfwagner","name":"Richard Wagner"},"body":"The authorization.Authorizer interface is an extension point that lets integrators define their own custom authorization logic. \r\n\r\nCurrently if a non-nil Authorizer is supplied, it is applied only to the workflow Handler (the Resource service). The code in frontend/service.go::Start wraps an AccessControlledWorkflowHandler around the base Handler and the AccessControlledWorkflowHandler calls the Authorizer interface on each API call, resulting in an Allow/Deny decision before forwarding the API call down to the base Handler (in the case of an Allow decision).\r\n\r\nThis same pattern should be applied to the AdminHandler as well. Our high level requirement here is that we are operating a multi-tenant Temporal cluster as a service and we want to disallow normal users from accessing admin commands via tctl. By applying the Authorizer interface to the AdminHandler API's, we are able to first check that the caller has admin credentials before forwarding the API call. Without an authorization wrapper around AdminHandler, this is not possible.\r\n\r\nI'm open to other approaches to disallowing users from accessing admin commands if there's a cleaner way to go about it, but the above seems like a straightforward approach.\r\n","closedAt":"2020-12-11T22:46:50Z","comments":[{"id":"MDEyOklzc3VlQ29tbWVudDc0MzQ2NjMxNQ==","author":{"login":"sergeybykov"},"authorAssociation":"MEMBER","body":"Authorization functionality has been refactored, so that Authorizer is invoked as an interceptor on all inbound gRPC calls for all handlers, which I believe addressed this. Feel free to reopen if I missed something.","createdAt":"2020-12-11T22:46:50Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/521#issuecomment-743466315","viewerDidAuthor":false}],"createdAt":"2020-07-09T19:29:54Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":521,"reactionGroups":[],"state":"CLOSED","title":"Authorizer should be applied to AdminHandler API's","updatedAt":"2020-12-11T22:46:50Z","url":"https://github.com/temporalio/temporal/issues/521"}
