{"assignees":[],"author":{"id":"MDQ6VXNlcjE3NTA2NDQx","is_bot":false,"login":"rfwagner","name":"Richard Wagner"},"body":"Currently a rolling bounce or rolling upgrade of Temporal results in lots of error messages related to shard stealing. Error messages include:\r\n\r\n```\r\nFailed to update shard\r\nError updating ack level for shard\r\nError updating timer ack level for shard\r\n```\r\n\r\nThese errors make it harder to identify real issues during a deployment and lead operators to tend to ignore these potentially important error messages.\r\n\r\nIdeally, we should be able to do a rolling bounce or rolling upgrade of Temporal without encountering these errors on a routine basis.\r\n\r\nOne thing to keep in mind here is that Temporal is very often deployed using Kubernetes. Any solution should be compatible with the default Kubernetes Deployment RollingUpdate strategy.","closedAt":null,"comments":[{"id":"MDEyOklzc3VlQ29tbWVudDg2NzA0MTAyMg==","author":{"login":"tristan-instacart"},"authorAssociation":"NONE","body":"I wonder if there is a way to throttle these error messages into warnings with a counter and then issue an error if the counter is exceeded? \r\nIn practice that is what I have done with my monitoring systems for temporal, essentially ignoring a certain level of these errors during deploys established by looking at historical deploys. \r\n\r\nAnother alternative might be to have some kind of knowledge that a shard rebalance or ringchange event is in progress and for a duration after that occurs drop these messages to a warning level. ","createdAt":"2021-06-23T17:52:43Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1428#issuecomment-867041022","viewerDidAuthor":false},{"id":"IC_kwDODNqesM6PXssr","author":{"login":"bbemis017"},"authorAssociation":"NONE","body":"We are seeing this issue a lot with hosting temporal in ECS. Typically on every deployment we see ~1,100 errors and 3 different error messages make up about 80% of those:\r\n\r\n- Error updating queue state\r\n- service failures\r\n- failed reaching server: Frontend is not healthy yet\r\n\r\nThese errors tend to subside within 10 minutes of the deployment so I believe they are related to this rolling bounce issue with temporal.\r\n\r\nWe ultimately want to make sure that we have good alerting that can accurately alert us when there is an issue but currently the error logs are very noisy. Since this issue has been open for a few years I'm curious if there are any updates on it or if folks have found any workarounds for this?","createdAt":"2024-10-10T14:54:40Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/temporal/issues/1428#issuecomment-2405354283","viewerDidAuthor":false}],"createdAt":"2021-04-02T16:55:05Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwyNTc2NTM3NzMy","name":"difficulty: hard","description":"","color":"ff0000"},{"id":"MDU6TGFiZWwyODE3MDk3ODQ0","name":"planning","description":"","color":"006b75"},{"id":"MDU6TGFiZWwzMDAxNDk5NzYw","name":"operations","description":"","color":"f9d0c4"}],"milestone":null,"number":1428,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":11}}],"state":"OPEN","title":"Aim for error free rolling bounces and upgrades of Temporal","updatedAt":"2024-10-10T15:02:55Z","url":"https://github.com/temporalio/temporal/issues/1428"}
