{"assignees":[],"author":{"id":"MDQ6VXNlcjc3NTQxMjA=","is_bot":false,"login":"yycptt","name":"Yichao Yang"},"body":"## Expected Behavior\r\n- A reset operation involves three runs: base run, current run and reset (new) run. If current run is running when processing a reset, it will be terminated. If current run is also a child workflow, then there's a question if it should report to its parent after the termination. \r\n- If current run is base run, then we should not report to parent, as we will have a new run for the child.\r\n- If current run is not base run, then we should report to parent as the new run is not a continuation of the current run. \r\n\r\n## Actual Behavior\r\n- In the `replyToParentWorkflow` [logic](https://github.com/temporalio/temporal/blob/a4849620e82d25ae0499164c58f72204fe7a8e7d/service/history/transfer_queue_active_task_executor.go#L355), we are checking if the current run is terminated by reset or not, which is not checking if current run is the base run.\r\n\r\nWe should use the new `ResetRunId` field in WorkflowExecutionInfo, which is only set when the workflow is the base run of a reset. However, note that with today's event-based replication stack, this ResetRunID field won't be replicated upon reset. So if we switch to that field now, we will temporary make things worse (if failover happens before the closeExecution task is processed) until state-based replication goes live. \r\n\r\nTo fix the issue before state-based replication, we can:\r\n1. Change existing replication logic and instead of generating a historyReplicationTask when workflow is closed, generate a SyncWorkflowState task (yes we have this sync state task in event-based world as well, but only works for closed workflow)\r\n2. Add some new fields to the Terminated event to indicate if the workflow is base run.\r\n\r\n\r\n## Steps to Reproduce the Problem\r\n\r\n  1.\r\n  1.\r\n  1.\r\n\r\n## Specifications\r\n\r\n  - Version:\r\n  - Platform:\r\n","closedAt":null,"comments":[],"createdAt":"2024-12-07T02:01:03Z","labels":[{"id":"MDU6TGFiZWwyMDE5ODE3MzQ2","name":"potential-bug","description":"","color":"66b9cc"}],"milestone":null,"number":6954,"reactionGroups":[],"state":"OPEN","title":"IsTerminatedByResetter should not be used for checking if child workflow should report to parent","updatedAt":"2024-12-07T02:01:03Z","url":"https://github.com/temporalio/temporal/issues/6954"}
