{"assignees":[],"author":{"id":"MDQ6VXNlcjg3MTUzNTI=","is_bot":false,"login":"arlyon","name":"Alexander Lyon"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nI have coded myself into a ticking-timebomb of a corner. I created a cluster for a hobby project that ended up getting far more use than intended and didn't have a great understanding when creating the cluster of the implications of `numHistoryShards` (which is set to 1). I want to resolve this by replicating to a new cluster with 1024 shards, failing over to it, and shutting off the old one, but have hit an insurmountable dead-end. I did not specify the 'global' flag when creating the namespace and there is no way to change that, so I can't enable replication, and can't change the number of history shards, and the workflows running (long-life on the order of months) are marooned. Since there is a single shard, most queries are cache misses leading to quite awful latency for certain routines (specifically, performing some query for a sufficiently large subset of workflows).\r\n\r\nI could route new workflows to a new parallel cluster at the application level but I really don't want to. This is essentially a hobby running in my spare time and I don't want to deal with the additional complexity involved.\r\n\r\n**Describe the solution you'd like**\r\n\r\nThis is a hybrid request; firstly this situation could be avoided altogether if the history shards could be scaled up as needed. Secondly, this situation could be remedied if I was able to mark namespaces as eligible for replication _after_ they are created. Alternatively, an option I investigated was somehow import events from one namespace / cluster to another, and do a full stop-the-world dump and import, but it seems this is not supported _either_.\r\n\r\n**Additional context**\r\n\r\nThese foot-guns are very easy to trigger and very hard to undo.","closedAt":"2023-10-05T23:35:45Z","comments":[{"id":"IC_kwDODNqesM5llYds","author":{"login":"arlyon"},"authorAssociation":"NONE","body":"A question I have is what is the implication of taking down the cluster and starting it up against the same persistence with a different shard count?\r\n\r\nEDIT: seems like this is not possible, the shard ID appears all over the place in the persistence store","createdAt":"2023-09-03T12:52:00Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4835#issuecomment-1704298348","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5llZ8t","author":{"login":"arlyon"},"authorAssociation":"NONE","body":"I am currently investigating manually calculating new shard IDs / hashes and updating the underlying persistence myself as if we had that many shard from the start, as well as manually marking a namespace as global","createdAt":"2023-09-03T13:17:43Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4835#issuecomment-1704304429","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5ll9lO","author":{"login":"arlyon"},"authorAssociation":"NONE","body":"Seems like the flag I am looking for is `  --promote-global`. The next hurdle is trying to add a second cluster to the namespace which seems to be ignored altogether.","createdAt":"2023-09-04T00:24:39Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4835#issuecomment-1704450382","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5oS8CC","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"Yes, you should be able to promote a local namespace to a global one with that --promote-global flag https://docs.temporal.io/cli/cmd-options#promote-global","createdAt":"2023-10-05T23:35:45Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4835#issuecomment-1749794946","viewerDidAuthor":false}],"createdAt":"2023-09-03T12:42:57Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":4835,"reactionGroups":[],"state":"CLOSED","title":"Retroactively make namespace global","updatedAt":"2023-10-05T23:35:45Z","url":"https://github.com/temporalio/temporal/issues/4835"}
