{"assignees":[],"author":{"id":"MDQ6VXNlcjUzNDcwMzk=","is_bot":false,"login":"eleduardo","name":"Eduardo Solis"},"body":"**Is your feature request related to a problem? Please describe.**\nSome environments require FIPS compliance (140-3 preferably) and even OWASP 10 recommends using it. Having the binaries built with FIPS modes turned on takes one build param and it would make the default builds pass those compliance requirements (where they exist) \n\n**Describe the solution you'd like**\n- Have the binaries be built with FIPS mode on, for go 1.24 and on this is already a simple flag to add (https://go.dev/doc/security/fips140) for older versions there is a simple recipe with GOEXPERIMENT and boringcrypto\n\n\n**Describe alternatives you've considered**\nOne alternative is to have two sets of binaries one set has regular builds and another set is built with FIPS and of course they produce the equivalent images, just like chaingard does. \n\nOf course we can all fork the repo and add the differences but would be great to have it build from the same base code! \n\n**Additional context**\nWhile FIPS is US thing it compliance requirements seem to force software into building on top of certified libraries. \n","closedAt":"2025-06-26T22:48:17Z","comments":[{"id":"IC_kwDODNqesM6zbv5j","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"We currently do not have plans on releasing more binaries. I would encourage building the server from source with these flags for now. I'll close the issue as not planned but feel free to reopen it in case you're having issues building the server with the flags on.","createdAt":"2025-06-26T22:48:17Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/7635#issuecomment-3010395747","viewerDidAuthor":false}],"createdAt":"2025-04-18T22:10:44Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":7635,"reactionGroups":[],"state":"CLOSED","title":"FIPS mode on for components","updatedAt":"2025-06-26T22:48:17Z","url":"https://github.com/temporalio/temporal/issues/7635"}
