{"assignees":[],"author":{"id":"MDQ6VXNlcjcwNDky","is_bot":false,"login":"criemen","name":"Cornelius Riemenschneider"},"body":"**Is your feature request related to a problem? Please describe.**\nI want to connect GitHub webhooks to temporal. In particular, I want to run a GH actions workflow as an activity in my temporal workflow.\nThis is not modelled really well with signals in the workflow: From receiving a [workflow_run](https://docs.github.com/en/webhooks/webhook-events-and-payloads#workflow_run) event, it's usually unclear which temporal workflow triggered this run.\nAlso, mixing control flow and signals is imo not very nice. I'd rather have this abstracted inside an activity (with timeouts, retry, etc).\n\nSo, I want to (and am) using an async activity.\nThe problem with that is that for that, I am _getting_ a unique ID (task token) from temporal, and I'm getting another unique ID from GitHub (workflow_run_id). I now have to manually correlate those two (in my case: By using a database table on the side that is accessible to both the temporal worker that starts the actions workflow, and the temporal client, that receives the GH webhooks).\nThis works well, but I'd rather not maintain a database myself.\n\n\n**Describe the solution you'd like**\nProvide the same async activity mechanism, but with an API where I hand temporal a unique ID (I have to promise uniqueness as part of the API contract, otherwise temporal is expected to throw an error), instead of getting a unique Id from temporal.\nI think that would lend itself neatly to all sorts of webhook-receiving problems, where the system you're integrating against hands out unique IDs.\nI believe in many cases, async activities will model flows in external systems much better than signal handlers in workflows, as activities compose much better (and are easier to be reused as well!) than signal handlers, that are rather workflow-specific.\n\n\n**Describe alternatives you've considered**\nSee above, I can manually map the IDs between the different systems. For that to be easier, a general-purpose KV-store exposed by temporal would also be appreciated, as then I don't need to manually maintain the database+database table+migration myself.\n\n\n**Additional context**\nI'm happy to answer any more questions about our use case.","closedAt":null,"comments":[],"createdAt":"2024-06-25T10:00:20Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":6192,"reactionGroups":[],"state":"OPEN","title":"Support externally-provided unique async completion token for async activities","updatedAt":"2024-06-25T10:00:20Z","url":"https://github.com/temporalio/temporal/issues/6192"}
