{"assignees":[],"author":{"id":"MDQ6VXNlcjc3NTQxMjA=","is_bot":false,"login":"yycptt","name":"Yichao Yang"},"body":"**Is your feature request related to a problem? Please describe.**\nA clear and concise description of what the problem is. Ex. I'm always frustrated when [...]\nCurrently task_latency is effectively in-memory latency and it's value = task ack time - task load time. This means it includes retry backoffs and latency for all attempts.\n\nThis works for normal workloads, however, there are cases like a large # of workflow trying to signal one workflow (or the opposite), where we have to delay those tasks since the operation against one workflow are serialized. In those cases task_latency will be very high and may trigger alerts.\n\n**Describe the solution you'd like**\nA clear and concise description of what you want to happen.\n\n\n* We can exclude latency related to workflow task from task_latency (or create a new metric). Idea is exclude task processing time and retry backoff if an attempt fails with workflow lock timeout.\n* Since the workflow lock timeout can happen for the target workflow, we need to change the logic for getting workflow lock to return a special error type to the caller indicating workflow lock can't be grabbed. Currently caller can only see a timeout error and can't tell if it's due to workflow lock or other issues.\n\n**Describe alternatives you've considered**\nA clear and concise description of any alternative solutions or features you've considered.\n\n**Additional context**\nAdd any other context or screenshots about the feature request here.\n\n","closedAt":"2023-06-26T21:23:47Z","comments":[{"id":"IC_kwDODNqesM5f3Hbg","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"Done by https://github.com/temporalio/temporal/pull/4408","createdAt":"2023-06-26T21:23:46Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3978#issuecomment-1608283872","viewerDidAuthor":false}],"createdAt":"2023-02-22T00:14:53Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":3978,"reactionGroups":[],"state":"CLOSED","title":"Exclude latency related to workflow lock from task_latency metric","updatedAt":"2023-06-26T21:23:47Z","url":"https://github.com/temporalio/temporal/issues/3978"}
