{"assignees":[],"author":{"id":"MDQ6VXNlcjE0ODU4NTEy","is_bot":false,"login":"amankagarwal","name":""},"body":"### Is your feature request related to a problem? Please describe.\nCurrently, there is no way to pause multiple schedules from the Temporal UI. Users must pause each schedule individually, which is time-consuming and inefficient when managing a large number of schedules (e.g., during maintenance, debugging). This leads to manual overhead and potential errors in high-volume environments.\n\n### Describe the solution you'd like\nI would like a bulk pause feature in the Temporal UI that allows users to select multiple schedules (or all schedules at once) and pause them with a single action. This could be implemented via a checkbox selection mechanism on the Schedules list page, with a \"Pause Selected\" or \"Pause All\" button. Ideally, it should include confirmation prompts, logging of the action, and the ability to filter schedules before bulk pausing (e.g., by task queue). The feature should also support resuming in bulk similarly for consistency.\n\n### Describe alternatives you've considered\nPausing schedules individually through the UI, which works for small numbers but scales poorly.\nUsing the Temporal CLI (e.g., temporal schedule pause) in a scripted loop to bulk pause via command-line automation, but this requires leaving the UI, writing scripts, and handling authentication/error-checking manually, which isn't as user-friendly for non-developers or quick operations.\nCustom tooling or API integrations to call the Temporal SDK for batch operations, but this adds development overhead and doesn't integrate directly with the UI experience.\n\n### Additional context\nThis feature would greatly improve usability for teams managing dozens or hundreds of schedules. For reference, Temporal's current UI supports bulk actions in other areas (like workflows), so extending this to schedules seems like a natural fit.","closedAt":"2025-09-17T11:53:05Z","comments":[],"createdAt":"2025-08-26T23:51:16Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":8247,"reactionGroups":[],"state":"CLOSED","title":"Bulk pause all schedules from Temporal web UI","updatedAt":"2025-09-17T12:00:32Z","url":"https://github.com/temporalio/temporal/issues/8247"}
