{"assignees":[],"author":{"id":"MDQ6VXNlcjUxNzY4Mw==","is_bot":false,"login":"Sushisource","name":"Spencer Judge"},"body":"**Is your feature request related to a problem? Please describe.**\r\nMany of the error messages returned when something can't be done b/c of database schema are very opaque.\r\n\r\nIn particular, [one user ran into this message](https://temporalio.slack.com/archives/C01DKSMU94L/p1638478211328000):\r\n```\r\ncreateOrUpdateCurrentExecution failed. Failed to insert into current_executions table. Error: pq: value too long for type character varying(255)\r\n```\r\n\r\nBecause their workflow type/name was too long. There are numerous other such failure paths that result in similarly opaque error messages.\r\n\r\n**Describe the solution you'd like**\r\nThese messages should be actionable by users without understanding the database schema / temporal internals. The solution for this one is relatively easy to guess if you know what's going on here, but if you don't it's pretty impossible to understand.\r\n\r\nI can see how this isn't necessarily easy to do since these messages will vary depending on the persistence backend and different backends may have slightly varying constraints, but perhaps some adapter that can interpret errors from the DB and turn them into something actionable is reasonable.\r\n\r\nFor this particular problem, ideally we'd see something like:\r\n```\r\ncreateOrUpdateCurrentExecution failed. The workflow type name is too long. The Postgres backend limits type names to 255 characters.\r\n```\r\n\r\n**Describe alternatives you've considered**\r\nValidation could be done client side but this could easily drift and presents a maintainability/coupling problem.\r\n\r\n**Additional context**\r\nAdd any other context or screenshots about the feature request here.\r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM46wKWk","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"dup of #2122 ","createdAt":"2021-12-03T17:35:32Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2252#issuecomment-985703844","viewerDidAuthor":false}],"createdAt":"2021-12-02T21:54:23Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":2252,"reactionGroups":[],"state":"OPEN","title":"Improve error message(s) returned when failing to meet database constraints","updatedAt":"2023-03-03T20:21:10Z","url":"https://github.com/temporalio/temporal/issues/2252"}
