{"assignees":[],"author":{"id":"MDQ6VXNlcjUyMDI1MDM=","is_bot":false,"login":"faucct","name":"Nikita Sokolov"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nIt is a sketch of an idea of an alternative persistence approach to for the same problem the Temporal is trying to solve which could be easier to use than Event Sourcing.\r\nI think, the Event Sourcing pattern makes Workflows' versioning harder than it could be.\r\nAlso storing and replaying the whole log seems ineffective and limits the Workflows' duration.   \r\n\r\n**Describe the solution you'd like**\r\n\r\nFor that you would need a language with the support for not only coroutines, but their suspension and serialization/deserialization at continuation points.\r\nThen instead of Event Sourcing the framework could persist the Workflows' coroutines states into the persistent storage.\r\n\r\nIf the Workflows' coroutines parts between the persisting continuation points are idempotent, then the Workflows would be consistent.\r\nFor Workflows versioning a serialization format with an explicit schema could be used (e.g. protobuf).\r\nThis would require the workflow definition to contain some sort of annotations: for each persistence point and every persisted field/variable, including nested coroutines which could also have their persistence points.  \r\n\r\n**Describe alternatives you've considered**\r\n\r\nI know that this project is a successor to Orleans.\r\nI am not sure if I got that right, but looks like it also uses Event Sourcing, thus suffers from the same problems – https://dotnet.github.io/orleans/docs/grains/event_sourcing/index.html.\r\nStill, its documentation mentions async/await, but it looks like it is in the different context – https://dotnet.github.io/orleans/docs/grains/external_tasks_and_grains.html.\r\n\r\nIt looks like SecondLife was doing something like coroutines persistence: https://tirania.org/blog/archive/2009/Apr-09.html, https://secondlife.blogs.com/babbage/2006/05/microthreading_.html\r\n\r\nI understand that you have probably invested a lot into the Event Sourcing approach and won't switch from it that easily, but still I want to know if this idea looks promising to you, considering you are tackling the same problem. I want to try implementing this approach for Kotlin, which does not support the required coroutine serialization at the moment.","closedAt":null,"comments":[],"createdAt":"2022-05-29T14:01:19Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":2918,"reactionGroups":[],"state":"OPEN","title":"Persistent Coroutine Workflows","updatedAt":"2023-03-03T20:20:17Z","url":"https://github.com/temporalio/temporal/issues/2918"}
