{"assignees":[],"author":{"id":"U_kgDOB1OQ5w","is_bot":false,"login":"avran02","name":""},"body":"We would like to thank the Temporal developers very much for their hard work in creating and maintaining this amazing framework. The contribution of the Temporal team to the development of tools for the development of long-lived applications is incredibly important for many developers and represents a truly valuable resource in modern software development.\r\n\r\nDue to the growing demand for the use of Yandex Database (YDB) in modern applications with high requirements for scalability and fault tolerance, we consider it important to add YDB support to the Temporary framework. Temporary is a powerful tool for developing long-lived applications, but currently the lack of native integration with YDB limits the capabilities of developers and reduces the competitiveness of the framework.\r\n\r\nFunctionality Details:\r\n1. Support for Yandex Database as a repository for Temporary, which will allow developers to take full advantage of the features provided by YDB, such as geographic data replication, automatic scaling and high fault tolerance.\r\n2. Integration of YDB functionality with the Temporary SDK to ensure ease of use and compatibility with existing applications.\r\n\r\nAdvantages:\r\n1. Expanding the potential audience of Temporary by YDB users interested in developing long-lived applications.\r\n2. Improved performance and scalability of applications using Temporary in combination with YDB.\r\n3. Increasing the competitiveness of Temporal in the market of long-lived application development tools.\r\n\r\nThis extension of Temporal functionality will enable developers to take full advantage of the benefits provided by YDB in their long-lived applications, which will make Temporal an even more attractive development tool.","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5xo77o","author":{"login":"rodrigozhou"},"authorAssociation":"MEMBER","body":"@avran02 Yandex has fork of Temporal using YDB: https://github.com/yandex/temporal-over-ydb\r\ncc: @aromanovich ","createdAt":"2024-01-23T17:21:43Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/5302#issuecomment-1906556648","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5xtEG6","author":{"login":"avran02"},"authorAssociation":"NONE","body":"> @avran02 Yandex has fork of Temporal using YDB: https://github.com/yandex/temporal-over-ydb\n> cc: @aromanovich \n\nThis fork is not a 100% functional solution, it would be great to see YDB support in Temporal out of the box. With the option to select DB as storage.","createdAt":"2024-01-24T08:34:55Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":10}}],"url":"https://github.com/temporalio/temporal/issues/5302#issuecomment-1907638714","viewerDidAuthor":false}],"createdAt":"2024-01-16T13:56:04Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":5302,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":23}},{"content":"HOORAY","users":{"totalCount":4}},{"content":"HEART","users":{"totalCount":22}},{"content":"ROCKET","users":{"totalCount":4}}],"state":"OPEN","title":"YDB Temporal support.","updatedAt":"2024-01-24T08:34:56Z","url":"https://github.com/temporalio/temporal/issues/5302"}
