{"assignees":[],"author":{"id":"MDQ6VXNlcjE1Njc0MTQ5","is_bot":false,"login":"raymondsze","name":"Sze Ka Wai Raymond"},"body":"Temporal is awesome!\nI read the documentation and tried the typescript examples. It do solve the current issue I am facing on distributed transaction.\nHowever, I found that Temporal officially support MySQL and Postgres. \nWe are working on on-premise product and some customers require MS SQL Server for the persistence.\nI would like to ask if there is any plan to support MS SQL Server. I found https://gitlab.com/lercher/temporal-sqls, but it seems not official.\n\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5SQuoM","author":{"login":"raymondsze"},"authorAssociation":"NONE","body":"any update?","createdAt":"2023-01-12T10:26:27Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3769#issuecomment-1380117004","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5bu8CL","author":{"login":"adeal"},"authorAssociation":"NONE","body":"My org (Salesforce) is also interested in support for Sql Server as the underlying persistence store.\r\n\r\nIs this being tracked as a feature request? We're open to ideas of making the initial contribution to the Temporal server.","createdAt":"2023-05-08T20:50:09Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3769#issuecomment-1539031179","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5b3NbP","author":{"login":"samarabbas"},"authorAssociation":"MEMBER","body":"Hey @adeal currently there is no plan to support MS SQL Server is the persistence plugin.  Initial contribution of the plugin is one concern but the bigger problem is ongoing cost of maintaining the plugin.  Ideally we would first refactor the persistence which allows these plugins to reside in separate repos and injected at runtime.  We also need to refactor the testing infrastructure where these plugins can be tested in a generic fashion.\r\nOnce we have this setup, then we can have external contributors provide and independently support plugins for other data sources.","createdAt":"2023-05-10T02:27:59Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3769#issuecomment-1541199567","viewerDidAuthor":false},{"id":"IC_kwDODNqesM54MhXv","author":{"login":"plaisted"},"authorAssociation":"NONE","body":"I've been tinkering with temporal persistence as a way to understand how things work a little better and was wondering if adding a built in grpc persistence implementation would be possible. It appears the storage is already abstracted into a set of interfaces. General idea would be to add a built in \"grpc\" persistence where configuration would be supplying an endpoint (or endpoints) + TLS information. The endpoint would then be responsible for implementing all the required grpc calls based on the existing persistence interfaces.\r\n\r\nThis would serve the same purpose as a golang plugin architecture but allow the standard temporal distribution (containers, binaries) to use custom persistence without modification (just add configuration). Obviously this comes at some performance cost (serialization, network hop) but thought I'd mention and see what people thought.","createdAt":"2024-03-23T17:03:33Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3769#issuecomment-2016548335","viewerDidAuthor":false}],"createdAt":"2023-01-03T13:58:55Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":3769,"reactionGroups":[],"state":"OPEN","title":"Any plan to support MS SQL Server?","updatedAt":"2024-03-23T17:03:34Z","url":"https://github.com/temporalio/temporal/issues/3769"}
