{"assignees":[],"author":{"id":"MDQ6VXNlcjE0OTgyMjc=","is_bot":false,"login":"albertyfwu","name":"Albert"},"body":"**Is your feature request related to a problem? Please describe.**\nSometimes, a workflow will call an activity that polls a service. We don't want error logs and metrics for the first, say, N activity retry attempts, but we want it thereafter. Recent changes allowed activities to return BENIGN errors, which suppress error logs and metrics. However, this is controlled by the activity.\n\nIs it possible to build something to allow the developer to specify at the instantiation site of the activity (alongside specification of retry policy in `ActivityOptions`) the exhaustion thresholds?\n\n**Describe the solution you'd like**\nI'd like for the developer to be able to specify at the instantiation site of the activity the benign exhaustion thresholds alongside the retry policy. Perhaps there is an interceptor on the activity side that reads in the settings, and maps exceptions to BENIGN when under the thresholds but passes exceptions through directly without transformation once the thresholds are breached.\n\n**Describe alternatives you've considered**\nOnly solution I can think of is:\n1. Use `ContextPropagator` and `WorkflowThreadLocal` to pass along benign retry policy config from the workflow to activity. Benign retry policy would be written immediately before scheduling activity and cleared immediately after activity returns.\n2. Interceptor in activity side reads out the benign retry policy config and transforms exceptions from activity if under benign threshold by setting `BENIGN` error category.\n\nIs this the best solution?\n\n**Additional context**\nHere is the previous change for allowing activities to throw BENIGN: https://github.com/temporalio/sdk-java/issues/704\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM7RZE3W","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"The Temporal server manages activity retries, all ways to control activity retries are already present in `ActivityOptions`. A user could partially emulate using an interceptor as you pointed out, but to handle timeouts and some other failures this would need to be managed by the Temporal server.","createdAt":"2025-11-10T17:26:29Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8611#issuecomment-3513011670","viewerDidAuthor":false},{"id":"IC_kwDODNqesM7RZFmd","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Transferring to the server repo as this is not a Java specific issue and the majority of the work is on the sever. ","createdAt":"2025-11-10T17:27:18Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8611#issuecomment-3513014685","viewerDidAuthor":false},{"id":"IC_kwDODNqesM7ZMw1m","author":{"login":"gow"},"authorAssociation":"MEMBER","body":"This was closed by mistake (due to a faulty integration). Reopening it.","createdAt":"2025-12-11T22:12:05Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8611#issuecomment-3644001638","viewerDidAuthor":false}],"createdAt":"2025-11-07T16:09:46Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":8611,"reactionGroups":[],"state":"OPEN","title":"Allowing workflow to specify max retry attempts / duration before an activity starts throwing non-BENIGN errors","updatedAt":"2025-12-11T22:12:05Z","url":"https://github.com/temporalio/temporal/issues/8611"}
