{"assignees":[],"author":{"id":"MDQ6VXNlcjc3NTQxMjA=","is_bot":false,"login":"yycptt","name":"Yichao Yang"},"body":"**Is your feature request related to a problem? Please describe.**\nRecordActivityStarted implementation today loads the ActivityScheduledEvent while holding the workflow lock. Also the event is not added to the events cache when the activity is being scheduled. This increases the time workflow is locked unnecessarily (because history is immutable and can be accessed without workflow being locked). \n\nWhen workflow schedules large number of activities at the same time, the transfer task for dispatching the activity (and RecordActivityStarted will be invoked on sync match) will compete with each other for the workflow lock and this additional locking makes the contention worse and task will start to fail, backoff and retry. \n\nOf course we can improve the task processing part to reduce/avoid lock contention, but fixing the RecordActivityStarted implementation is very straightforward and a low hanging fruit.\n\n**Describe the solution you'd like**\n- Read ActivityScheduledEvent outside workflow lock\n- Cache ActivityScheduledEvent\n\n**Describe alternatives you've considered**\nA clear and concise description of any alternative solutions or features you've considered.\n\n**Additional context**\nAdd any other context or screenshots about the feature request here.\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM67DMn3","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"we did put activityScheduledEvent into the cache: https://github.com/temporalio/temporal/blob/9746b5f72ed6bddb512c136a59f7e614de76dcd3/service/history/workflow/mutable_state_impl.go#L3487\n\nso loading them inside workflow lock is probably not an big deal. Need some extra data on event cache hit rate to confirm if the change will make any real difference or not.","createdAt":"2025-07-31T00:01:35Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8101#issuecomment-3138177527","viewerDidAuthor":false}],"createdAt":"2025-07-25T23:11:43Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":8101,"reactionGroups":[],"state":"OPEN","title":"Improve record activity started implementation","updatedAt":"2025-10-07T07:51:37Z","url":"https://github.com/temporalio/temporal/issues/8101"}
