{"assignees":[],"author":{"id":"MDQ6VXNlcjE4NzQwNjU5","is_bot":false,"login":"tomasfarias","name":"Tomás Farías Santana"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nWhen backfilling a schedule, there is no way to track which Workflow Executions correspond to the backfill. This can make it confusing to understand whether the runs I'm seeing in the UI are part of a backfill or regularly scheduled runs, especially when overriding the ScheduleOverlapPolicy by setting `ALLOW_ALL` when issuing a ScheduleBackfill request.\r\n\r\n**Describe the solution you'd like**\r\n\r\nA potential solution to this problem would be to extend the ScheduleBackfill request to support overriding search attributes of the Workflow Executions that are part of the backfill. This way, I can create a bool `IsBackfill` search attribute, set it to `False` in the Schedule's action, but override it to `True` in the ScheduleBackfill request. I could go beyond that, develop my own backfill abstraction on top of Temporal*, and set a `BackfilledById` keyword search attribute when issuing a backfill.\r\n\r\n[*]: This is exactly what we have done to deal with the Temporal buffer limit, which is a separate topic. We backfill _a lot_.\r\n\r\n**Describe alternatives you've considered**\r\n\r\nAs far as I can tell, there is no other way to identify Workflow Executions that are part of a Schedule Backfill. A very imprecise solution could be built around tracking the start time of the backfill, but with an `ALLOW_ALL` ScheduleOverlapPolicy, I can't see how this would work.\r\n\r\n**Additional context**\r\n\r\nI **think** (haven't dug to much into the code) this could be implemented by extending the `addStart` function [here](https://github.com/temporalio/temporal/blob/068bd38be15cc9af896680e4012f988086a33a78/service/worker/scheduler/workflow.go#L904) to take a mapping of search attributes to add to `s.State.BufferedStarts`. Then it's just a matter of passing that all the way down to the [`startWorkflow` function](https://github.com/temporalio/temporal/blob/main/service/worker/scheduler/workflow.go#L1052). Basically extending this [`BufferedStart` message](https://github.com/temporalio/temporal/blob/068bd38be15cc9af896680e4012f988086a33a78/proto/internal/temporal/server/api/schedule/v1/message.proto#L38) to support search attributes, exactly as how overriding the overlap policy is supported. \r\n\r\nI may be off the mark, but happy to give it a shot at implementing this if 1) it's deemed a valid feature, 2) my initial intuition is correct.\r\n\r\nThank you!","closedAt":null,"comments":[],"createdAt":"2023-10-19T20:39:16Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"LA_kwDODNqesM8AAAABbF9GFg","name":"schedules","description":"","color":"5E45A2"}],"milestone":null,"number":5005,"reactionGroups":[],"state":"OPEN","title":"Schedules: Allow overriding search attributes when backfilling","updatedAt":"2023-10-21T19:01:41Z","url":"https://github.com/temporalio/temporal/issues/5005"}
