{"assignees":[],"author":{"id":"MDQ6VXNlcjc3NTQxMjA=","is_bot":false,"login":"yycptt","name":"Yichao Yang"},"body":"**Is your feature request related to a problem? Please describe.**\r\nRight now we have one task type tag value look up table for each queue processor: active/standby transfer/timer and visibility. Is it possible to get rid of the look up table and dynamically generate the value based on task type (there's an existing proto enum definition for task type)?\r\n\r\nSee discussion here: https://github.com/temporalio/temporal/pull/2930#discussion_r891459319\r\n\r\n**Describe the solution you'd like**\r\nA clear and concise description of what you want to happen.\r\n- If we want the exact same metrics as today, we need to do some string manipulation on the return value of taskType.String(). For example, replace \"Transfer\" with \"TransferActiveTask\" or add \"TimerActive\" to the return value. And there's some special case where taskType.String() does not match the currently emitted task type tag value.\r\n    - We can update proto definition for those enums so that there's no special case. But we still need to add \"Active\" or \"Standby\" to the return value.\r\n    - We make a small \"breaking\" change and change the task tag value emitted. Since our dashboard queries aggregates on task type, the dashboard will continue to worker. Only when the query is for a specific task type, will it be break. But still, \"Active\" or \"Standby\" need to be added to the return value.\r\n- Use a new tag for active & standby. This will break existing dashboard and we need to update all dashboard & alert queries. \r\n\r\n**Describe alternatives you've considered**\r\nA clear and concise description of any alternative solutions or features you've considered.\r\n\r\n**Additional context**\r\nAdd any other context or screenshots about the feature request here.\r\n","closedAt":null,"comments":[],"createdAt":"2022-06-14T00:51:08Z","labels":[{"id":"MDU6TGFiZWwxNzkwMTM1NzM5","name":"refactoring","description":"","color":"e8b181"},{"id":"MDU6TGFiZWwyNTQ2NTE2MDA0","name":"metrics","description":"","color":"e5f97f"}],"milestone":null,"number":2991,"reactionGroups":[],"state":"OPEN","title":"Dynamically generate task type tag value in timer/transfer queue processing","updatedAt":"2023-03-03T20:19:31Z","url":"https://github.com/temporalio/temporal/issues/2991"}
