{"assignees":[],"author":{"id":"U_kgDOBejSVw","is_bot":false,"login":"alexseedkou","name":"Jingcheng Kou"},"body":"**Is your feature request related to a problem? Please describe.**\r\nThis is a follow-up feature of this [issue](https://github.com/temporalio/temporal/issues/987).\r\n\r\nFor an async call, the activity may fail due to a bug or design drawback after a call to an external server. However, temporal server may receive a request from `CompleteByID` API by other servers while the new attempt for a retryable error of the activity is not started yet. In this case, if the request is to complete the activity, we would complete the activity even the new attempt has not started yet so that we can unblock the workflow (refer this [PR](https://github.com/temporalio/temporal/pull/5724)). However, if the request is to fail the activity, we may think an appropriate way to handle such cases as we are not sure the failure is to fail the activity or it is a transit error and we want to attempt the activity again.\r\n\r\n**Describe the solution you'd like**\r\nFor the request to fail an activity:\r\n1) If the request is to force fail an activity, we should fail the activity if the attempt for a retryable error has not started yet.\r\n2) If the request is to fail an activity due to a non-retryable error, we should fail the activity.\r\n\r\n**Describe alternatives you've considered**\r\nWe may introduce a separate API or a flag for a client to tell the server that it would like a request to force fail the activity.\r\n\r\n**Additional context**\r\nAdd any other context or screenshots about the feature request here.\r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM59NKK2","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"Let me take a stab at the explanation.\r\n\r\n[This PR](https://github.com/temporalio/temporal/pull/5724) now allows completing an activity by ID when an activity is backing off between attempts.\r\n\r\nThere are two other APIs for resolving an activity that we considered changing the behavior for while an activity is backing off: `RespondActivityTaskFailedById` and `RespondActivityTaskCanceledById`.\r\n\r\nFor `RespondActivityTaskCanceledById` there's no need to do anything because the server immediately resolves the activity as canceled.\r\nFor `RespondActivityTaskFailedById`, there are a couple of different cases:\r\n- The failure is non-retryable (e.g. a non retryable ApplicationFailure, a failure that is matched in the retry policy's non retryable error types, and a failure reported in the last permitted attempt). In this case, we may want to allow unblocking the workflow and resolving the activity as failed.\r\n- The failure is retryable. This call should IMHO be a noop to avoid wasting an activity attempt without having a chance to get started and triggering the next retry backoff.\r\n\r\nAs @alexseedkou we may want to consider an explicit flag to \"force\" the activity to fail, bypassing the retry policy, but I think using a non retryable application failure can already be used as that marker.","createdAt":"2024-05-08T13:38:44Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":2}}],"url":"https://github.com/temporalio/temporal/issues/5877#issuecomment-2100601526","viewerDidAuthor":false},{"id":"IC_kwDODNqesM59NzyV","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Just a note that once this done, we'll need to update API and SDKs documentation to reflect the fact that `RespondActivityTask*` and `RespondActivityTask*ById` have different behaviors in regard to in-backoff activities.","createdAt":"2024-05-08T14:52:09Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/5877#issuecomment-2100771989","viewerDidAuthor":false},{"id":"IC_kwDODNqesM59OJk6","author":{"login":"mfateev"},"authorAssociation":"MEMBER","body":"> The failure is retryable. This call should IMHO be a noop to avoid wasting an activity attempt without having a chance to get started and triggering the next retry backoff.\r\n\r\nThere is a feature request to retry activity immediately when waiting for the next retry. So we either introduce another method to force immediate retry or assume such a `Respond call` is such a request. ","createdAt":"2024-05-08T15:36:15Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/5877#issuecomment-2100861242","viewerDidAuthor":true}],"createdAt":"2024-05-08T01:20:17Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":5877,"reactionGroups":[],"state":"OPEN","title":"Address force completion when make a request through CompleteByID with a failure.","updatedAt":"2024-05-08T15:36:16Z","url":"https://github.com/temporalio/temporal/issues/5877"}
