{"assignees":[],"author":{"id":"MDQ6VXNlcjc3NTQxMjA=","is_bot":false,"login":"yycptt","name":"Yichao Yang"},"body":"**Is your feature request related to a problem? Please describe.**\r\nWhen doing reset, signals and updates after the reset point will be reapplied (cherry-picked) to the new run. However all those reapplied events are grouped into one batch. Our persistence layer has a validation that basically says each event batch can't be exceeded 4MB size limit (each batch is a separate call to persistence). This means if the size of reapplied events is larger than 4MB, the reset can't be done.  \r\n\r\nThis issue from my understanding only applies to reset, where events from more than one event batches in the base workflow can be picked. The events reapply logic during conflict resolution is triggered by the replication task of a single batch of event, so we won't run into the situation. \r\n\r\n**Describe the solution you'd like**\r\nReset with more than 4MB reapplied events should be supported.\r\n\r\nApproach 1:\r\n- In history builder code, automatically track current event batch size and create a new batch if size limit is exceeded.\r\n\r\nApproach 2:\r\n- Make this specific to reset logic. Track the size of reapplied events and call an method on history build to create a new batch.\r\n\r\n**Describe alternatives you've considered**\r\nA clear and concise description of any alternative solutions or features you've considered.\r\n\r\n**Additional context**\r\nAdd any other context or screenshots about the feature request here.\r\n","closedAt":null,"comments":[],"createdAt":"2024-03-05T22:18:02Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":5493,"reactionGroups":[],"state":"OPEN","title":"Automatically split history event batches when size of reapplied events are too large","updatedAt":"2024-06-10T22:38:04Z","url":"https://github.com/temporalio/temporal/issues/5493"}
