{"assignees":[],"author":{"id":"MDQ6VXNlcjc3NTQxMjA=","is_bot":false,"login":"yycptt","name":"Yichao Yang"},"body":"**Is your feature request related to a problem? Please describe.**\nExiting logic slows down workflow task retry by increasing workflow task start to close timeout (up to 10min) and rely on the fact that SDK won't respond workflow task failure if workflow task has attempt > 1.\n\nHowever this does't work well with features that need to wait for pending workflow task to complete. \nOne example is Query. If there's a pending workflow, query must wait for it to complete before it can be dispatched. Before that, query is buffered in-memory in workflow mutable state. Now since it can take workflow task a long time to complete, mutable state may get evicted from cache and query API will fail with Unavailable error, or the query API itself can timeout.\n\n**Describe the solution you'd like**\nEssentially need a better way for handling workflow task retry\n\n* Workflow pause feature\n* Do not override workflow task start to close timeout, but schedule a backoff time for the next workflow task attempt.\n\n**Describe alternatives you've considered**\nA clear and concise description of any alternative solutions or features you've considered.\n\n**Additional context**\nAdd any other context or screenshots about the feature request here.\n\n","closedAt":"2023-09-02T01:09:11Z","comments":[{"id":"IC_kwDODNqesM5lixBI","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"We have separate issue to track pause work.\r\nFor the query problem, it should fail fast because if workflow task keeps failing, the query would fail as well. Instead of waiting for next workflow task, it is better to fail fast which is already implemented.","createdAt":"2023-09-02T01:09:11Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4022#issuecomment-1703612488","viewerDidAuthor":false}],"createdAt":"2023-03-07T02:38:23Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":4022,"reactionGroups":[],"state":"CLOSED","title":"Improve workflow task retry handling","updatedAt":"2023-09-02T01:09:11Z","url":"https://github.com/temporalio/temporal/issues/4022"}
