{"assignees":[],"author":{"id":"MDQ6VXNlcjE0NjM2MjI=","is_bot":false,"login":"mfateev","name":"Maxim Fateev"},"body":"**Is your feature request related to a problem? Please describe.**\r\nSome applications require different retry behavior based on error codes. For example ([source](https://community.temporal.io/t/custom-retry-policy-per-error-type-for-activity/8772)):\r\n\r\n> Hi, we are currently trying to design retry policy for our activity. The activity is calling http server and we want to retry based on the http status code.\r\n> \r\n> The default for 5xx, it will be retryable with shorter backoff of e.g. 2 sec as these are mostly intermittent.\r\n> For 429 (rate limiter) error we want to retry with longer backoff e.g. 1 min.\r\n> For 400 error, this might happen because a resource in the server are currently being ‘paused’ by human operator for maintenance. This maintenance is expected to be done < 10 mins, after which the resource is available again. We want to auto retry this request with long backoff e.g. 10 mins.\r\n> Other 4xx will NOT be retryable.\r\n\r\nProviding different retry options will partially help, but for rate limit error changing backoff of an individual activity is not going to help as the aggregate rate across all of them can still be high.\r\n\r\n**Describe the solution you'd like**\r\nUse a different rate limited (possibly with a dynamic rate limiter) task queue to retry activities in certain scenarios. This way retries of activities that failed with a specific error code would be scheduled in a separate task queue. This allows other activities to execute and retry without being limited.\r\n\r\nThe queue might not be directly exposed to a user and be an implementation detail.\r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5g6R79","author":{"login":"mfateev"},"authorAssociation":"MEMBER","body":"This can also solve the problem of workflow tasks that are constantly failing, affecting healthy workflows.","createdAt":"2023-07-07T18:52:58Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/4600#issuecomment-1625890557","viewerDidAuthor":true}],"createdAt":"2023-07-07T18:50:35Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":4600,"reactionGroups":[],"state":"OPEN","title":"Use different task queue for activity and workflow task retries","updatedAt":"2023-07-07T18:52:58Z","url":"https://github.com/temporalio/temporal/issues/4600"}
