{"assignees":[],"author":{"id":"MDQ6VXNlcjM0MTgxMDQw","is_bot":false,"login":"raymondji","name":"Raymond Ji"},"body":"**Is your feature request related to a problem? Please describe.**\r\nThe same as https://github.com/temporalio/features/issues/515: \"The use case here is to prevent from having to put a long timer (months) at the top of a workflow and force maintaining history compatibility for as long as that workflow lives.\"\r\n\r\nWorkflows that implement some type of loop-with-sleep pattern could benefit from this feature. Currently they would need to be long lived workflows (with the accompanying history compatibility constraints), but adding a start delay to continue-as-new options would allow them to be represented as a series of short-lived workflows.\r\n\r\nMore generally, any workflow that needs to perform work after sleeping could potentially be rewritten in a \"recursive\" way using this feature. They would then benefit from being a short-lived workflow and e.g. could better take advantage of worker versioning.\r\n\r\n**Describe the solution you'd like**\r\nSupport start delay in continue-as-new options.\r\n\r\n**Describe alternatives you've considered**\r\nThe alternatives today are:\r\n- Sleep within the workflow, but this requires you to maintain history compatibility for the duration of the sleep\r\n- Start a new workflow within an activity, but that loses the parent-child relationship and history.\r\n\r\n**Additional context**\r\nhttps://restate.dev/blog/code-that-sleeps-for-a-month/#control-loops describes a similar approach for a different durable execution tool.\r\n","closedAt":null,"comments":[],"createdAt":"2024-11-16T16:57:34Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":6834,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"state":"OPEN","title":"Support start delay in continue-as-new options","updatedAt":"2024-12-07T20:23:32Z","url":"https://github.com/temporalio/temporal/issues/6834"}
