{"assignees":[],"author":{"id":"MDQ6VXNlcjIyMzg1MjE1","is_bot":false,"login":"mmxmb","name":"Max"},"body":"_I will be using Go SDK naming here. But I believe this is a server-side feature request._\r\n\r\n**Is your feature request related to a problem? Please describe.**\r\n\r\nIt is possible to start a new workflow and send a signal to it in a signal transaction using `SignalWithStartWorkflow`. However, it is not possible to continue a workflow as new (`NewContinueAsNewError`) and send a signal to it in a single transaction.\r\n\r\nA workflow example that demonstrates why this might be useful:\r\n\r\n* The workflow is running \"an infinite loop\" by returning `NewContinueAsNewError` at the end of each execution. \r\n* During each iteration of this workflow it runs some activities given an input. This input can be updated while the workflow is running. The workflow will finish the current iteration using the old input. The updated input is used on the next iteration.\r\n*  In fact, the input can be updated multiple times during the single iteration. The next iteration must use the most recent input. All other input is considered stale and is discarded.\r\n* The workflow sleeps at the end of each iteration if no new input was provided and starts the next iteration using the old input.\r\n* If new input was provided while the workflow was running activities/during sleep, it skips sleep/stop sleeping and starts the next iteration using the new input right away.\r\n\r\nThis description suggests that it's best to provide input as a signal.\r\n\r\nPseudocode to implement this workflow:\r\n\r\n1. Start workflow/signal already running workflow using `SignalWithStartWorkflow`\r\n2. Receive input signal\r\n3. Long running activities that use input\r\n4. Sleep unless new input is received:\r\n4.1. No new input. Sleep until timer finishes. Return `NewContinueAsNewError` and signal old input in the same transaction.\r\n4.2 New input was signalled (maybe several signals). Drain signal channel to get the most recently provided input. Return `NewContinueAsNewError` and signal new input in a single transaction.\r\n\r\n**Describe the solution you'd like**\r\n\r\nAdd new error type that is like `NewContinueAsNewError` but allows signalling the new workflow in a single transaction like `SignalWithStartWorkflow`.\r\n\r\n**Describe alternatives you've considered**\r\n\r\n\r\nRight now I wrote my workflow to accept the same input struct using both workflow function argument and signal. I need to accept input as signals because of the requirement to be able to update input for the next iteration while the current iteration is running. I need to be able to provide input as argument since this is currently the only way to provide input to the workflow that is started using `NewContinueAsNewError`.\r\n\r\nProviding the same input type using both workflow argument and signal is awkward, thus my feature request.\r\n\r\n**Additional context**\r\n\r\nIn case my use case description and pseudocode don't make sense, here's the skeleton implementation of the workflow that I currently have: https://gist.github.com/mmxmb/d3a2b490855c98f0a28f3f6d30a005e2","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5Wqoo_","author":{"login":"mmxmb"},"authorAssociation":"NONE","body":"Any reason why this was closed?","createdAt":"2023-03-03T19:23:57Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3008#issuecomment-1454017087","viewerDidAuthor":false}],"createdAt":"2022-06-21T03:04:13Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"LA_kwDODNqesM7-SUnK","name":"feature-request","description":"","color":"4C2E9C"}],"milestone":null,"number":3008,"reactionGroups":[],"state":"OPEN","title":"Continue workflow as new and signal in a single transaction","updatedAt":"2023-03-03T20:19:33Z","url":"https://github.com/temporalio/temporal/issues/3008"}
