{"assignees":[],"author":{"id":"MDQ6VXNlcjMwMDg0MDQz","is_bot":false,"login":"VikasNS","name":"Vikas NS"},"body":"## Expected Behavior\r\n1. When the inline archival of history fails, it will be archived by signaling the temporal system archival workflow.\r\n2. If the signaling fails, no archival should be attempted and neither the deletion of execution history.\r\n3. Archival should be reattempted. \r\n\r\n## Actual Behavior\r\n1. When the signaling fails from the perspecitive of the caller due to context deadline exceeded(300ms), the temporal system workflow somehow gets the signal and it archives and deletes the history.\r\n2. From the perspecitive of the caller, as the signal failed, the archival will be reattempted. In the subsequest attempt, archival fails stating that the execution history is unavailable (obvious reason : it was deleted in the last attempt)\r\n3. I believe the root cause of this problem is the small value for context deadline (300ms)\r\n\r\n\r\n## Steps to Reproduce the Problem\r\n\r\n  1. Fail the inline history archival so that it will take the signal route\r\n  2. Have the timeout set to 300ms (default) or less\r\n  3. Run temporal with some load to introduce latency\r\n\r\n## Specifications\r\n\r\n  - Version: 1.1.12\r\n  - Platform: Java\r\n","closedAt":"2022-02-05T04:23:54Z","comments":[{"id":"IC_kwDODNqesM49ae4s","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"The linked PR should mitigate this issue. \r\n\r\nIt's possible that history archiver get multiple duplicated requests for the same workflow and process them in parallel.\r\nSo history not found error should be treated as an expected error and skip archival instead of fatal non-retryable error.","createdAt":"2022-02-04T21:11:35Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2464#issuecomment-1030352428","viewerDidAuthor":false},{"id":"IC_kwDODNqesM49bLCO","author":{"login":"VikasNS"},"authorAssociation":"NONE","body":"@yycptt \r\nWant to understand what this means to the ressiliency of archival.\r\n\r\nSay the first time I attempt to signal the archival workflow, it fails.  What if it was geninue failure where the archival workflow didn't really recieve the signal?\r\n\r\nIn this case, post signal failure, previously the task would fail and would be retried, howoever with this PR, what's gona happen.?\r\n\r\nThe reason I'm asking this is, Our wf history is very important. If I'm deleting wf history from persistance db falsly assuming that the workflow has been archvied, it would be a data loss we can't afford.\r\n\r\n\r\nIn my openion, we should be deleting wf history only if we are 100% sure that it has been successfully archived. If the signal fails, we can check if the worklfow has been archived, if yes, we can ignore the signal failure and proceed to delete the wf history. Else if the worklfow hasn't been archvied, we can't delete the wf histry and the task needs to be retried. ","createdAt":"2022-02-05T05:48:38Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2464#issuecomment-1030533262","viewerDidAuthor":false},{"id":"IC_kwDODNqesM49ctQM","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"The linked pr won't change the ressiliency of archival. It only changes how workflow history not found is handled while doing archival (return nil error instead of reporting non-retryable since history not found is an expected case). Regardless of how we can handle the history not found case, there's nothing we can upload because the history is already gone.\r\n\r\nThe PR doesn't touch the signaling part at all and transfer task will be retried until the archival request is delivered to the system workflow. ","createdAt":"2022-02-06T23:10:08Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2464#issuecomment-1030935564","viewerDidAuthor":false},{"id":"IC_kwDODNqesM49dqjd","author":{"login":"VikasNS"},"authorAssociation":"NONE","body":"Got it Thanks.\r\nWith this change, the archival activity will no longer fail if the history is not found?","createdAt":"2022-02-07T08:17:48Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2464#issuecomment-1031186653","viewerDidAuthor":false}],"createdAt":"2022-02-04T18:42:01Z","labels":[{"id":"MDU6TGFiZWwyMDE5ODE3MzQ2","name":"potential-bug","description":"","color":"66b9cc"}],"milestone":null,"number":2464,"reactionGroups":[],"state":"CLOSED","title":"Archival attempted for already archived workflow","updatedAt":"2022-02-07T08:17:48Z","url":"https://github.com/temporalio/temporal/issues/2464"}
