{"assignees":[],"author":{"id":"U_kgDOBg93xA","is_bot":false,"login":"zzhu-bison","name":""},"body":"**Is your feature request related to a problem? Please describe.**\r\nCurrently historyArchiver and visibilityArchiver reply on global aws credentials to access s3 archive buckets. There are a number of issues with this approach.\r\n\r\n1. works for ec2, an IAM role can directly attach to instance profile, but it opens a security hole, a shared ec2 would allow all services running on the host to gain access.\r\n2. works for ecs, but would not work for k8s workload, which requires role attaches to a service account, involves additional complicated setups\r\n\r\n**Describe the solution you'd like**\r\nWould like historyArchiver & visibilityArchiver offers first lookup on aws secret from a path, then fall back to global environment vars or aws profiles or instance profiles.\r\n\r\nThe credential file path approach should work for both ec2 workloads and k8s workloads where a secret can be set at a mount volume.\r\n\r\n**Describe alternatives you've considered**\r\nK8s alternative would be attaching IAM role to service account which requires OIDC setup, will not work if there is no existing OIDC provider in the cluster\r\n\r\nSecrets can also be passed in as environment vars to a container, however this defeats the purpose of having one centralized secret repo in many organizations. \r\n\r\n**Additional context**\r\nService secret should limit its visibility to just service alone, exposing or assuming secret availability in global environment is not a safe approach.\r\n","closedAt":"2022-06-28T16:54:47Z","comments":[{"id":"IC_kwDODNqesM5FrA_g","author":{"login":"jontro"},"authorAssociation":"CONTRIBUTOR","body":"I think you can just set the AWS_SHARED_CREDENTIALS_FILE environment variable if you want to specify a specific file. \r\nI think we are following aws best practices here by not interfering with the defaults.\r\nhttps://docs.aws.amazon.com/sdk-for-go/v1/developer-guide/configuring-sdk.html#specifying-credentials","createdAt":"2022-06-28T15:55:30Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2894#issuecomment-1168904160","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5FrUdy","author":{"login":"zzhu-bison"},"authorAssociation":"NONE","body":"Close this request. Injecting secrets to ENV vars is equivalent to injecting secrets to a mounted file.  ","createdAt":"2022-06-28T16:54:47Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2894#issuecomment-1168983922","viewerDidAuthor":false}],"createdAt":"2022-05-23T21:28:36Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"LA_kwDODNqesM743zS7","name":"archival","description":"","color":"494536"}],"milestone":null,"number":2894,"reactionGroups":[],"state":"CLOSED","title":"{feature request} (history|visibility)Achriver reads aws credentials from a file path for s3 archiving","updatedAt":"2022-06-28T16:54:47Z","url":"https://github.com/temporalio/temporal/issues/2894"}
