{"assignees":[],"author":{"id":"MDQ6VXNlcjY0MDc1NjY=","is_bot":false,"login":"vswom","name":"SPANO Vincent"},"body":"**Is your feature request related to a problem? Please describe.**\n\nI'm always frustrated when I need to manually start a workflow from the Temporal Web UI that depends on custom headers for context propagation (e.g., `x-tenant-id` in multi-tenant applications).\n\nCurrently, the Web UI allows me to specify Workflow ID, Task Queue, Input, Memo, and Search Attributes, but there's no way to add custom headers. This means I cannot test or manually trigger workflows that rely on header-based context without writing separate scripts or using the CLI, which defeats the purpose of having a user-friendly Web UI.\n\n**Describe the solution you'd like**\n\nI would like to see a \"Headers\" section added to the \"Start Workflow\" form in the Web UI, similar to the existing \"Memo\" and \"Search Attributes\" sections.\n\nThe interface could accept a JSON object where keys are header names and values are header values (strings):\n\n```json\n{\n  \"x-tenant-id\": \"tenant-123\",\n  \"x-user-id\": \"user-456\"\n}\n```\n\nThis would allow users to specify custom headers when starting workflows, just like they can do programmatically via the SDK:\n\n```typescript\nawait client.workflow.start(myWorkflow, {\n  taskQueue: 'default',\n  workflowId: 'my-workflow-id',\n  args: [{ data: 'value' }],\n  headers: {\n    'x-tenant-id': 'tenant-123'\n  }\n});\n```\n\n**Describe alternatives you've considered**\n\n1. **Using Memo**: This doesn't work because workflow interceptors and middleware typically read from headers via `workflowInfo().headers`, not from memo\n2. **Using Search Attributes**: Same limitation as memo, plus search attributes have type constraints and are meant for querying, not context propagation\n3. **Using Temporal CLI**: This works (`temporal workflow start --header \"x-tenant-id=tenant-123\"`), but requires CLI access and is less convenient than the Web UI\n4. **Creating wrapper API endpoints**: This adds unnecessary infrastructure complexity just to work around a UI limitation\n\n**Additional context**\n\nMany modern applications use header-based context propagation for cross-cutting concerns like tenant identification, tracing, authentication, etc. This pattern is common in multi-tenant SaaS applications and is inspired by standards like OpenTelemetry's baggage propagation.\n\nSupporting custom headers in the Web UI would:\n- Align the Web UI capabilities with what's possible via the SDK\n- Improve developer and operations team productivity\n- Make the Web UI a complete tool for workflow management, not just workflow monitoring\n\nThis feature would be particularly valuable for testing, debugging, and operational scenarios where manual workflow triggering is needed.\n","closedAt":null,"comments":[],"createdAt":"2026-01-13T09:07:34Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":9012,"reactionGroups":[],"state":"OPEN","title":"Add Custom Headers Support to \"Start Workflow\" Form in Web UI","updatedAt":"2026-01-13T09:07:34Z","url":"https://github.com/temporalio/temporal/issues/9012"}
