{"assignees":[],"author":{"id":"MDQ6VXNlcjUxMjk5ODY=","is_bot":false,"login":"jcmonteiro","name":"João C. Monteiro"},"body":"**Is your feature request related to a problem? Please describe.**\nI have a setup where an orchestrator workflow calls child workflows. The parent workflow defines the \"top-level\" logic (much like a flowchart) and delegates the specifics to the children. The pattern works well in my use case since the goal is to isolate the parent workflow from the implementation details of each step.\n\nIn case the parent must be reset, I would like its children to be reused with a \"Use Existing\" reuse policy. The challenge is that this option is not supported when starting a child workflow.\n\n**Describe the solution you'd like**\nSupport for selecting the \"Workflow Id Conflict Policy\" when starting a child workflow (in Python).\n\n**Describe alternatives you've considered**\n- Redesigning our use pattern with workflows and child workflows. \n- Selecting the \"Workflow Id Reuse Policy\" to \"Terminate if Running.\" Not ideal since the child Workflow could still be healthy.\n\n**Additional context**\nI am using the Python SDK, but noticed the option is also not present in the other SDKs.\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM7Jaa5n","author":{"login":"mfateev"},"authorAssociation":"MEMBER","body":"This is a reasonable request. Note that this assumes each child has an explicitly assigned WorkflowId, which remains unchanged after the reset. By default, the random seed changes after the reset, leading to different child workflow IDs.","createdAt":"2025-10-08T00:31:21Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/7882#issuecomment-3379146343","viewerDidAuthor":true}],"createdAt":"2025-06-07T04:58:53Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":7882,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"state":"OPEN","title":"Support for selecting \"Workflow Id Conflict Policy\" for child workflows","updatedAt":"2025-10-08T00:31:21Z","url":"https://github.com/temporalio/temporal/issues/7882"}
