{"assignees":[{"id":"MDQ6VXNlcjQ2NjcyMw==","login":"dnr","name":"David Reiss","databaseId":0}],"author":{"id":"MDQ6VXNlcjE3NTA2NDQx","is_bot":false,"login":"rfwagner","name":"Richard Wagner"},"body":"It is possible for poorly managed user executions to result in scenarios that cause Cassandra tombstone scanning issues.\r\n\r\nWe ran into one such scenario:\r\n\r\n- an integration test ran every hour of every day. It created a cron workflow that fired every minute\r\n- under normal circumstances, the test would verify that the cron workflow ran 2 or 3 times and then terminate the workflow\r\n- but if the test crashed or there was test infrastructure failure, the workflow was never terminated, resulting in a cron that created a new workflow task every minute, forever\r\n- these workflows were being submitted to unique task queues (every run of the test created a task queue with a uuid in the name)\r\n- so there were never any workers to pick up these wf tasks and advance the cursor on the tasks table\r\n- but since new tasks were being submitted by the orphaned cron every minute, the task manager for the task queue remained active and the taskReader would scan over all the tombstones resulting from the TTL'ed tasks on the queue\r\n\r\nFrom speaking with Samar it sounds like one possible approach is to stop using TTL's to remove expired tasks from the tasks table and instead delete them explicitly. This would give the task reader an opportunity to move the cursor when it determined there were no active tasks beyond a certain point.\r\n","closedAt":null,"comments":[],"createdAt":"2021-05-27T22:24:15Z","labels":[{"id":"MDU6TGFiZWwyMDE5ODE3MzQ2","name":"potential-bug","description":"","color":"66b9cc"},{"id":"MDU6TGFiZWwyNTc2NTM3NTI4","name":"difficulty: medium","description":"","color":"ffaf11"},{"id":"MDU6TGFiZWwzMDAxNDk5NzYw","name":"operations","description":"","color":"f9d0c4"}],"milestone":null,"number":1579,"reactionGroups":[],"state":"OPEN","title":"Continued submission of tasks to an orphaned task queue can lead to Cassandra tombstone scanning issues","updatedAt":"2023-03-03T20:22:10Z","url":"https://github.com/temporalio/temporal/issues/1579"}
