{"assignees":[{"id":"MDQ6VXNlcjg0NDExMDE0","login":"yiminc","name":"Yimin Chen","databaseId":0}],"author":{"id":"MDQ6VXNlcjUzMjEwOA==","is_bot":false,"login":"Spikhalskiy","name":"Dmitry Spikhalsky"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nIf workflow code that created invalid commands got deployed onto workers, this causes each worker to become a spin loop:\r\n1. Worker takes workflow task\r\n1. Submits incorrect commands to the server in `RespondWorkflowTaskCompletedRequest`\r\n1. Server immediately fails the workflow task\r\n1. And immediately resubmits new workflow task for execution\r\n1. Repeat 1.\r\n\r\n**Describe the solution you'd like**\r\n\r\nTemporal Server should perform an Exponential Backoff before creating new WorkflowTaskScheduled events for previously failed Workflow Tasks. After some time and a number of attempts, we can even consider pausing it completely. Timers can be used to implement it.\r\n\r\n**Describe alternatives you've considered**\r\n\r\n*What we already have on the SDK side to mitigate an absence of server Backoff*\r\nIf a workflow task fails on the SDK side, JavaSDK already tries to implement an SDK-side backoff by simulating workflow task timeout on subsequent failures of the same workflows task. So, if `attempt > 1` and workflow task handling failed on the SDK side, instead of reporting a failure, we just drop the task without reporting anything. This causes a retry in 10 seconds (default Workflow Task timeout). So, most problems appear on the SDK side during Workflow Task execution and they get throttled using this SDK side mechanism.\r\n\r\n*Why it can't be a permanent solution* \r\nSDK can't perform the same exact validation as a server (and shouldn't do it), so it's always possible that a command will be formed by an SDK that will fail server-side validation. If it happens, the current approach with SDK side \"backoff\" doesn't help, because it's the server that performs an immediate failing of the Workflow Task and immediate rescheduling of it, SDK hasn't caught the problem when it has control. SDKs can't interfere at this stage already.\r\nSDKs could try to do something like slowing down reporting of successful `RespondWorkflowTaskCompletedRequest` to the server on the SDK side if `attempt > 1`, but this would be too much of a hack. Also, the SDK side can't implement an exponential backoff or any other logic, SDKs can only be close but under Workflow Task Run Timeout, which is static, user-defined, and far from ideal.\r\n\r\n**Additional context**\r\nUser in the original issue actually was able to DDOS their Temporal server deployment by workers deployment that causes all the workers to submit malformed commands:\r\nhttps://github.com/temporalio/sdk-java/issues/901\r\n\r\nPreviously filed related task without context: #1303\r\n\r\n\r\n","closedAt":"2022-10-08T06:00:46Z","comments":[{"id":"IC_kwDODNqesM5BN_Jy","author":{"login":"Spikhalskiy"},"authorAssociation":"CONTRIBUTOR","body":"Partially mitigated in #2548 by simulating a timeout instead of registering workflow task failure if it's >=2 attempt to execute the task.","createdAt":"2022-04-10T05:46:21Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2238#issuecomment-1094185586","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5L1M3G","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"The backoff part is considered done. The other part to pause workflow is requested here: https://github.com/temporalio/temporal/issues/3006","createdAt":"2022-10-08T06:00:46Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2238#issuecomment-1272237510","viewerDidAuthor":false}],"createdAt":"2021-11-29T23:17:59Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwyODE3MDk3ODQ0","name":"planning","description":"","color":"006b75"},{"id":"MDU6TGFiZWwzMDAxNDk5NzYw","name":"operations","description":"","color":"f9d0c4"}],"milestone":null,"number":2238,"reactionGroups":[],"state":"CLOSED","title":"Add WorkflowTask Backoff for WorkflowTask failures on the server","updatedAt":"2022-10-08T06:00:47Z","url":"https://github.com/temporalio/temporal/issues/2238"}
