{"assignees":[],"author":{"id":"MDQ6VXNlcjE3NTA2NDQx","is_bot":false,"login":"rfwagner","name":"Richard Wagner"},"body":"It's a common scenario for users to enhance their existing workflows by adding new activities.\r\n\r\nThe SDK offers a Versioning API that allows these new activities to be called in a way that preserves non-determinism and allows for deployment of the new workflow code while workflows using the old code are still running.\r\n\r\nHowever, when the new worker code is rolled out (let's assume we have workers that implement both the workflow and activity code), you will experience transient errors related to activity tasks for the newly added activity being routed to workers that are running the old workflow/activity code that don't have implementations of the new activity.\r\n\r\nOnce the new code is rolled out completely and no more old workers are running, these transient errors will disappear.\r\n\r\nHowever this is still less than ideal from two perspectives:\r\n\r\n1) This is a common scenario (new activities) and the transient errors result in confusion and ignoring them must be baked into users playbooks, they must be distinguished from real errors caused by any new code being deployed\r\n\r\n2) There may be scenarios where you want to roll out the new worker code to a canary region or cluster while leaving the old code running for an extended period. At this point, dealing with the errors becomes more problematic\r\n\r\nIt would be a cleaner experience all around if the system could somehow understand which workers - all listening on the same task queue - implement which activities and routed the activities accordingly.\r\n\r\nNote that it is possible to use separate task queues for the old and new code to avoid this situation, but this is pretty involved  operationally and comes with its own headaches (setting properties to configure task queue names etc)","closedAt":"2023-08-27T17:39:46Z","comments":[{"id":"MDEyOklzc3VlQ29tbWVudDg2ODg1OTU1OQ==","author":{"login":"wxing1292"},"authorAssociation":"CONTRIBUTOR","body":"Support error free upgrade of workflow / activity logic / SDK is part of our feature road map.","createdAt":"2021-06-25T22:14:32Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1689#issuecomment-868859559","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5lA2tC","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"Now supported via worker versioning: https://docs.temporal.io/workers#worker-versioning","createdAt":"2023-08-27T17:39:46Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/1689#issuecomment-1694722882","viewerDidAuthor":false}],"createdAt":"2021-06-24T22:24:10Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwyMDE5OTIzNjU1","name":"devexp","description":"","color":"9350b7"},{"id":"MDU6TGFiZWwzMTM4ODI4MTE3","name":"up-for-grabs","description":"Issues to consider for external contribution","color":"69CD90"}],"milestone":null,"number":1689,"reactionGroups":[],"state":"CLOSED","title":"Support error free upgrade when new activities are added to existing workflows","updatedAt":"2023-08-27T17:39:46Z","url":"https://github.com/temporalio/temporal/issues/1689"}
