{"assignees":[{"id":"MDQ6VXNlcjc3NTQxMjA=","login":"yycptt","name":"Yichao Yang","databaseId":0}],"author":{"id":"MDQ6VXNlcjc3NTQxMjA=","is_bot":false,"login":"yycptt","name":"Yichao Yang"},"body":"**Is your feature request related to a problem? Please describe.**\r\n- https://github.com/temporalio/temporal/pull/2988 added Predicate.Equals() which checks if two predicates have the same form and value. Since the check won't try to re-arrange the predicates (especially when and/or/not operations are involved), the result will contains false negatives even if mathematically two predicates are equivalent.\r\n\r\n- At current stage we think ^ check is sufficient as 1. in most cases our predicates are quite simple and should be equal even when form is taken into consideration 2. When false negatives are returned we will simply not merge (attach) two queue slices and there's no cost for correctness and performance. (All it costs is some additional storage costs for storing an additional queue slice scope data, which is negligible)\r\n\r\n- If in the future it turns out that we always have a large number of queue slices, we may want to implement a real equivalence check for predicates so that more queue slices can be merged together.\r\n\r\n- Creating this issue to track that this is something we can improve in the future.\r\n\r\n**Describe the solution you'd like**\r\nA clear and concise description of what you want to happen.\r\n\r\n**Describe alternatives you've considered**\r\nA clear and concise description of any alternative solutions or features you've considered.\r\n\r\n**Additional context**\r\nAdd any other context or screenshots about the feature request here.\r\n","closedAt":null,"comments":[],"createdAt":"2022-06-14T18:52:45Z","labels":[{"id":"MDU6TGFiZWwyMDE5OTE1MjIx","name":"performance","description":"","color":"f4f275"},{"id":"MDU6TGFiZWwyNTk0NTYwMDQy","name":"backlog","description":"","color":"0144E5"}],"milestone":null,"number":2995,"reactionGroups":[],"state":"OPEN","title":"Task Predicate Equivalence Check","updatedAt":"2023-03-03T20:19:32Z","url":"https://github.com/temporalio/temporal/issues/2995"}
