{"assignees":[],"author":{"id":"MDQ6VXNlcjE0NjM2MjI=","is_bot":false,"login":"mfateev","name":"Maxim Fateev"},"body":"**Is your feature request related to a problem? Please describe.**\r\nWhen a parent calls continue-as-new the child behaves according to its ParentClosePolicy. A common scenario is to keep children running until the whole chain of parent continue-as-new calls is complete. In this case the only option is to set ParentClosePolicy to ABANDON. But it disables the ability to terminate all the children automatically when the parent is terminated.\r\n\r\n**Describe the solution you'd like**\r\nAdd a flag that specifies if ParentClosePolicy applies when the chain is done or the run is done. Besides not being backward compatible, I propose to default it to when the whole chain is done. The strawman for the flag is `parentClosePolicyScope` with RUN, WORKFLOW_CHAIN (or just WORKFLOW). \r\n\r\nIf parentClosePolicyScope is set to WORKFLOW_CHAIN then terminating the last run of a workflow will terminate all the children started by the whole chain. This obviously should obey the parent retention interval as information about the past children started by deleted due to retention runs might not be available. ","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5sVmlR","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"When parent continue as new, it does not carry over child, the new run does not consider previous run's child as their child. \r\nWe cannot keep carry over child to next run as will become unbounded. \r\nThe possible solution for this new parent_close_policy is for the system workflow that handles the policy to traversal the chain backwards if the scope of the policy is to the chain. \r\nThe scope also needs to be passed down when doing ContinueAsNew. ","createdAt":"2023-11-18T19:16:05Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3666#issuecomment-1817602385","viewerDidAuthor":false}],"createdAt":"2022-11-25T20:38:04Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":3666,"reactionGroups":[],"state":"OPEN","title":"Add ability to invoke the ParentClosePolicy on chain completion not the run completion.","updatedAt":"2023-11-18T19:16:06Z","url":"https://github.com/temporalio/temporal/issues/3666"}
