{"assignees":[],"author":{"id":"MDQ6VXNlcjUzMjEwOA==","is_bot":false,"login":"Spikhalskiy","name":"Dmitry Spikhalsky"},"body":"**Is your feature request related to a problem? Please describe.**\r\nCurrently, Temporal Server limits incoming gRPC messages to 4Mb, and it's not configurable.\r\nImagine a workflow that spawns a lot of parallel local activities and finishes WFT with markers recording metadata for all of them. Even if each blob stays well under its limit (currently 2Mb, configurable), it's easy to imagine scenarios where 4Mb may not be enough for one Workflow Task Completion gRPC message like this.\r\nSee test that verifies that Temporal Server indeed exposes 4Mb limit for one gRPC message: https://github.com/Spikhalskiy/java-sdk/commit/fbf6b2132d79987a1ba00c247fdcb56ac3b3047b#diff-bcdd516c1dacd09cfc0403c44fd01abad994f23bd144b61758353bd2fb136958R88\r\n\r\n**Describe the solution you'd like**\r\n\r\nLimit for an incoming gRPC message to be lifted to a max history size. Or some percentage of max history size.\r\nAn alternative solution is to set it to a larger value by default and expose one more configuration option. But less configuration is better.\r\n\r\n**Additional context**\r\nThere is a concern that the persistent layer likely limits the size of one history batch and this will need to be changed to make this possible. Or one workflow task completion message containing N messages may be split into K batches if possible.\r\nThis concern needs to be verified.\r\nThe server currently also has a transaction size limit, which defaults to 4MB, but is configurable: `system.transactionSizeLimit`.\r\n\r\n**Additional considerations and goals**\r\nOne of the additional goals may also be to interlink \r\n- incoming gRPC message limit\r\n- max history size\r\n- transactionSizeLimit\r\n- history batch size\r\n\r\nand derive them from one configuration parameter (probably max history size) to keep the configuration reasonably simple for users. These variables have a clear dependency on each other and they limit each other. Too many free variables, too simple to misconfigure, too cumbersome to describe that they all need to be changed at once.","closedAt":"2024-05-16T05:53:04Z","comments":[],"createdAt":"2022-04-29T15:28:24Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":2786,"reactionGroups":[],"state":"CLOSED","title":"Relax maximum inbound frontend gRPC message size enforcement","updatedAt":"2024-05-16T05:53:04Z","url":"https://github.com/temporalio/temporal/issues/2786"}
