{"assignees":[{"id":"MDQ6VXNlcjIwNjgxMjQ=","login":"rodrigozhou","name":"Rodrigo Zhou","databaseId":0}],"author":{"id":"MDQ6VXNlcjE2NjAwMTAw","is_bot":false,"login":"jeacott1","name":""},"body":"I would like to be able to keep an Elasticsearch cluster performant,  manageable, and affordable by having the ES visibility storage provider roll to a new indexname periodically. \r\nie per month index names might be {namespace}-202301, {namespace}-202302, etc, or per year {namespace}-2023, {namespace}-2024. A configurable user defined pattern that allows custom field values as target indexnames would also be a nice add. There should then be a means to search across a range of indexes (with the default range being configurable, or all?)\r\n\r\nThis would allow searches to target the indexes by date range (or custom field etc) thereby being much more efficient. This would also allow automatic ES migration of older content to cheaper ES tiers, or archiving them.\r\n\r\n**Describe alternatives you've considered**\r\nI am not aware of any real alternative. \r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5skLPZ","author":{"login":"rodrigozhou"},"authorAssociation":"MEMBER","body":"We don't have support for this at this moment. But I wonder if you created index aliases, maybe it might work.","createdAt":"2023-11-21T18:14:21Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/5105#issuecomment-1821422553","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5smHpH","author":{"login":"jeacott1"},"authorAssociation":"NONE","body":"@rodrigozhou I'm not sure how aliases would help with creating the index names. \r\nES will create an index based on whatever name you write to - afaik there's no option to make this dynamic with temporal right now. This would be a small change that would at least relieve the single index problem.\r\nAs for reading across the multiple generated indexes, yes you could use an alias in the short term, but ideally you generate a list of index names covering the timespan you care about and query with those. Otherwise with a simple alias pattern of my-index-* you'll always be querying the ever growing list of all the indexes which will eventually break. It also means you cant move old indexes to cold nodes because they'll constantly be hit.\r\n\r\nedit -  ES does have a feature where you can write to an index with a construct like index-{now/d{YYYYMMDD}\r\nbut it's not at all clear to me if it accepts real timestamps instead of now.\r\nIn order for this feature to be useful and idempotent, the date needs to come from an actual document field, not just now.\r\n","createdAt":"2023-11-22T01:07:16Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/5105#issuecomment-1821932103","viewerDidAuthor":false}],"createdAt":"2023-11-12T07:24:16Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":5105,"reactionGroups":[],"state":"OPEN","title":"Add support to create Elasticsearch rolling indexes in visibility","updatedAt":"2023-11-22T11:28:02Z","url":"https://github.com/temporalio/temporal/issues/5105"}
