{"assignees":[{"id":"MDQ6VXNlcjQ2NjcyMw==","login":"dnr","name":"David Reiss","databaseId":0}],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"## Expected Behavior\r\n\r\nWith either buffer or allow-all, we should support people triggering multiple actions\r\n\r\n## Actual Behavior\r\n\r\nSilently some aren't triggered.\r\n\r\nThis has been discussed before and it is a known limitation of the system currently. We only allow 1 workflow per second and we can't fail a trigger is within that. This bug is track this known issue in case others see it.\r\n\r\nIdeally we should/could change workflow ID to have a unique value put on the end if it duplicates (so no uniqueness value if it doesn't, but maybe starting at `-2` if it does). This can be done via an attempted start followed by a counter on already-exists (it's obviously unreasonable to track which ones have already run and we can't guarantee time is monotonic).\r\n\r\nAnother concern is what if my system clock sync moves me back some seconds to fix skew? Could this cause a duplicate workflow ID?","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5OnUlQ","author":{"login":"paulnpdev"},"authorAssociation":"MEMBER","body":"- isn't the 1-per-second limit a configurable limit?  I assumed it was only there to avoid accidental duplication.\r\n- I don't understand your request to generate (e.g. appending an ordinal) non-duplicate keys.  Are you suggesting the server do this generation or the Worker?\r\n- wrt your question about skew creating duplicate wf IDs, that won't happen unless your workflow is configured to *allow* duplicates.\r\n- ","createdAt":"2022-11-17T16:58:08Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3614#issuecomment-1318930768","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5Ong3u","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> isn't the 1-per-second limit a configurable limit? I assumed it was only there to avoid accidental duplication.\r\n\r\nNot that I am aware of. We actually set workflow IDs to their second-resolution timestamp from what I'm seeing and of course Temporal can't have more than one workflow ID running at a time.\r\n\r\n> I don't understand your request to generate (e.g. appending an ordinal) non-duplicate keys. Are you suggesting the server do this generation or the Worker?\r\n\r\nServer. Server already appends timestamp to user-configured workflow ID, it's just at a second resolution.\r\n\r\n> wrt your question about skew creating duplicate wf IDs, that won't happen unless your workflow is configured to allow duplicates.\r\n\r\nIt can happen for manually triggering. If I trigger a workflow that starts at `01:02:03` (with the workflow ID that starts at that), then two seconds later at `01:02:05` I trigger a workflow but the server clock has been reset back `-2` seconds, this same uniqueness piece would be hit. The appended unique counter would alleviate this.","createdAt":"2022-11-17T17:37:52Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/3614#issuecomment-1318981102","viewerDidAuthor":false}],"createdAt":"2022-11-17T16:44:44Z","labels":[{"id":"MDU6TGFiZWwyMDE5ODE3MzQ2","name":"potential-bug","description":"","color":"66b9cc"},{"id":"LA_kwDODNqesM8AAAABbF9GFg","name":"schedules","description":"","color":"5E45A2"}],"milestone":null,"number":3614,"reactionGroups":[],"state":"OPEN","title":"Cannot trigger/run multiple schedule actions immediately","updatedAt":"2023-10-22T04:46:46Z","url":"https://github.com/temporalio/temporal/issues/3614"}
