{"assignees":[],"author":{"id":"MDQ6VXNlcjg0NDExMDE0","is_bot":false,"login":"yiminc","name":"Yimin Chen"},"body":"When setting maxTaskQueueActivitiesPerSecond to enable rate limit on task queue, the token is consumed when task is attempted to be delivered. However, the task could be invalid (expired or workflow already closed), which lead to waste of rate limit token.\r\n\r\nWe should change this to only consume token when task is delivered. ","closedAt":null,"comments":[{"id":"IC_kwDODNqesM6GC4SL","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"I think if you do this in the obvious way, it'll create more problems. Like if you block on the rate limiter after a task is assigned to a poller, and then the poller times out, you have to put the task on the end of the queue, so you'd get a lot more cycling and maybe fail to deliver entirely for low rate limits.\r\n\r\nTwo other approaches could be:\r\n1. If you fail to deliver the task for any reason after it comes from the matcher, return the token that was taken (so another task can go immediately). This would probably look like storing a reservation in the task and canceling it in finish if there was an error.\r\n2. Make the task validator more aggressive so these tasks are more likely to be thrown away before they get matched.\r\n","createdAt":"2024-07-24T21:08:57Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/temporal/issues/6333#issuecomment-2248901771","viewerDidAuthor":false},{"id":"IC_kwDODNqesM6J4Zch","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"For 1 (returning the token after delivery failure), it turns out that the rate limiter doesn't support canceling a reservation after its time has passed, so the logic would have to be more complicated.","createdAt":"2024-08-27T18:41:31Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/6333#issuecomment-2313262881","viewerDidAuthor":false}],"createdAt":"2024-07-24T19:21:38Z","labels":[{"id":"MDU6TGFiZWwyMDE5ODE3MzQ2","name":"potential-bug","description":"","color":"66b9cc"}],"milestone":null,"number":6333,"reactionGroups":[],"state":"OPEN","title":"Do not consume rate limit token on invalid tasks","updatedAt":"2025-04-08T05:14:44Z","url":"https://github.com/temporalio/temporal/issues/6333"}
