{"assignees":[],"author":{"id":"MDQ6VXNlcjEyMjM2Mjkw","is_bot":false,"login":"arnesenfamily","name":""},"body":"While working on a postgres integration, I think I found a bug in the temporal-sql-tool executable where a connection to a postgres db instance is not possible unless the database name is one of the default names (postgres or defaultdb) which I think is due to line of code in the tools/sql/handler.go file linked below which blanks out the cfg.DatabaseName value before creating a new connection to the database. Unfortunately, my postgres db instance name is not one of the two default values and I don't have control over the instance name. This means that I cannot use the temporal-sql-tool at all as it will never be able to connect to the database because the instance name is not postgres or defaultdb. \r\n\r\nhttps://github.com/temporalio/temporal/blob/df43fbaac73953d3ef6a3e4f14bf5f25bf70e59b/tools/sql/handler.go#L107\r\n\r\nIs there a reason why the cfg.DatabaseName value is blanked out here? Could we add an if-clause to only blank it out for mysql (assuming it's for mysql use cases)?\r\n","closedAt":"2022-05-27T21:51:53Z","comments":[{"id":"IC_kwDODNqesM5Dp3YG","author":{"login":"arnesenfamily"},"authorAssociation":"CONTRIBUTOR","body":"I guess a workaround could be to manually create a defaultdb or postgres db instance first which would enable this tool to establish a connection but that seems odd just to be able to run the create-database command. I might as well just create the temporal db instance manually and skip the create-database command and just use the tool to setup the schema (which I might end up doing). ","createdAt":"2022-05-23T19:17:33Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2890#issuecomment-1135048198","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5Dp32v","author":{"login":"arnesenfamily"},"authorAssociation":"CONTRIBUTOR","body":"FYI, that's why I closed the ticket and then re-opened it. While searching for work-arounds, I thought that I had just missed something and it was working as the create-command started not failing but it turns out all db instances were hidden in my admin tool and I had accidentally created the postgres db instance, which made the tool start working.","createdAt":"2022-05-23T19:19:35Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/2890#issuecomment-1135050159","viewerDidAuthor":false}],"createdAt":"2022-05-23T17:21:26Z","labels":[],"milestone":null,"number":2890,"reactionGroups":[],"state":"CLOSED","title":"Postgres Database Connection Issue If DB not one of defaults","updatedAt":"2022-05-27T21:51:53Z","url":"https://github.com/temporalio/temporal/issues/2890"}
