{"assignees":[{"id":"MDQ6VXNlcjgyNDg4MDY=","login":"sergeybykov","name":"Sergey Bykov","databaseId":0}],"author":{"id":"MDQ6VXNlcjE3NTA2NDQx","is_bot":false,"login":"rfwagner","name":"Richard Wagner"},"body":"Our use case is that we are running a multi-tenant Temporal cluster as a service. As cluster operators, we want to be in charge of all admin operations and all namespace provisioning operations. In addition, we would like to ensure that normal users can only see namespaces that they own.\r\n\r\nThe basic building block to enable this today is the authorization.Authorize interface. It works, but the interface is fairly simplistic. The only information we have to go on to make a Deny/Allow decision is whatever credentials we find in the context along with the name of the API call (as a string) and the name of the target namespace, if any.\r\n\r\nWe can do string matching on the APIName to disallow RegisterNamespace, UpdateNamespace and DeprecateNamespace for non admin-credentialed callers, but this feels brittle. Is there some way to add finer granularity to the Authorize interface so that we could know more directly that an API call is updating the set of namespaces?\r\n\r\nListNamespaces is also problematic: we want normal users to be able to run 'tctl namespace list' and see the namespaces they own, but not the ones they don't. Again, we can implement this with the existing interface by doing post filtering of results returned by the delegate handler, but it feels a little brittle.\r\n\r\nThinking out loud: perhaps authorization.Result could be extended to include a list of allowed namespaces for the given call:\r\n\r\n\tResult struct {\r\n\t\tDecision Decision\r\n                AuthorizedNamespaces []string\r\n\t}\r\n\r\ninterpreted as:\r\n\r\n    - in the case of an API that targets a single namespace, allow the call if Decision == DecisionAllow and the target is in the supplied list or the supplied list is empty(?)\r\n    - in the case of an API that targets multiple namespaces (i.e. namespace list), allow the call but restrict results to the specified namespaces\r\n","closedAt":"2022-10-29T18:47:31Z","comments":[{"id":"MDEyOklzc3VlQ29tbWVudDY2Mjc0MjA2Mw==","author":{"login":"rfwagner"},"authorAssociation":"NONE","body":"Expanding on this statement from above regarding adding authorization to 'namespace list': \"Again, we can implement this with the existing interface by doing post filtering of results returned by the delegate handler, but it feels a little brittle.\"\r\n\r\nActually, doing this requires either:\r\n\r\n1. supplying our own complete implementation of an AccessControlledWorkflowHandler or\r\n2. modifying the stock implementation of AccessControlledWorkflowHandler\r\n\r\n1 means maintaining a lot of boilerplate delegation code just to work around this issue. 2 means maintaining changes in a fork of the upstream temporal code. So neither approach is very attractive.\r\n","createdAt":"2020-07-22T23:10:20Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/522#issuecomment-662742063","viewerDidAuthor":false},{"id":"MDEyOklzc3VlQ29tbWVudDc0MzQ2ODc0NA==","author":{"login":"sergeybykov"},"authorAssociation":"MEMBER","body":"With the refactored authorization mechanism of `Authorizer` and `ClaimMapper`, we now support handling an explicit set of per-namespaces user roles and system-level roles for operations, such as `RegisterNamespace`.\r\n\r\nHowever, `ListNamespaces` is still problematic because we aren't filtering results upstream. ","createdAt":"2020-12-11T22:54:58Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/522#issuecomment-743468744","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5NPmPY","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"The authorizer is now capable of handling per-namespace user roles. This should satisfy the major ask of this issue. The limitation on filtering the ListNamespaces still exists, but that be a separate issue if that is needed.","createdAt":"2022-10-29T18:47:31Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/522#issuecomment-1295934424","viewerDidAuthor":false}],"createdAt":"2020-07-10T00:31:09Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":522,"reactionGroups":[],"state":"CLOSED","title":"Authorizer interface could be richer","updatedAt":"2022-10-29T18:47:32Z","url":"https://github.com/temporalio/temporal/issues/522"}
