{"assignees":[],"author":{"id":"MDQ6VXNlcjExMDIxNTU5","is_bot":false,"login":"andrii-kysylevskyi","name":"Andrii Kysylevskyi"},"body":"**Is your feature request related to a problem? Please describe.**\nTemporal supports Cassandra as a storage backend, and ScyllaDB is often presented as a drop-in Cassandra alternative. It’s currently not mentioned in the documentation, and it's unclear whether using ScyllaDB with Temporal is recommended, unsupported, or simply unverified.\n\nWhile looking into this, I found a few previous discussions that touched on ScyllaDB behaviour or compatibility questions:\n\n- https://github.com/temporalio/temporal/issues/2683\n- https://github.com/temporalio/temporal/issues/3511#issuecomment-1287535816\n- Possibly related: https://github.com/temporalio/temporal/issues/1267\n\nThis issue is mostly to clarify the current state and consolidate conversations in one place.\n\n**Describe the solution you'd like**\nSome clarification in the docs or guidance, such as:\n\n- ScyllaDB is expected to work, but has not been officially tested, or\n- Compatibility may be revisited in the future if there is interest.\n\nNo changes requested to core code right now - just a clearer direction for users evaluating storage options.\n\n**Describe alternatives you've considered**\n\n- Relying on scattered Slack/GitHub discussions.\n- Community blog posts or notes (easy to get outdated).\n\n**Additional context**\nOpening this issue to track the topic and give a single reference point if ScyllaDB or Temporal contributors decide to explore this further. Happy to add more details if helpful. I would also be happy to add the note about ScyllaDB support (in whichever way the team prefers)\n\nThanks a lot in advance!","closedAt":null,"comments":[{"id":"IC_kwDODNqesM7dCcPL","author":{"login":"andrii-kysylevskyi"},"authorAssociation":"NONE","body":"Hi! I’m revisiting this after a long break - would love to hear if anyone has thoughts or suggestions on the idea above.\n\nTagging @dnr as you’ve been active on related PRs recently.\n\nThanks in advance!","createdAt":"2026-01-04T20:35:07Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8652#issuecomment-3708404683","viewerDidAuthor":false},{"id":"IC_kwDODNqesM7eX6lS","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"Hello @andrii-kysylevskyi, we are happy to review & take contributions needed for making ScyllaDB work (like those you linked). Unfortunately, the team don't really have the bandwidth to **officially** maintain & verify a new DB implementation at this point. \n\nIf ScyllaDB claims itself to be compatible, then it should work out of the box. \nFor production usage, there's obviously a risk though as we don't really do any release testing/validation on top of ScyllaDB.\n\n","createdAt":"2026-01-09T22:36:56Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8652#issuecomment-3730811218","viewerDidAuthor":false},{"id":"IC_kwDODNqesM7ed0u_","author":{"login":"mykaul"},"authorAssociation":"NONE","body":"> Hello [@andrii-kysylevskyi](https://github.com/andrii-kysylevskyi), we are happy to review & take contributions needed for making ScyllaDB work (like those you linked). Unfortunately, the team don't really have the bandwidth to **officially** maintain & verify a new DB implementation at this point.\n\nYaniv, VP RnD of ScyllaDB here.\nI'd be happy to work with the team to make it officially supported. We continue to have customers asking about it. They love Temporal but other NoSQL solutions don't deliver enough to their needs. \n\n> \n> If ScyllaDB claims itself to be compatible, then it should work out of the box. For production usage, there's obviously a risk though as we don't really do any release testing/validation on top of ScyllaDB.\n\n\"In theory, there's no difference between theory and practice. In practice, there is\". \n\nLet me know what can we mutually do to make it tested and validated regularly. \nWe were (are) also considering using it internally, btw. \n\n","createdAt":"2026-01-10T10:28:28Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8652#issuecomment-3732360127","viewerDidAuthor":false},{"id":"IC_kwDODNqesM7hCh7h","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"Hi @mykaul et al.\n\nRoey, Temporal server maintainer here.\n\nWe unfortunately cannot say that we officially support Scylla because we do not have the capacity to run Scylla as part of our nightly and release validation pipelines and therefore also don't have the ability to reproduce any issues that may be Scylla related.\n\nSince Scylla has a Cassandra interface, it should theoretically be compatible as a drop in replacement for Cassandra for Temporal server. That is likely your best course for integration. The other option is to go the same route as [Yugabyte](https://github.com/manetu/temporal-yugabyte), where they have a separate persistence implementation that requires a custom server build.\n\nTemporal runs a load test on a nightly (weekdays) basis, and a longer load test on weekends.\nWe've open sourced a load generation tool called [omes](https://github.com/temporalio/omes) that can be used to get similar coverage (some of our pipelines use this tool).\nTo get decent coverage, run the [throughput_stress](https://github.com/temporalio/omes/blob/main/scenarios/throughput_stress.go) scenario with the following configuration nightly against `main`:\n\n```\n--internal-iterations 25\n--internal-iterations-timeout 2h30m\n--continue-as-new-after-iterations 5\n--nexus-endpoint $NEXUS_ENDPOINT_THAT_NEEDS_TO_BE_CONFIGURED\n--duration 2h5m0s\n```\n\nThen a weekly pipeline with duration of `24h`.\n\nNote that we run 4 Go workers to back this load (also part of `omes`).\nOn top of that we have periodic pod restarts in some of our pipelines where a random pod gets restarted every minute or so.\n\nAny persistence implementation that provides similar test coverage should be considered compatible, but it would still be Scylla supporting Temporal and not the other way around.\n\n","createdAt":"2026-01-21T00:13:52Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8652#issuecomment-3775536865","viewerDidAuthor":false}],"createdAt":"2025-11-16T16:55:29Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":8652,"reactionGroups":[{"content":"EYES","users":{"totalCount":1}}],"state":"OPEN","title":"Documenting the current state of ScyllaDB as a Cassandra-compatible Backend","updatedAt":"2026-01-21T00:13:52Z","url":"https://github.com/temporalio/temporal/issues/8652"}
