{"assignees":[],"author":{"id":"MDQ6VXNlcjQzNTMxNDU5","is_bot":false,"login":"iuliananz","name":"Iulian Stefanica"},"body":"**Is your feature request related to a problem? Please describe.**\nWe need to throttle specific activities across all worker instances to not run more than a number per second. That's to not overload downstream.\n\nTemporal task queues already can be configured to have a limit of activities run per second, so if we could register several task queues (with different limits), we could use specific queues for some activities that need throttling.\n\n**Describe the solution you'd like**\nAbility to attach several task queues to a worker. Each task queue can have it's TaskQueueActivitiesPerSecond configured independently.\n\n```\nworker.New(temporalClient, \"your-task-queue-name\", worker.Options{})\n```\n would now looks something like:\n\n```\nqueues := []Queue{{\n    \"task-queue-fast\",\n    QueueOptions {\n        TaskQueueActivitiesPerSecond: 100000,\n    }},\n    \"task-queue-slow\",\n    QueueOptions {\n        TaskQueueActivitiesPerSecond: 10,\n    }},\n}\n\nworker.New(temporalClient, queues, worker.Options{})\n```\nthen calling an activity, you can select what queue to send it to\n```\nnewOptions := workflow.ActivityOptions{\n\tTaskQueue:          \"task-queue-slow,\n}\nnewCtx := workflow.WithActivityOptions(ctx, newOptions)\nerr := workflow.ExecuteActivity(newCtx, ThrottledActivity, name).Get(ctx, &result)\n```\n\n**Describe alternatives you've considered**\nAlternatives available:\n- have copies of the same worker register to the same task queue - requires several instances of the worker\n- do the throttling using an external system - e.g. redis/db etc\n\n**Additional context**\nThis is a very common setup which all projects calling downstream API endpoints would be able to use.\n\nI am happy to give it a go at raising a PR for it if you think this is something you'd like to include.\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM6zcQPA","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"Thanks for the suggestion. For these sorts of features, the general direction we're going in is to make a single task queue more powerful and configurable instead of requiring the use of multiple task queues.\n\nIn this case I'm thinking we might eventually want a way to attach one or more tags to activities (which could just be the activity type) and then specify rate limits for those tags. That would fit pretty well into the roadmap for priority and fairness features for task queues.\n\nIn the meantime, you could implement the multiple task queue solution without explicit support, just run multiple workers in the same process, one for each task queue. That's fairly lightweight. You'd have to manage resource sharing among those workers yourself, but any feature to support listening on multiple task queues in the worker would run into most of the same issues, which is why it's better to do it all within the task queue.","createdAt":"2025-06-26T23:12:01Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/7916#issuecomment-3010528192","viewerDidAuthor":false}],"createdAt":"2025-06-13T07:07:54Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":7916,"reactionGroups":[],"state":"OPEN","title":"Allow multiple task queues to a worker - enables throttling of specific activities","updatedAt":"2025-06-26T23:12:01Z","url":"https://github.com/temporalio/temporal/issues/7916"}
