{"assignees":[],"author":{"id":"MDQ6VXNlcjM2NzEzMg==","is_bot":false,"login":"ghaskins","name":"Gregory Haskins"},"body":"We have long-running activities that need to be canceled on occasion.  When the need arises, we typically confirm that the activity has been fully canceled before proceeding to another step related to the side effects that this activity may produce, such as performing IO to an external system.  Because of this dynamic, the cancellation has real-time synchronous implications on the orchestrating workflow, visible to a human driving a UI.\r\n\r\nBecause of this real-time dynamic, we use a relatively aggressive heartbeat strategy (currently 5-second heartbeats with 20-second heartbeat timeouts).  If the Temporal system delivered the ActivityCancelled exception at the first heartbeat post request, this would probably be acceptable latency.  However, things are compounded by the internal heartbeat suppression algorithm such that we only get the notification once we hit the 80% timeout threshold, in this case, around 15-20 seconds.\r\n\r\nWe could tune the heartbeat/timeout to be more aggressive (e.g., 1/5 seconds).  However, this is a lot of overhead for something that may run months at a time and only very rarely needs to be canceled. The feature proposal is to offer some mechanism for delivering cancelation notifications to an Activity.  This could be as simple as a call like \"isCanceled()\" that is not subject to the heartbeat optimizations, to some callback being registered that is invoked by the framework.\r\n\r\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5sXEr0","author":{"login":"ghaskins"},"authorAssociation":"NONE","body":"Slack reference: https://temporalio.slack.com/archives/CTT84KXK9/p1700401249875499","createdAt":"2023-11-19T16:48:22Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/5135#issuecomment-1817987828","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5sXEr1","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":">This could be as simple as a call like \"isCanceled()\" that is not subject to the heartbeat optimizations\r\n\r\nThis suggestion sounds equivalent to lowering your heartbeat timeout, you'd still have to call this `isCanceled` API rapidly to achieve your desired low latency, and pay for the overhead that would cause.  \r\n\r\nI think, if the desire is low latency and low overhead on the worker, the server needs to somehow notify the worker that the activity is cancelled proactively without waiting for the worker to send a heartbeat request.","createdAt":"2023-11-19T17:21:47Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/5135#issuecomment-1817987829","viewerDidAuthor":false},{"id":"IC_kwDODNqesM5sXFdV","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Moving out of the Java SDK issues since this there isn't anything Java specific about this feature. Moving to the server issues since I think the primary effort would be to build some sort of push based notification from the server to the worker to notify it an activity it is working on is cancelled.","createdAt":"2023-11-19T22:00:47Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/temporal/issues/5135#issuecomment-1817990997","viewerDidAuthor":false}],"createdAt":"2023-11-19T16:45:35Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":5135,"reactionGroups":[],"state":"OPEN","title":"Support more direct/immediate notification of a cancelled activity","updatedAt":"2023-11-19T22:00:49Z","url":"https://github.com/temporalio/temporal/issues/5135"}
