{"assignees":[],"author":{"id":"MDQ6VXNlcjYwODEwNjc0","is_bot":false,"login":"phuongdnguyen","name":"D.Phuong Nguyen"},"body":"**Is your feature request related to a problem? Please describe.**\nIn our environment when there millions of workflow are running, when there are corrupted workflows due to database layer, it's hard to know which workflows are corrupted.\n\nFor the status quo of temporal, corrupted workflows are either:\n- Logged & counted in namespace-level metric ( `ConditionFailedError `, `CurrentWorkflowConditionFailedError`, `WorkflowConditionFailedError`)\n- Logged only without workflow info (for `DataLoss` error)\n\nTemporal already have a protection for this case by [trimming](https://github.com/temporalio/temporal/blob/d851d4a92e36bb9ad3be949daa59efa3562a08cf/common/persistence/execution_manager.go#L241) history branch to last valid node. However, when corruption happens on database side, trimming history node won't work (we have case where workflows are corrupted because of `ConditionFailedError`, current execution record is gone from C*)\n**Describe the solution you'd like**\nAdding a new metrics (eg: `workflow_corrupted`) with label of workflowID and runID. This is more efficient to detect problematic workflows rather than running a full db scan using something like `tdbg`.\n\nI can help to come up with a PR if you guys think it's useful.\n\n**Describe alternatives you've considered**\nParsing log, which i think need more compute power than proactively expose information in Temporal server itself.\n\n**Additional context**\nN/A\n","closedAt":null,"comments":[{"id":"IC_kwDODNqesM62UGFW","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"Looks like there's some misunderstanding re. the error type. `ConditionFailedError`, `CurrentWorkflowConditionFailedError`, `WorkflowConditionFailedError` are expected errors and don't mean workflows are corrupted. They can happen during history shard movement or trying to start an existing workflow. \n\nDataLoss errors yes, signals one corruption type that we are able to detect & well known, in this case the corruption of history event batches. Other types of corruption, for example resurrected workflows/activity/child workflow info, missing current workflow record etc. can't even be detected without introducing a lot more operations to the normal hot code path and that's not something we can afford.\nPutting it another way, if we can detect the corrupted workflows (especially on the workflow state side), we can go ahead and fix those corruptions (by replaying the history events) and not emit the corruption metric.\n\nDue to cardinality reasons, we also can't emit metric with workflowID & runID tags, they are too expensive for metric backends.\nFor now, error log is the probably the best way to figure out workflowID & runIDs.","createdAt":"2025-07-10T19:28:12Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/7637#issuecomment-3058721110","viewerDidAuthor":false},{"id":"IC_kwDODNqesM62Zmkd","author":{"login":"phuongdnguyen"},"authorAssociation":"CONTRIBUTOR","body":"Hi @yycptt , thanks for the response.\nIt's been a while and we've go ahead to add metrics in our internal fork.\nSo we found several combinations indicator of corruption:\n- `ConditionFailedError` when Temporal do a workflow execution update (the api in persistence layer)\n- DataLoss Error as you've mentioned.\nAbout `CurrentWorkflowConditionFailedError` and `WorkflowConditionFailedError`, yes we see it's a transient error that usually related to new workflow start or when a lot of workflows doing continueasnew\n\nMoving forward, do you think we need a system workflow (like the existing ones registered for internal worker) to do scanning for corruptions? Something like what `tdbg admin db scan` do but in a more controlled way\n","createdAt":"2025-07-11T03:06:25Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/7637#issuecomment-3060164893","viewerDidAuthor":false},{"id":"IC_kwDODNqesM65scHV","author":{"login":"yycptt"},"authorAssociation":"MEMBER","body":"hmm it's probably true today that for the `ExecutionManager/Store` that `ConditionFailedError` signals corruption, but we won't be able to guarantee that and may use `ConditionFailedError` in other transient cases in the future. Matching task store and queueStore are already doing that.\n\n> tdbg admin db scan\n\nI guess you mean `tctl admin db scan`? `tctl` is being deprecated and I don't think that command is available in tdbg right now.    I believe we have the cli script version first and later moved to a proper system workflow implementation (the more controlled way) for doing the scanning, so the tctl command shouldn't be used. \nSince that scanner workflow is also a workflow, I believe you can simply trigger it with normal workflow start cli command and use `temporal-system` as the namespace. I don't recall if we automatically start those scanner workflows on system worker start by default, likely no.","createdAt":"2025-07-25T00:49:24Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/7637#issuecomment-3115434453","viewerDidAuthor":false}],"createdAt":"2025-04-20T02:00:53Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":7637,"reactionGroups":[],"state":"OPEN","title":"Add a dedicated metric for corrupted workflows","updatedAt":"2025-07-25T00:49:24Z","url":"https://github.com/temporalio/temporal/issues/7637"}
