{"assignees":[{"id":"MDQ6VXNlcjE5MjM5OTU=","login":"gow","name":"Chetan Gowda","databaseId":0}],"author":{"id":"MDQ6VXNlcjk0NjkxMQ==","is_bot":false,"login":"Albert-Coding","name":"Albert"},"body":"**Is your feature request related to a problem? Please describe.**\r\nGiven an activity that calls a third-party service to perform a rate limited action, we return an application error when encountering a rate-limit response.  Sometimes, the third-party rate limit suggestion is to NOT make another call for X-period of time which is dynamic (e.g. 5s to 90s).\r\n\r\n**Describe the solution you'd like**\r\nIt would be nice if the application error could also hold a `retry interval` value so that the Temporal server would not schedule the activity retry until such time has elapse.\r\n\r\n**Describe alternatives you've considered**\r\n1- Set the activity's `RetryPolicy.InitialInterval` to the max X-period expected.  This is bad because the activity is waiting too long before retrying.\r\nor\r\n2- Use a non-retryable application error and add details to it to then in the workflow make a timer and then retry the call.  This bad for many reasons (not listed here because they are probably obvious).\r\nor\r\n3- Don't return an error.  Have the activity handle the retrying by waiting and then trying again.  This is bad because we're reinventing a feature that's a first-class citizen in Temporal.  Additionally, it will take up an active activity slot.","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5-RHJn","author":{"login":"gow"},"authorAssociation":"MEMBER","body":"PR to allow workflow tasks to specify a retry delay interval - https://github.com/temporalio/temporal/pull/5946\r\nWe still need to update the SDK to send this option before we can make this feature complete. Working on that.","createdAt":"2024-05-17T21:40:52Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"HEART","users":{"totalCount":1}}],"url":"https://github.com/temporalio/temporal/issues/5796#issuecomment-2118414951","viewerDidAuthor":false}],"createdAt":"2024-04-25T19:40:12Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":5796,"reactionGroups":[],"state":"OPEN","title":"Application Error with a Suggested Retry Interval Duration","updatedAt":"2024-05-17T21:40:52Z","url":"https://github.com/temporalio/temporal/issues/5796"}
