{"assignees":[],"author":{"id":"MDQ6VXNlcjE3MDc2MTE1","is_bot":false,"login":"GabrielAlacchi","name":"Gabriel Alacchi"},"body":"**Is your feature request related to a problem? Please describe.**\nWhen self-hosting temporal on Azure, it is generally preferred to use managed identity or service principal authentication based on Entra ID to authenticate with PGSQL to reduce the need for managing secrets.\nhttps://learn.microsoft.com/en-us/azure/postgresql/flexible-server/security-entra-concepts\n\nThe mechanism in question simply substitutes the password in the PGSQL connection with a JWT.\n\nA team in my organization is currently maintaining a set of patches that adds this support to temporal-server and temporal-sql-tool binaries. I'm wondering if there's any approach, we can take to upstream this into Temporal open-source release.\n\nThe internal patches we maintain do the following:\n1. Add azure-identity SDK and add a config flag to temporal to enable its usage to fetch a token in the Postgresql temporal plugin code.\n2. Add some error handling logic to force a re-connection whenever a query fails due to token expiry. This feels hacky to me, because temporal already seems to have a max-connection lifetime capability which can be tuned dynamically to the expiry of the token.\n\n**Describe the solution you'd like**\nBringing in our internal patches is a non-starter since it involves bringing in [azidentity](https://pkg.go.dev/github.com/Azure/azure-sdk-for-go/sdk/azidentity) SDK components into temporal's build which will not be used outside of our niche use-case.\n\nOther cloud providers also have similar token based auth schemes for PGSQL that involve managing the lifecycle of a time-bound token.\n- https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.IAMDBAuth.html\n- https://docs.cloud.google.com/sql/docs/postgres/iam-authentication#auto-vs-manual\n\nI would propose a more generic plugin-based approach can be taken here to make it possible to use any cloud provider that follows a similar JWT auth pattern. I'm open to suggestions on the specific details on how that would work. Two ideas I have:\n\n1. Use some plugin binary that can be invoked (either CLI or GO plugin https://pkg.go.dev/plugin) to get a token + expiry when creating a new connection. Cloud-specific connector plugins can likely be built separately from some separate contrib folder / separate repositories and brought in optionally by consumers in the container build.\n2. Temporal can be configured to grab token + expiry from a file; can support for this be added to dynamic config?\n\n**Describe alternatives you've considered**\n- Password auth: Not ideal for our organization's security & compliance concerns.\n- Custom fork: We are basically doing this now and can continue if strictly necessary. However, since other big 3 cloud providers support similar token-based auth schemes for PostgreSQL, we may widen the audience that is interested in this feature enough to build a mainline solution.\n\n**Additional context**\nHappy to bring some cycles to contribute PRs to make this happen if we can align on a suitable approach. Our interest in contributing is limited to the Azure use-case, but we can lay the foundation for supporting other clouds in the process.","closedAt":null,"comments":[{"id":"IC_kwDODNqesM7WfQEe","author":{"login":"GabrielAlacchi"},"authorAssociation":"NONE","body":"This might apply to MySQL as well on the big 3 clouds / other clouds.","createdAt":"2025-12-01T19:34:25Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/8724#issuecomment-3598516510","viewerDidAuthor":false}],"createdAt":"2025-12-01T19:30:35Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":8724,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":6}}],"state":"OPEN","title":"Support Azure Entra ID Authentication for PostgreSQL Backend","updatedAt":"2025-12-03T18:18:39Z","url":"https://github.com/temporalio/temporal/issues/8724"}
