{"assignees":[],"author":{"id":"MDQ6VXNlcjE0NjM2MjI=","is_bot":false,"login":"mfateev","name":"Maxim Fateev"},"body":"A lot of real life activities have multiple phases that require different timeouts. For example a human task needs to be inserted into an external system with a pretty short timeout and then be picked up by a human within another timeout. The third timeout specifies how long the activity can be worked up after it was claimed.\r\n\r\nCurrent solution to the above use case is to use an activity to insert the task into the external system. And then signal workflow about each task state change. While this workaround works it significantly complicates workflow code especially having that timeouts should be enforced in the business logic through timers.\r\n\r\nThe proposal is to model an activity execution as a list of phases with each phase having its own timeout. \r\n\r\nThere are multiple ways to achieve this. Here are two options:\r\n\r\n1) Specify list of (phase, timeout, retryPolicy) triples when scheduling an activity. Allow retrieving the current value of the triple when retrying an activity. Add an additional API to complete a phase or augment CompleteActivityTask with additional fields to use it for phase completion.\r\n\r\n2) Treat phases as an internal activity detail. In this case an activity can override heartbeat timeout as part of a heartbeat. This way it can store whatever information needed in the progress field and change heartbeat timeout to conform with the current phase requirements. For example in the case of human task the initial heartbeat timeout is going to be as small as needed to insert the task into the external system, then it is going to be extended to the maximum queue time, and so on.","closedAt":null,"comments":[{"id":"IC_kwDODNqesM5NPgzg","author":{"login":"yiminc"},"authorAssociation":"MEMBER","body":"This sounds like a pretty specific use case. Adding such fundamental concept to the core component means pretty significant change and complexity to the system.\r\n\r\nCould this be implemented as multiple activities? In your example, it would be 3 activities, with second activity be async completion type with proper timeouts. \r\n\r\nThe second option in this proposal is interesting, which is to change heartbeat timeout of a running activity. That could be a useful feature for other use cases as well. We could create new issues to request that as a new feature and close this one.\r\n","createdAt":"2022-10-29T17:34:48Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/temporal/issues/13#issuecomment-1295912160","viewerDidAuthor":false}],"createdAt":"2019-11-12T04:09:32Z","labels":[{"id":"MDU6TGFiZWwxNjIxMDMwNzg3","name":"enhancement","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwyMDE5OTA0OTIw","name":"discussion","description":"","color":"3ffcb0"},{"id":"MDU6TGFiZWwyMDE5OTIzMjY4","name":"architecture","description":"","color":"ad9fe0"},{"id":"MDU6TGFiZWwyMDE5OTIzNjU1","name":"devexp","description":"","color":"9350b7"}],"milestone":null,"number":13,"reactionGroups":[],"state":"OPEN","title":"Multi-phase activities","updatedAt":"2023-03-03T20:23:22Z","url":"https://github.com/temporalio/temporal/issues/13"}
