{"assignees":[],"author":{"id":"MDQ6VXNlcjM1MTEzNDQ2","is_bot":false,"login":"vikstrous2","name":"Viktor Stanchev"},"body":"I know that the temporal SDK uses careful control of a fake clock to execute tests correctly. I've tried synctest in go 1.24 and it seems to work for simple tests. I wonder if it would work for a full temporal workflow test. In go 1.25, this feature is becoming enabled by default. I think it's worth a try. Maybe it would simplify the implementation of the temporal go sdk? Would it change the testing API?\n\nThe documentation is at https://pkg.go.dev/testing/synctest@go1.25rc2\n\nI'm just curious how this would work and if it's really possible.","closedAt":"2025-07-14T15:27:47Z","comments":[{"id":"IC_kwDODN1w6862_MVM","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Sync test is definitely a cool feature I am personally excited for, but it is not really useful for the Temporal Go SDK, at least with its current features\n\n> I wonder if it would work for a full temporal workflow test.\n\nA workflow environment is a lot more then just skipping time, it also requires control of other things like random, task scheduling activities, child workflows etc. Actually the Temporal Go SDK doesn't even use Go's normal timers in workflow code at all so it is not relevant for a workflow. For an integrated test with workflows and activities, there is no way to have the time skipping for the `synctest` interact with time skipping in the workflow and vice versa which would be a crucial feature for the SDK use case. \n\nSo at this time `synctest ` isn't worth integrating into the SDK, though we may use it internally for some of our own tests. Depending on how the feature evolves we may certainly resist this in the future. ","createdAt":"2025-07-14T15:27:47Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/sdk-go/issues/2001#issuecomment-3070018892","viewerDidAuthor":false}],"createdAt":"2025-07-14T15:15:31Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":2001,"reactionGroups":[],"state":"CLOSED","title":"Try synctest for time control","updatedAt":"2025-07-14T15:27:47Z","url":"https://github.com/temporalio/sdk-go/issues/2001"}
