{"assignees":[],"author":{"id":"MDQ6VXNlcjU4MzkxOQ==","is_bot":false,"login":"underrun","name":"J Derek Wilson"},"body":"**Is your feature request related to a problem? Please describe.**\r\nWhen working with non-retryable errors in activites where those errors are set as non-retryable via activity options there isn't an obvious way to test to make sure the activity options have been set correctly when testing errors returned from activities. We can test errors returned from activities using `OnActivity` in test code and we can use that to make sure the workflow invoking the activity handles the error correctly, but it doesn't look like theres any way to verify that the error is also properly set as non-retryable - because the error returned from `OnActivity` is always marked as retryable.\r\n\r\nThe issue with this is that with string matching being used to detect errors and whether or not to retry them, I don't have a good way to verify that the activity options i've set in the workflow will actually result in the error i want to fall through actually not being retried.\r\n\r\n**Describe the solution you'd like**\r\nIdeally i'd like testing with `OnActivity` to fail a test if it tries to return an activity that is set as retryable from the workflow setting its activity options. I'd also like non-retryable errors returned from `OnActivity` to have them properly marked as non-retryable. \r\n\r\n**Describe alternatives you've considered**\r\nthere isn't a good alternative to know that i've set the error as non-retryable properly from temporal's perspective. I can verify that I set it to what I think the error name is or even do some reflection and verify that the string i'm passing in is the error i want to handle. but this isn't super easy and can also miss things like whether or not errors in modules need the `module.WhateverError` or just `WhateverError` or if it doesn't matter.\r\n\r\n**Additional context**\r\nNone","closedAt":null,"comments":[],"createdAt":"2023-07-26T15:05:08Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1173,"reactionGroups":[],"state":"OPEN","title":"Enable testing with OnActivity and non-retryable errors to verify options are set correctly","updatedAt":"2023-07-26T15:05:08Z","url":"https://github.com/temporalio/sdk-go/issues/1173"}
