{"assignees":[],"author":{"id":"MDQ6VXNlcjQ3MzQ4Mg==","is_bot":false,"login":"mnussbaum","name":"Michael Nussbaum"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nMy workflow's behavior is heavily time dependent, and I need to simulate how it will behave over dynamically sized time spans in the past and the future. To do so, I need the ability to configure Temporal to behave as if the current time is one dictated by a custom clock.\r\n\r\n**Describe the solution you'd like**\r\n\r\nSpecifically I’d like to make sure that `temporal_workflow.Now(ctx)` returns values set by a fake clock I control, and that `workflow.Sleep` also uses the fake clock.\r\n\r\n**Additional context**\r\n\r\nFor my full workflow, I need the ability to set the clock back to an arbitrary date, and then to have it fast-forward through workflow sleeps such that calls to get the current time return a result that look as if the sleeps took their full amount of time, but fast-forwarded so that a human can run a many-day-long process in a matter of seconds.\r\n\r\n@mfateev suggested I open an issue in response to my question on this topic at https://community.temporal.io/t/custom-time-source-with-the-go-sdk/6174.\r\n","closedAt":"2024-03-07T21:36:14Z","comments":[{"id":"IC_kwDODN1w685L7oAk","author":{"login":"mfateev"},"authorAssociation":"MEMBER","body":"Java supports this through `TestEnvironmentOptions.setInitialTime`.","createdAt":"2022-10-10T23:55:50Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1273921572","viewerDidAuthor":true},{"id":"IC_kwDODN1w685L-gT6","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"This is already present via [TestWorkflowEnvironment.SetStartTime](https://pkg.go.dev/go.temporal.io/sdk/internal#TestWorkflowEnvironment.SetStartTime).\r\n\r\n@mnussbaum - To clarify, while you can set the initial time, the test suite will automatically skip time for you until the next event. So sleeps would resolve immediately (assuming nothing outstanding is also waiting for a shorter period). To set something to happen a specific time after the workflow starts, you can use [TestWorkflowEnvironment.RegisterDelayedCallback](https://pkg.go.dev/go.temporal.io/sdk/internal#TestWorkflowEnvironment.RegisterDelayedCallback). See the Godoc on that call. You should set the start time and delayed callbacks before starting the workflow.","createdAt":"2022-10-11T13:19:52Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1274676474","viewerDidAuthor":false},{"id":"IC_kwDODN1w685L_dR0","author":{"login":"mnussbaum"},"authorAssociation":"NONE","body":"@cretz I'd like to use this functionality outside of unit tests, in my operationally deployed software. I was under the impression that `TestWorkflowEnvironment` didn't connect to  a real temporal instance, and thus wasn't suitable for this purpose, is that right? \r\n\r\nMy use case is that I have application users who want to perform \"back testing\", ie they want to test the performance of various different operational parameters of the software against historical data. The time period and parameters we'll be back testing over are driven by non-technical user input. I want to expose a user interface in front of my deployed software that lets the end user choose the time period for back testing, which the software then uses to set the Temporal clock and initiate a workflow ","createdAt":"2022-10-11T15:58:19Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1274926196","viewerDidAuthor":false},{"id":"IC_kwDODN1w685L_ka1","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> I'd like to use this functionality outside of unit tests, in my operationally deployed software.\r\n\r\n@mnussbaum - We provide no way to create a `workflow.Context` outside of a real worker or a test environment. That context contains many things to make workflows function. If you want to do an integration test against a real server, that works, but you don't get time skipping/management. I am afraid time-skipping unit tests or real-server actual time are all we offer in Go SDK.\r\n\r\n> I was under the impression that TestWorkflowEnvironment didn't connect to a real temporal instance, and thus wasn't suitable for this purpose, is that right?\r\n\r\nSuitable for which purpose? It should be suitable for all workflow testing needs.\r\n\r\n> My use case is that I have application users who want to perform \"back testing\", ie they want to test the performance of various different operational parameters of the software against historical data. The time period and parameters we'll be back testing over are driven by non-technical user input. I want to expose a user interface in front of my deployed software that lets the end user choose the time period for back testing, which the software then uses to set the Temporal clock and initiate a workflow\r\n\r\nIf this is on an already-run workflow, you could use the replayer. But that's often only for catching errors, it won't run any activities and you can't really customize it.\r\n\r\nTechnically you can use the `TestWorkflowEnvironment` to test things outside of a unit test. You will get to control time and activities and other things you would normally control in a unit test. It sounds like this may be what you need since you are wanting to control the environment, even if we do call it a \"test\" environment. You get the added benefit of time skipping, so besides setting the start time, it will automatically skip to the next event (be it a timer or whatever). If there are any issues with using the test workflow environment for your use case, let us know and we may be able to alter it.","createdAt":"2022-10-11T16:21:06Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1274955445","viewerDidAuthor":false},{"id":"IC_kwDODN1w685MAHwC","author":{"login":"mnussbaum"},"authorAssociation":"NONE","body":"> If you want to do an integration test against a real server, that works, but you don't get time skipping/management. I am afraid time-skipping unit tests or real-server actual time are all we offer in Go SDK.\r\n\r\nYeah, the workflows we're building aren't for integration testing purposes even. I need to be able to manage time in my production deployed workflows, exposed to end users and integrated with the Temporal server. I think that's the heart of this feature request, the ability to control the workflow clock when running workflows with a real Temporal server.\r\n\r\n> If this is on an already-run workflow, you could use the replayer. But that's often only for catching errors, it won't run any activities and you can't really customize it.\r\n\r\nUnfortunately these workflows won't be replays of the past, they'll be first-run with a historical perspective of time.\r\n\r\n> Technically you can use the TestWorkflowEnvironment to test things outside of a unit test.\r\n\r\nIf we use the `TestWorkflowEnvironment` like you're imagining, it wouldn't be connected to a real Temporal-server, right? So the ability to schedule activities and child-workflows on a pool of workers would not be available, and we wouldn't be able to resume a suspended workflow on a different worker then started it, right? Those would be the critical requirements for the scenarios we need to modify our clock in.\r\n","createdAt":"2022-10-11T18:22:41Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1275100162","viewerDidAuthor":false},{"id":"IC_kwDODN1w685MAOax","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> I need to be able to manage time in my production deployed workflows, exposed to end users and integrated with the Temporal server.\r\n\r\nI am afraid this is not a feature Temporal supports currently. We technically have a time-skipping Temporal server (written in Java, but we compile with Graal for use in our other SDKs as a separate time-skipping binary). However, that is also not a real Temporal server.\r\n\r\n> If we use the TestWorkflowEnvironment like you're imagining, it wouldn't be connected to a real Temporal-server, right? So the ability to schedule activities and child-workflows on a pool of workers would not be available, and we wouldn't be able to resume a suspended workflow on a different worker then started it, right? Those would be the critical requirements for the scenarios we need to modify our clock in.\r\n\r\nRight. Even our time-skipping server may lack some of the features you'd want in that time-skipping is global so it's not suitable for normal server use.\r\n\r\nIf you can identify exactly what calls you want to intercept to provide mock time, you might be able to use interceptors for this. Every call to `workflow.Now()` or `workflow.Sleep()` is interceptable via a `WorkflowOutboundInterceptor` and you could do whatever you wanted in there. But it isn't necessarily global time management because timeouts and other things wouldn't apply.\r\n\r\nIf you need to manage time on a production server, I am afraid this is not available. If you need to intercept certain calls you can. Otherwise, if at all possible, you'll need to solve this in user land (i.e. use your own deterministic mock clock and make your own clock invocations when you need time), but you won't get all of the server-specific timing features.","createdAt":"2022-10-11T18:47:23Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1275127473","viewerDidAuthor":false},{"id":"IC_kwDODN1w685MAc5B","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Out of curiosity, can you clarify your use case a bit more? What do you want to mock with this clock? Just `workflow.Now()` since that is an exact time, or durations like sleep/timer also? Does this include activities? Does this include timeouts? Can you be specific on _exactly_ what you want to use the custom time source for?","createdAt":"2022-10-11T19:41:28Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1275186753","viewerDidAuthor":false},{"id":"IC_kwDODN1w6850zcL4","author":{"login":"csuich2"},"authorAssociation":"NONE","body":"Necroing this old issue:\r\n\r\nWe've got a use case where we want a mocked/manual clock so that we can control when each step of our mock workflow executes. This would allow us to write tests that assert expectations at various points during the workflow execution as well as verify the expected scheduling behavior by manipulating the clock before and after scheduling.","createdAt":"2024-02-22T15:04:52Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1959641848","viewerDidAuthor":false},{"id":"IC_kwDODN1w6851FzRL","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Are you referring to the `testsuite`? Time automatically skips there, and you can `RegisterDelayedCallback` to do certain things at certain times. That is the only real environment where you can control time, controlling time in a non-test-environment workflow is unreasonable as many internal things such as timeouts rely on clocks you cannot substitute (e.g. server-side timings).","createdAt":"2024-02-26T15:43:30Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1964454987","viewerDidAuthor":false},{"id":"IC_kwDODN1w6852Q1gY","author":{"login":"csuich2"},"authorAssociation":"NONE","body":"Yeah, I was. Somehow in digging through the client I missed `RegisterDelayedCallback`. That does seem to do the trick - I was just expecting/hoping for a power-user mode that allowed for full control of the fake clock.","createdAt":"2024-03-07T17:56:45Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1984124952","viewerDidAuthor":false},{"id":"IC_kwDODN1w6852SboY","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":":+1: Yeah the delayed callback should be enough to do all that is necessary at certain times without having to manually progress a clock yourself.\r\n\r\n(closing issue because of the previous staleness and the acknowledged delayed callback approach, but feel free to continue discussing here or in `#sdk-go` channel on https://t.mp/slack)","createdAt":"2024-03-07T21:36:14Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/929#issuecomment-1984543256","viewerDidAuthor":false}],"createdAt":"2022-10-10T22:50:29Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":929,"reactionGroups":[],"state":"CLOSED","title":"Allow custom time source","updatedAt":"2024-03-07T21:36:52Z","url":"https://github.com/temporalio/sdk-go/issues/929"}
