{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nRight now we fix it at 10 if a user doesn't set it. A user shouldn't have to be forced to set maximum attempts in their workflow because the test suite has a hidden default. We should allow this default to be overridden.","closedAt":null,"comments":[{"id":"IC_kwDODN1w685PnNGK","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":">  A user shouldn't have to be forced to set maximum attempts in their workflow because the test suite has a hidden default.\r\n\r\nWhy shouldn't they be? If they don't set one on a workflow run on a real server it will retry infinite times. If the max number of retries matters in a workflow to a customer shouldn't they set it in the workflow? I worry adding something like this could allow bugs in users code to slip through because the testing environment is different than production.","createdAt":"2022-12-02T18:52:39Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/949#issuecomment-1335677322","viewerDidAuthor":false},{"id":"IC_kwDODN1w685PnyHf","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> Why shouldn't they be?\r\n\r\nBecause you shouldn't have to alter your workflow code for our test environment.\r\n\r\n> If the max number of retries matters in a workflow to a customer shouldn't they set it in the workflow?\r\n\r\nYes, but what if it's 15 and not 10?\r\n\r\n> I worry adding something like this could allow bugs in users code to slip through because the testing environment is different than production.\r\n\r\nI am just suggesting allowing it to be configurable from the default of 10 instead of forcing 10. I don't think it should be removed of course.","createdAt":"2022-12-02T20:46:53Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/949#issuecomment-1335828959","viewerDidAuthor":false}],"createdAt":"2022-11-07T13:42:36Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":949,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"state":"OPEN","title":"Allow user to override default maximum activity attempts in test suite","updatedAt":"2022-12-02T20:46:54Z","url":"https://github.com/temporalio/sdk-go/issues/949"}
