{"assignees":[],"author":{"id":"MDQ6VXNlcjc3NzQwNDQ=","is_bot":false,"login":"zhishi","name":""},"body":"When I use an async activity to wait for manual input, it returned a heartbeat failure after long enough time, which is not expected. I think temporal server should either auto generate heartbeat or just check the activity status if it's in activity.ErrResultPending status then never timeout heartbeat.\r\n\r\nSince async activity is not really running, we can't implement any heartbeat for it. Although I can just fully disable heartbeat check, but it's useful for other long running activity. ","closedAt":"2022-12-02T21:41:20Z","comments":[{"id":"IC_kwDODN1w6848ueWB","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> Since async activity is not really running, we can't implement any heartbeat for it\r\n\r\nFrom the Temporal server perspective it is running. Whatever external activity completion method you are using, `CompleteActivity` or `CompleteActivityByID`, there is an equivalent external activity heartbeating mechanism - `RecordActivityHeartbeat` or `RecordActivityHeartbeatByID` respectively. You'll need to continue to send heartbeats within the heartbeat timeout while the activity is considered running from the server POV.","createdAt":"2022-01-21T19:56:41Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/703#issuecomment-1018815873","viewerDidAuthor":false},{"id":"IC_kwDODN1w6848umpQ","author":{"login":"zhishi"},"authorAssociation":"NONE","body":"That sounds a solution, thanks. But usually the external input come from another service which usually don't have logic to update periodically when waiting for a user input. \r\n\r\nSince temporal server already know the activity is waiting for async completion (based on the ErrResultPending return), it's not hard to handle this case specially. I think the purpose of heartbeat is really to detect worker deadlock or hanging problem rather than this case, while async completion is designed for long time waiting should handle the heartbeat problem.","createdAt":"2022-01-21T20:50:26Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/703#issuecomment-1018849872","viewerDidAuthor":false},{"id":"IC_kwDODN1w6848upNZ","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"It is by intention that starting an activity with a heartbeat timeout must have heartbeats within that timeout occur until it is completed/failed. The purpose of the heartbeat is to ensure the activity execution hasn't gone away, potentially store state to be used by retried activities, and to check whether the activity was cancelled.\r\n\r\nYour use case sounds like it may work better with a signal response or child workflow which don't require heartbeats. Or otherwise not requiring a heartbeat when you start the activity if you cannot always provide it for the life of the activity (not recommended though).","createdAt":"2022-01-21T21:07:53Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/703#issuecomment-1018860377","viewerDidAuthor":false},{"id":"IC_kwDODN1w685Pn8Ig","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Closing as this is the intended behavior  ","createdAt":"2022-12-02T21:41:20Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/703#issuecomment-1335869984","viewerDidAuthor":false}],"createdAt":"2022-01-21T19:28:50Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":703,"reactionGroups":[],"state":"CLOSED","title":"Heartbeat timeout failure for async waiting activity","updatedAt":"2022-12-02T21:41:21Z","url":"https://github.com/temporalio/sdk-go/issues/703"}
