{"assignees":[],"author":{"id":"MDQ6VXNlcjUyMzA0","is_bot":false,"login":"bergundy","name":"Roey Berman"},"body":"In #946 we set `MaxConcurrentActivityExecutionSize` default to 3, instead we should have set the max number of eager activities requested per workflow task completion to 3.\r\n\r\nI wish we hadn't exposed `MaxConcurrentActivityExecutionSize` and `DisableEagerActivities`, next time when we add new options we should mark them experimental, but in this case I think it might be okay to remove these, risking a breaking change.\r\n\r\nIn other SDKs, we've allowed disabling eager activity execution per activity invocation via activity options and have not yet exposed a way to configure the number of eager activity requests, it's hardcoded to 3.\r\nI would like us to expose a way to configure the number of eager activity requests eventually but would rather wait until we know more about the implications of turning this on before exposing so we can document how to tune that parameter.\r\nSince eager activities are [still disabled by default server side](https://github.com/temporalio/temporal/blob/bbd386e034fd981054667e683c0afcee8426d65a/service/history/configs/config.go#L506) that should be enough for now.","closedAt":"2022-11-10T17:44:26Z","comments":[{"id":"IC_kwDODN1w685OAtr6","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> In https://github.com/temporalio/sdk-go/pull/946 we set MaxConcurrentActivityExecutionSize default to 3, instead we should have set the max number of eager activities requested per workflow task completion to 3.\r\n\r\nIt is `MaxConcurrentEagerActivityExecutionSize` and I still it is best IMO. The whole point of having this throttle was to not overload the worker or unexpected consequences of doing thousands of these things. If you made this per workflow, you're only stopping the rare case of `ExecuteActivity` called 3+ times before either is waited. That's hardly ever. In the meantime, I'd start 1000 workflows that each start an activity, and then they would all be eager. It would make the option useless.\r\n\r\nWe have `MaxConcurrent` settings for activities, local activities, sessions, pollers, tasks, and now eager activities. These are consistent and across the worker. It'd be inconsistent and almost worthless to do per workflow or per workflow task.\r\n\r\n> I wish we hadn't exposed MaxConcurrentActivityExecutionSize and DisableEagerActivities\r\n\r\nWhy not? These are perfectly valid settings and are inline with other settings this SDK uses. They both have worker-level value. I'd like to see these options in every SDK. Everyone should be able to set max concurrent and disable eager activities at the worker level. Remember however that `0` in Go is \"unset\" which means \"default\" and we don't want to default to disabled. That's why there are two settings.\r\n\r\n> next time when we add new options we should mark them experimental\r\n\r\nWe don't usually do this with new option additions, e.g. https://typescript.temporal.io/api/interfaces/common.ActivityOptions#alloweagerdispatch. Are you saying all SDKs should have marked them experimental, or are you saying Go uniquely did something wrong here?\r\n\r\n> but in this case I think it might be okay to remove these, risking a breaking change.\r\n\r\nConcur, these are unused and such a breaking change to these options is fine. Can you clarify exactly what they should change to?\r\n\r\n> I would like us to expose a way to configure the number of eager activity requests eventually but would rather wait until we know more about the implications of turning this on before exposing so we can document how to tune that parameter.\r\n\r\nI remember being asked for this explicitly when I developed this feature, but maybe I wasn't supposed to make it user overridable? It would be a deviation from the norm with all the other configuration options we create on new features like this. I think Go was the first SDK to offer a user-facing API related to eager activities so there wasn't a model to follow that I recall. Why does how we tune the default affect whether the user-overridable option exists? We can remove and hardcode if we must.\r\n\r\nI could quite easily argue that eager activity should _never_ be a per-activity option. A workflow author does not need to concern themselves with such a thing.","createdAt":"2022-11-09T14:01:35Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/950#issuecomment-1308809978","viewerDidAuthor":false},{"id":"IC_kwDODN1w685ODG69","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"After discussion, we just need to remove the \"3\" default from max concurrent eager (so leave that as unlimited) and hardcode a new setting of max 3 per workflow task.","createdAt":"2022-11-09T22:04:03Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/950#issuecomment-1309437629","viewerDidAuthor":false}],"createdAt":"2022-11-09T01:03:33Z","labels":[{"id":"MDU6TGFiZWwyMDUzODEzNTY0","name":"potential-bug","description":"","color":"90c109"}],"milestone":null,"number":950,"reactionGroups":[],"state":"CLOSED","title":"Eager activity execution should be limited to 3 per workflow task completion by default","updatedAt":"2022-11-10T17:44:26Z","url":"https://github.com/temporalio/sdk-go/issues/950"}
