{"assignees":[{"id":"MDQ6VXNlcjUxNzY4Mw==","login":"Sushisource","name":"Spencer Judge","databaseId":0}],"author":{"id":"MDQ6VXNlcjY4ODU5","is_bot":false,"login":"MrSaints","name":"Ian L."},"body":"## Expected Behavior\r\n\r\nCancelling a child workflow, and a parent workflow consecutively should not result in an irrecoverable (possibly?) workflow panic.\r\n\r\nAs for context as to why we are doing this, frankly, we discovered this by chance as we implemented our own cancellation logic which only runs under certain conditions. It is initiated through a signal, and uses `workflow.WithCancel` to perform the \"cancellation\". We signalled to the child workflow to cancel, but accidentally called `CancelWorkflow` on the parent workflow directly after, resulting in the panic described in this bug report.\r\n\r\n\r\n## Actual Behavior\r\n\r\nThe child workflow is successfully cancelled, but the parent workflow fails to be cancelled.\r\n\r\n```\r\nPanicError: invalid state transition: attempt to handleCompletionEvent, CommandType: ChildWorkflow,\r\nID: adc6a828-0e7c-4435-beba-a5f45dccbc0f_5, state=Unknown, isDone()=false, history=[Created handleCommandSent CommandSent handleInitiatedEvent Initiated handleStartedEvent Started cancel CanceledAfterStarted handleCommandSent CancellationCommandSent handleCancelInitiatedEvent handleExternalWorkflowExecutionCancelRequested Unknown]\r\n```\r\n\r\n\r\n## Steps to Reproduce the Problem\r\n\r\nI've modified the `child-workflow` sample to demonstrate the failure scenario.\r\n\r\nhttps://github.com/MrSaints/samples-go/commit/d089fdd684c4519d70bfeb6a07836efe99e3e3ba\r\n\r\nI've added a _blocking_ signal channel to mimic some relatively slow clean up behaviour that we do on our own child workflow. \r\n\r\nAssuming Temporal is running locally, in the `child-workflow` directory, run:\r\n\r\n- `go run worker/main.go`\r\n- `go run starter/main.go`\r\n\r\nThe parent workflow should now be stuck, unable to cancel properly. It can however, be terminated.\r\n\r\n\r\n## Specifications\r\n\r\n  - Version: 1.3.0\r\n  - Platform: Linux\r\n\r\n","closedAt":"2021-01-21T00:31:47Z","comments":[],"createdAt":"2021-01-20T02:34:22Z","labels":[{"id":"MDU6TGFiZWwyMDUzODEzNTY0","name":"potential-bug","description":"","color":"90c109"}],"milestone":null,"number":343,"reactionGroups":[],"state":"CLOSED","title":"Invalid state transition panic when cancelling a child workflow, and a parent workflow consecutively","updatedAt":"2021-01-21T00:31:47Z","url":"https://github.com/temporalio/sdk-go/issues/343"}
