{"assignees":[],"author":{"id":"MDQ6VXNlcjQ1OTUwNDM0","is_bot":false,"login":"sjmtan","name":"Shannon Tan"},"body":"**Is your feature request related to a problem? Please describe.**\r\nWe have a dashboard and metrics on RPC failures for monitoring our connectivity and requests to the Temporal Cloud service. Right now, our RPC failure percentage monitor triggers due to failures to DescribeWorkflowExecution, which we use to check if there's a running workflow.\r\n\r\nIt would be beneficial to include a reason code/error type for these RPC failures so that we're able to dive into them better.\r\n\r\nLogs would also be helpful (or an alternative).\r\n\r\n**Describe the solution you'd like**\r\nReason code to be included alongside relevant operations, such as DescribeWorkflowExecution\r\n\r\n**Describe alternatives you've considered**\r\nLogs, but those don't appear to be printed either.\r\n\r\nI'm also open to altering my approach to check if a workflow is running if there's a way to do so.\r\n\r\n**Additional context**\r\nI use Temporal Cloud.\r\n","closedAt":"2022-07-22T17:19:37Z","comments":[{"id":"IC_kwDODN1w685G59Sj","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> It would be beneficial to include a reason code/error type for these RPC failures so that we're able to dive into them better.\r\n\r\nCan you clarify? Are you talking about gRPC error codes? Or something like adding custom error codes for all errors that come from the server? You can of course write a gRPC interceptor to do anything with any response, increment any metrics, etc.\r\n\r\n> Logs would also be helpful (or an alternative).\r\n\r\nCan you clarify here? The error is returned to you so you can log whatever you want. Or do you mean server-side logs somehow?\r\n\r\nIt might help if you could provide a specific error you are receiving and what information is not present that we could make available.","createdAt":"2022-07-19T22:07:09Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/858#issuecomment-1189598371","viewerDidAuthor":false},{"id":"IC_kwDODN1w685G6BKx","author":{"login":"sjmtan"},"authorAssociation":"CONTRIBUTOR","body":"Thank you for following up! I definitely omitted some additional details haha.\r\n\r\n> Can you clarify? Are you talking about gRPC error codes? Or something like adding custom error codes for all errors that come from the server?\r\n\r\nWe use `temporal_request_failure` as the metric to monitor RPC calls to the server. I was thinking in the context of DescribeWorkflowExecution for example that a tag that could be added is the \"NotFound\" response. I suppose the \"real\" reason we have an alarm on this metric is for connectivity/service failures as opposed to business failures like \"NotFound\" errors.\r\n\r\n> You can of course write a gRPC interceptor to do anything with any response, increment any metrics, etc.\r\n\r\nI didn't think about this, good point :p \r\n\r\n> Can you clarify here? The error is returned to you so you can log whatever you want. Or do you mean server-side logs somehow?\r\n\r\nSDK-side logs I suppose. Right now, the SDK logs like \"Activity error\" or \"Workflow processing...\" In the case of failing RPCs, it would be good to have context to debug that. You are probably right though that the returned error should be our responsibility to log.\r\n\r\n------------------------------------------\r\n\r\nSemi-related context: Since I sit on a Platforms team just managing the overall usage of Temporal as opposed to any single use case, my goals are a bit different than other teams at my company. My goal is to make sure I know when Temporal is up/down, what may have caused that, and what my team needs to do to mitigate the issue. Therefore, I don't explicitly control whether something is logged, but I still would like to determine if the issue is just business logic vs server errors (like 404 vs 500s).","createdAt":"2022-07-19T22:30:36Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/858#issuecomment-1189614257","viewerDidAuthor":false},{"id":"IC_kwDODN1w685G821r","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I don't think we really want to add a tag on the existing metric that others are using and thereby increase their metric cardinality unexpectedly. Instead I think we should encourage users to intercept/record alternative metrics whichever way they prefer. That way for another user who may want to add a \"target host\" tag, they can, or another user may want to add a tag based on a gRPC header or context value, they can.\r\n\r\nSame with the logging client errors. We'd prefer to leave error handling to the caller and if they want to log, no problem. Many errors are not things you'd want to log. Quite often for example, people use \"describe\" to determine if a workflow exists, using `NotFound` to mean \"false\", so they wouldn't want their logs to suddenly starting showing that.\r\n\r\n> Therefore, I don't explicitly control whether something is logged, but I still would like to determine if the issue is just business logic vs server errors (like 404 vs 500s).\r\n\r\nThat may be better as a discussion with who does control client error handling/reporting instead of altering it for all Temporal users.","createdAt":"2022-07-20T14:28:14Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/858#issuecomment-1190358379","viewerDidAuthor":false},{"id":"IC_kwDODN1w685HEAw7","author":{"login":"sjmtan"},"authorAssociation":"CONTRIBUTOR","body":"> another user may want to add a tag based on a gRPC header or context value, they can.\r\n\r\nDo you know of any example I can refer to that would intercept it for a specific call and increment metrics?\r\n\r\n> people use \"describe\" to determine if a workflow exists, using `NotFound` to mean \"false\", so they wouldn't want their logs to suddenly starting showing that.\r\n\r\nThis is the exact problem — I think the problem here is that because it shows up under `temporal_request_failure`, it isn't clear what this metric should be used to represent. I could imagine one using it to determine validity of requests/connectivity to the server, but DescribeWorkflowExecution is going to always make it challenging to use that metric for that. Wouldn't this necessitate that most adopters would have to write their own interceptor for this same use case?\r\n\r\nNit: One oddity of DescribeWorkflowExecution is that it also doesn't have the workflow_type whereas other operations do.\r\n\r\nI understand and respect your point though — any examples on how to implement this interceptor would be helpful. I would love your guidance too, if possible, on what one should use `temporal_request_failure` metric for too.","createdAt":"2022-07-22T06:33:50Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/858#issuecomment-1192234043","viewerDidAuthor":false},{"id":"IC_kwDODN1w685HFMjR","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> Do you know of any example I can refer to that would intercept it for a specific call and increment metrics?\r\n\r\nThis is a general gRPC feature. See https://github.com/grpc/grpc-go. Basically you use `grpc.WithUnaryInterceptor` (or `grpc.WithChainUnaryInterceptor` if you want to be called including automatic retries) and set it on `client.Options.ConnectionOptions.DialOptions`.\r\n\r\n> it isn't clear what this metric should be used to represent\r\n\r\nThis metric is very clear/simple: Any gRPC failure. What may be unclear is what the user considers a failure or not. But that doesn't affect a low-level metric.\r\n\r\n> I could imagine one using it to determine validity of requests/connectivity to the server, but DescribeWorkflowExecution is going to always make it challenging to use that metric for that. Wouldn't this necessitate that most adopters would have to write their own interceptor for this same use case?\r\n\r\nOr they don't use the same metric handlers for clients that they are giving to workers and clients that they are expecting errors from. Or they exclude metrics with the describe `operation` tag. Or, yes, they use their metric system the same way they might with the rest of their application to record their errors that are important to them.\r\n\r\n> I would love your guidance too, if possible, on what one should use temporal_request_failure metric for too.\r\n\r\nI think many use it to see large changes in error reports and may only use it on clients given to workers instead of ones they are making client calls on. Many may not use it at all, preferring their own metrics for what they consider errors.","createdAt":"2022-07-22T12:55:18Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/858#issuecomment-1192544465","viewerDidAuthor":false},{"id":"IC_kwDODN1w685HGHCt","author":{"login":"sjmtan"},"authorAssociation":"CONTRIBUTOR","body":"Thanks!","createdAt":"2022-07-22T17:19:37Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/858#issuecomment-1192784045","viewerDidAuthor":false}],"createdAt":"2022-07-19T22:02:32Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":858,"reactionGroups":[],"state":"CLOSED","title":"Record Reason Code for RPC Failure","updatedAt":"2022-07-22T17:19:37Z","url":"https://github.com/temporalio/sdk-go/issues/858"}
