{"assignees":[],"author":{"id":"MDQ6VXNlcjE1NTcyNjY=","is_bot":false,"login":"jonmorehouse","name":"Jon Morehouse"},"body":"## Problem\n\nWe currently run into issues where our temporal workflows will panic with the \"Potential Deadlock Detected: workflow did not yield for over 1 second\" issue. This can happen for many different reasons, and does not always imply a deadlock. \n\nIn our case, we have some large JSON and other payloads that we are fetching via activities and doing things in our native workflow code with. Obviously, this can be moved into activities which we do, but the failure mode for this is extremely destructive and causes customer facing issues for us.\n\n## Solution\n\nWe would like to make the deadlock converter configurable, so that we can do two things:\n1. add a callback for \"warnings\", so we can emit a metric or other data versus just failing the workflow.\n2. make the warning and error thresholds configurable.\n\nBy making these two changes we could instrument when our workflows are not yielding and have visibility _Before_ workflows panic/fail, so we can fix issues before they become customer facing.\n\nWe are happy to make these changes, if this is is something that you would be okay with being contributed.\n","closedAt":"2025-09-08T18:21:14Z","comments":[{"id":"IC_kwDODN1w687CwMZL","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Long running actions cannot be done in workflow code, workflow tasks have a strict timeout so long running actions need to be done in either and activity or local activity you can't ignore the timeout. Long running computational, even deterministic ones need to be done in activities/local acitivities. If you need to run long running operations in your data converter you can look at `DataConverterWithoutDeadlockDetection` to disable the deadlock detector just for data converters.","createdAt":"2025-09-08T18:21:14Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/2046#issuecomment-3267413579","viewerDidAuthor":false}],"createdAt":"2025-09-08T17:58:36Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":2046,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"state":"CLOSED","title":"Make Deadlock Converter Configurable","updatedAt":"2025-09-08T18:21:14Z","url":"https://github.com/temporalio/sdk-go/issues/2046"}
