{"assignees":[],"author":{"id":"MDQ6VXNlcjI0NTEzMDU5","is_bot":false,"login":"joshmsmith","name":"Joshua Smith"},"body":"I was helping a customer writing tests for go workflows processing signals - I didn't know how to get complete test coverage to ensure the signal draining code gets covered tested. \nAsked @mfateev: he suggested creating this feature request to support simulating race conditions during signal draining.\n\n**Describe the solution you'd like**\nWould love a way for Go SDK to support simulating race conditions during signal draining. Perhaps useful for other SDKs.\n\n**Describe alternatives you've considered**\nSkipping testing this race condition is probably good enough for now.\n\n\n","closedAt":null,"comments":[{"id":"IC_kwDODN1w686kezib","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Can you elaborate what you mean by a \"race condition\" during signal draining? Also why is this only specific to the Go SDK?","createdAt":"2025-03-27T21:43:33Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/1895#issuecomment-2759538843","viewerDidAuthor":false},{"id":"IC_kwDODN1w686kmLFr","author":{"login":"joshmsmith"},"authorAssociation":"MEMBER","body":"I can share what I know, hoping Max can share more context.\nThe struggle I was having with the customer was that trying to get 100% code coverage - including the signal draining part - is hard to do because it's a tight time window that the signal drain needs to run, and hard at least for me to get signals in to trigger the draining in a test. I think the goal here is to be able to send signals to be drained in a test. I think that's why it's harder in the go SDK, in other SDKs signals work differently. Does that help?","createdAt":"2025-03-28T14:05:50Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/1895#issuecomment-2761470315","viewerDidAuthor":false},{"id":"IC_kwDODN1w686km1-Q","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":">it's a tight time window that the signal drain needs to run, and hard at least for me to get signals in to trigger the draining in a test.\n\nIn the test environment you have full control over the timing and when things advance so if you know the workflow code you should be able to cause a race. Maybe an example workflow you had difficulty testing would help illustrate the problem? I am not sure how the test environment could know when to inject a signal to cause a race since it can't read your workflow code or predicted how it will execute.\n\n\n>I think the goal here is to be able to send signals to be drained in a test. I think that's why it's harder in the go SDK, in other SDKs signals work differently. Does that help?\n\nThey are a bit different, but I don't know if that really matters here. Signals are sent by a queue in Go, but the race condition exists in all SDKs and is not easily testable in any SDK so I don't think this is Go specific problem or harder in Go then other SDKs. Might be easier in Go since the test environment in Go gives more control over execution then other SDKs do.\n\n\nOne idea is maybe the SDK can warn you if you do not check any signal channel in the last workflow task? If you are not checking a signal channel in the last workflow task you risk dropping a signal. How does that sound?","createdAt":"2025-03-28T15:08:35Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/1895#issuecomment-2761645968","viewerDidAuthor":false},{"id":"IC_kwDODN1w686qYVcx","author":{"login":"joshmsmith"},"authorAssociation":"MEMBER","body":"I think @mfateev had some other ideas, maybe he can share them here?\n\n> One idea is maybe the SDK can warn you if you do not check any signal channel in the last workflow task? If you are not checking a signal channel in the last workflow task you risk dropping a signal. How does that sound?\n\nI like that idea a lot actually.\n","createdAt":"2025-05-07T13:01:18Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/1895#issuecomment-2858506033","viewerDidAuthor":false}],"createdAt":"2025-03-27T21:30:21Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1895,"reactionGroups":[],"state":"OPEN","title":"Support simulating race conditions during signal draining","updatedAt":"2025-05-07T13:01:20Z","url":"https://github.com/temporalio/sdk-go/issues/1895"}
