{"assignees":[{"id":"MDQ6VXNlcjIwNjM5Ng==","login":"cretz","name":"Chad Retz","databaseId":0}],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nPeople need to create a client from an existing connection but just change the non-connection options\r\n\r\n**Describe the solution you'd like**\r\n\r\nOptions:\r\n\r\n* Accept something a `WorkflowService` in client options which means all connection options are ignored (this same will have to be done for operator service if/when we get there)\r\n* Accept a grpc.ClientConn in client options which means all connection options are ignored. We'd also have to expose this connection from the client somehow (really hoping not to add a new interface method)\r\n* Make a `Clone(existingClient Client, newOptions Options) (Client, error)` call","closedAt":"2022-08-10T12:58:47Z","comments":[{"id":"IC_kwDODN1w685HBTh9","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"There is a bit of a problem here. We use gRPC interceptors, which are only done at dial time, to put the namespace on the following all client methods (i.e. `temporal[_long]_request[_latency|_failure][_attempt]`). We set this as a fixed value.\r\n\r\nI could technically extract this from most operation requests, but what do I do with the calls that don't have namespace? The only client interface call this would apply to is health check, but technically there are some direct-to-gRPC calls they can make. Today they are given a `namespace` tag in the metrics. For those rare calls, I can either:\r\n\r\n1. Set the namespace tag on those calls to `\"<unknown>\"` or `\"\"` or something, but now I've just changed people's metrics\r\n2. Leave the namespace as the original client's namespace, which means a health check call from the new client will have the old client's namespace\r\n\r\nThoughts?","createdAt":"2022-07-21T14:01:51Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/861#issuecomment-1191524477","viewerDidAuthor":false}],"createdAt":"2022-07-21T12:31:30Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":861,"reactionGroups":[],"state":"CLOSED","title":"Support creating new client from existing client's connection","updatedAt":"2022-08-16T11:54:14Z","url":"https://github.com/temporalio/sdk-go/issues/861"}
