{"assignees":[],"author":{"id":"MDQ6VXNlcjYwOTIyMw==","is_bot":false,"login":"Drahflow","name":"Jens-Wolfhard Schicke-Uffmann"},"body":"## Expected Behavior\r\n\r\nWhen attempting to query a workflow (e.g. via temporal UI) and the workflow worker cannot successfully replay the workflow state due to deserialization errors of the input payload of the workflow, there should be some log message about said failure to deserialize.\r\n\r\n## Actual Behavior\r\n\r\nThe desired query type is not visible in the UI. Stacktraces (which are also served by queries) are not available without explanation.\r\n\r\nPlease see #932 for an initial analysis of the cause and some pointers where it goes wrong.","closedAt":null,"comments":[{"id":"IC_kwDODN1w685MJbPb","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> there should be some log message about said failure to deserialize.\r\n\r\nFrom your PR, it seems your logs are in general error location and obviously we don't want to add logs for all errors now (some are expected/normal). Do you have a specific suggestion of where to add logging? What about workflow and signal argument deserialization errors? (even if no specific suggestion, no worries, we will investigate where to add)","createdAt":"2022-10-13T12:34:15Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/933#issuecomment-1277539291","viewerDidAuthor":false},{"id":"IC_kwDODN1w685MJjol","author":{"login":"Drahflow"},"authorAssociation":"NONE","body":"I tried to find a good place, but couldn't. thus the half-baked PR. The problem is from the dispatcher startup perspective, these errors are indistinguishable from \"normal\" termination with workflow error. And the history replay loop (where it is known that the code has just replayed the WorkflowStart) doesn't seem to have a good way to access the workflow environment where the dispatcher will update the error.\r\n\r\nThat might be the ideal logic: If the workflow went into an error state after replaying just the StartWorkflow event -> log.\r\n(I think replay errors of later events are covered via the non-determinism check anyway.) No idea whatever about signal payload deserialization problems, we didn't have that yet :)","createdAt":"2022-10-13T13:02:13Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/933#issuecomment-1277573669","viewerDidAuthor":false}],"createdAt":"2022-10-13T12:23:01Z","labels":[{"id":"MDU6TGFiZWwyMDUzODEzNTY0","name":"potential-bug","description":"","color":"90c109"}],"milestone":null,"number":933,"reactionGroups":[],"state":"OPEN","title":"No problem indicators on failed workflow input deserialization during queries","updatedAt":"2022-10-13T13:02:13Z","url":"https://github.com/temporalio/sdk-go/issues/933"}
