{"assignees":[],"author":{"id":"MDQ6VXNlcjUyMjA1","is_bot":false,"login":"dandavison","name":"Dan Davison"},"body":"Consider the following code:\r\n\r\n```go\r\n\tworkflowFn := func(ctx workflow.Context) error {\r\n\t\tworkflow.SetUpdateHandler(ctx, \"my-update-handler\", func(arg string) error {\r\n\t\t\terr := workflow.Sleep(ctx, time.Minute)\r\n\t\t\treturn err\r\n\t\t})\r\n        ...\r\n\t}\r\n```\r\n\r\nThe relevant documentation is:\r\n\r\n> SetUpdateHandler forwards to SetUpdateHandlerWithOptions with an zero-initialized UpdateHandlerOptions struct. See SetUpdateHandlerWithOptions for more details\r\n\r\n> SetUpdateHandlerWithOptions binds an update handler function to the specified name such that update invocations specifying that name will invoke the handler. The handler function can take as input any number of parameters so long as they can be serialized/deserialized by the system. The handler can take a [workflow.Context] as its first parameter but this is not required. The update handler must return either a single error or a single serializable object along with a single error. The update handler function is invoked in the context of the workflow and thus is subject to the same restrictions as workflow code, namely, the update handler must be deterministic. As with other workflow code, update code is free to invoke and wait on the results of activities. Update handler code is free to mutate workflow state.\r\n\r\nThe code type-checks, but is incorrect, since the update handler is attempting to use the `workflow.Context` instance from the main workflow body coroutine.\r\n\r\n## Expected Behavior\r\n`SetUpdateHandler` should be documented as taking a handler function that must take a `workflow.Context` as its first parameter.\r\n\r\nIf the first argument is found not to be of the correct type at run time, the `SetUpdateHandler` call should fail with an error message explaining to the user that they should alter the signature of their handler.\r\n\r\n\r\n## Actual Behavior\r\nIt fails at run time with an error in SDK coroutine scheduler internals:\r\n```\r\nError trying to block on coroutine which is already blocked,\r\nmost likely a wrong Context is used to do blocking call (like Future.Get() or Channel.Receive()\r\n```\r\n","closedAt":"2024-05-09T14:53:50Z","comments":[],"createdAt":"2024-05-06T19:19:00Z","labels":[{"id":"MDU6TGFiZWwyMDUzODEzNTY0","name":"potential-bug","description":"","color":"90c109"}],"milestone":null,"number":1455,"reactionGroups":[],"state":"CLOSED","title":"Update handler should require `workflow.Context` as first parameter","updatedAt":"2024-05-09T14:53:50Z","url":"https://github.com/temporalio/sdk-go/issues/1455"}
