{"assignees":[],"author":{"id":"U_kgDOByySWQ","is_bot":false,"login":"satya-nected","name":""},"body":"**Is your feature request related to a problem? Please describe.**\nI have a use case where I need to load large data(more than 2-5MB) from cache proccess them in workflow to spawn multiple workflows or acitvity based on that data. I tried to load them using local activity but I am getting `BadRecordMarkerAttributes: RecordMarkerCommandAttributes.Details exceeds size limit.`\n\nIf there is option of not logging result to the history then it will worked for me. I am ok with the fact that on replay this local activity re-execute again for this usecase.\n\n**Describe the solution you'd like**\nIf there will be an option for not logging result to the history, then it will work for me.\n\n**Describe alternatives you've considered**\nA clear and concise description of any alternative solutions or features you've considered.\n\n**Additional context**\nAdd any other context or screenshots about the feature request here.\n","closedAt":"2025-04-17T05:54:07Z","comments":[{"id":"IC_kwDODN1w686ndq-J","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> I have a use case where I need to load large data(more than 2-5MB) from cache proccess them in workflow to spawn multiple workflows or acitvity based on that data. I tried to load them using local activity but I am getting BadRecordMarkerAttributes: RecordMarkerCommandAttributes.Details exceeds size limit.\n\nDo you really need all of this data _inside_ the workflow to spawn multiple children or activities based on the data? Or can you have the local activity properly extract out of this data the small subset of information you actually need to start children or activities and return that from the local activity. We don't store what you load in the local activity, we store what you return in the local activity. If you need the actual large data because it becomes child/activity input, then you're going to just run into this again when the input size exceeds this limit.\n\n> If there is option of not logging result to the history then it will worked for me. I am ok with the fact that on replay this local activity re-execute again for this usecase.\n\nIn this case, it's just unsafe code but you have to watch out for the deadlock detector for things that take 1s+. Using a local activity or a side effect is recommended here.\n\nAlso, for general questions, can join us on `#go-sdk` on [Slack](https://t.mp/slack) or [the forums](https://community.temporal.io/).","createdAt":"2025-04-16T13:20:47Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/1916#issuecomment-2809573257","viewerDidAuthor":false},{"id":"IC_kwDODN1w686nmUsJ","author":{"login":"satya-nected"},"authorAssociation":"NONE","body":"Thanks @cretz for the clearification. I will have to re-structure my data so that I will load in subset of data and do proccessing. ","createdAt":"2025-04-17T05:54:07Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/1916#issuecomment-2811841289","viewerDidAuthor":false}],"createdAt":"2025-04-16T05:47:10Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1916,"reactionGroups":[],"state":"CLOSED","title":"Can we have a option for local activity for not marking result to the history","updatedAt":"2025-04-17T05:54:09Z","url":"https://github.com/temporalio/sdk-go/issues/1916"}
