{"assignees":[],"author":{"id":"MDQ6VXNlcjE3NjIzNzAy","is_bot":false,"login":"bradleymcallister97","name":"Bradley McAllister"},"body":"**Is your feature request related to a problem? Please describe.**\r\nWhen we add a large load on our temporal workflows we started to get `Workflow panic` errors with the description:\r\n```\r\nPotential deadlock detected: workflow goroutine \"root\" didn't yield for over a second\r\n```\r\nAfter some investigation, we determined that this issue was related to the number of goroutines a service had open. In order to mitigate the issue we set the `MaxConcurrentWorkflowTaskExecutionSize` and `MaxConcurrentActivityExecutionSize` on our temporal workers. The default value for each of these values is `1k`. We had to significantly lower this value to prevent the panic from occurring.\r\n\r\n**Describe the solution you'd like**\r\nWe would like to be able to increase the `MaxConcurrentWorkflowTaskExecutionSize` and `MaxConcurrentActivityExecutionSize` values so that our service can complete activities and workflows quicker.\r\n\r\nCurrently, the default value is `1 sec`, it would be great to be able to make the deadlock timeout value configurable so that we can tweak the value on our end. We also see that there is an env var `TEMPORAL_DEBUG` which can be set to make the deadlock timeout value very large, however, this only seems like a workaround as opposed to a more permanent solution.\r\n","closedAt":"2021-05-28T04:10:35Z","comments":[{"id":"MDEyOklzc3VlQ29tbWVudDgzNjI4Mjg2MA==","author":{"login":"vitarb"},"authorAssociation":"CONTRIBUTOR","body":"There was a similar request on the java sdk side, where users want to have ability to redefine this timeout. I think we should add a worker option to allow that. For now if you need a quick relief, you may set `TEMPORAL_DEBUG` environment variable, which would disable deadlock detection feature. However, we do not recommend doing this in production as deadlock detection is a useful feature that helps finding bugs in the workflow code. Also `TEMPORAL_DEBUG` is a test specific flag that may enable/disable more feature in the future, so I would be extra careful with that.\r\nSlightly orthogonal question, why is it not sufficient for you to find the right value for MaxConcurrentX? That avoids overloading the machine, if there is a more than 1 sec processing backlog in go routines then you are probably not getting extra throughput from that added concurrency.","createdAt":"2021-05-10T07:17:04Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/435#issuecomment-836282860","viewerDidAuthor":false},{"id":"MDEyOklzc3VlQ29tbWVudDgzNzA2NTQ1Mg==","author":{"login":"mfateev"},"authorAssociation":"MEMBER","body":"> We would like to be able to increase the MaxConcurrentWorkflowTaskExecutionSize and MaxConcurrentActivityExecutionSize values so that our service can complete activities and workflows quicker.\r\n\r\nDeadlock detector fires when a goroutine cannot get scheduled for execution for one second. It means that that your process is significantly overloaded and making it even more loaded is going to increase latency of processing and not make anything complete quicker.","createdAt":"2021-05-10T18:05:25Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/435#issuecomment-837065452","viewerDidAuthor":true},{"id":"MDEyOklzc3VlQ29tbWVudDg1MDEwNzU0Mw==","author":{"login":"vitarb"},"authorAssociation":"CONTRIBUTOR","body":"Looks like question has been resolved. Note that we are considering making `1 sec` timeout configurable in the future.","createdAt":"2021-05-28T04:10:35Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/435#issuecomment-850107543","viewerDidAuthor":false}],"createdAt":"2021-05-07T15:51:41Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":435,"reactionGroups":[],"state":"CLOSED","title":"Workflow panic due to potential deadlock detected when many goroutines are running","updatedAt":"2021-05-28T04:10:52Z","url":"https://github.com/temporalio/sdk-go/issues/435"}
