{"assignees":[],"author":{"id":"MDQ6VXNlcjE1MjMxMDQ=","is_bot":false,"login":"lucperkins","name":"Luc Perkins"},"body":"I have a use case for Temporal (and am using the Go SDK) that involves providing event histories for workflows. The output for `GetWorkflowHistory` is quite nice if you want to relay Temporal's raw event data elsewhere, but it's a bit hard to work with if you want to provide a more \"massaged\" variant of that data. In my case, I'm only interested in a handful of event types and want to extract specific portions of the `Attributes` payload for each `HistoryEvent`. But since `HistoryEvent` is at the moment pretty much directly derived from the underlying Protobuf definitions, it's really tricky to wrangle into a more custom shape. It would be quite useful to me to have more \"Go-native\" constructs available.\r\n\r\nI'm certainly happy to help out with this if desired. But I wanted to check in first and see if there are already efforts underway in this domain.\r\n\r\n","closedAt":"2021-11-18T15:33:01Z","comments":[{"id":"IC_kwDODN1w6844YMNe","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"@lucperkins - Sorry for the delayed response. The raw history does let us remain compatible with the server, but it might make sense to have helpers around either the history object or the iterator to extract certain things. I am not sure it's reasonable to maintain a conversion of every history proto struct to a more idiomatic Go struct.\r\n\r\nCan you give me an example of what you're extracting and maybe we can see if we can make the logic simpler?","createdAt":"2021-10-18T15:00:41Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/560#issuecomment-945865566","viewerDidAuthor":false},{"id":"IC_kwDODN1w6845_nCb","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I am closing this issue, but please comment or reopen with details you'd like to see. Unfortunately to remain compatible with server changes, we need to keep the raw history available, but maybe we can provide helpers.","createdAt":"2021-11-18T15:33:01Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/560#issuecomment-972976283","viewerDidAuthor":false}],"createdAt":"2021-09-26T02:55:43Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":560,"reactionGroups":[],"state":"CLOSED","title":"Provide more customizable history output","updatedAt":"2021-11-18T15:33:01Z","url":"https://github.com/temporalio/sdk-go/issues/560"}
