{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"## Expected Behavior\r\n\r\nData converter `WithContext` should be called for local activity response\r\n\r\n## Actual Behavior\r\n\r\nIt wasn't in the version I just debugged. I am doing deeper investigations.","closedAt":"2022-01-19T14:23:43Z","comments":[{"id":"IC_kwDODN1w6848Z-pb","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"This has become a much more challenging issue than originally anticipated. Specifically:\r\n\r\n* On local activity completion, we record three pieces of data - the results, the error, and marker details\r\n* Today we use the context-aware converter for the results, but for the error and marker details we use the custom-but-not-context-aware converter\r\n* For the marker details, we accept that we need to use the default converter and not the custom one\r\n* But what do we do about errors? The bug surfaces because not all invocations of the converter are given the context information, and error is one of those cases.\r\n  * Even though we have the context when the error is serialized so we can use a context-aware converter, we don't have such a context when we are extracting the error back out...so we'll have to create such a header-infused context on every single replay for every local activity just so we can deserialize the error :-(\r\n","createdAt":"2022-01-14T20:12:41Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/697#issuecomment-1013443163","viewerDidAuthor":false},{"id":"IC_kwDODN1w6848aCdd","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I have just learned errors are not subject to custom data conversion.\r\n\r\nStill, we may not be able to change the fact that the marker metadata and errors use the custom data converters without breaking people. We might instead have to ask custom converter creators who rely on context-aware pieces to passthrough data when they don't have context-specific info. Still researching...","createdAt":"2022-01-14T20:39:53Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/697#issuecomment-1013458781","viewerDidAuthor":false},{"id":"IC_kwDODN1w6848lsk1","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I have confirmed we use custom converters without a context in places where we shouldn't such as local activity markers. We cannot move back to default converters due compatibility issues. I have opened #699 to make a note that context-aware data converters should not rely on being given a context.","createdAt":"2022-01-19T14:23:43Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/697#issuecomment-1016514869","viewerDidAuthor":false}],"createdAt":"2022-01-14T18:09:38Z","labels":[{"id":"MDU6TGFiZWwyMDUzODEzNTY0","name":"potential-bug","description":"","color":"90c109"}],"milestone":null,"number":697,"reactionGroups":[],"state":"CLOSED","title":"Context aware data converter not getting context on local activity response","updatedAt":"2022-01-19T14:23:43Z","url":"https://github.com/temporalio/sdk-go/issues/697"}
