{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"## Expected Behavior\r\n\r\nThese are deterministic (or at least enough so these days that they should be ignored) and should not error\r\n\r\n## Actual Behavior\r\n\r\nGetting errors like:\r\n\r\n```\r\ncalls non-deterministic function fmt.Errorf\r\n    fmt.Errorf is non-deterministic, reason: calls non-deterministic function (*fmt.pp).doPrintf\r\n      (*fmt.pp).doPrintf is non-deterministic, reason: calls non-deterministic function (*fmt.pp).printArg\r\n        (*fmt.pp).printArg is non-deterministic, reason: calls non-deterministic function (*fmt.pp).fmtComplex\r\n          (*fmt.pp).fmtComplex is non-deterministic, reason: calls non-deterministic function (*fmt.pp).badVerb\r\n            (*fmt.pp).badVerb is non-deterministic, reason: calls non-deterministic function (*fmt.pp).printValue\r\n              (*fmt.pp).printValue is non-deterministic, reason: calls non-deterministic function (reflect.Value).Bool\r\n                (reflect.Value).Bool is non-deterministic, reason: calls non-deterministic function (reflect.Value).panicNotBool\r\n                  (reflect.Value).panicNotBool is non-deterministic, reason: calls non-deterministic function (reflect.flag).mustBe\r\n                    (reflect.flag).mustBe is non-deterministic, reason: calls non-deterministic function reflect.valueMethodName\r\n                      reflect.valueMethodName is non-deterministic, reason: calls non-deterministic function (*runtime.Frames).Next\r\n                        (*runtime.Frames).Next is non-deterministic, reason: calls non-deterministic function runtime.expandCgoFrames\r\n                          runtime.expandCgoFrames is non-deterministic, reason: calls non-deterministic function runtime.gostring\r\n                            runtime.gostring is non-deterministic, reason: calls non-deterministic function runtime.rawstring\r\n                              runtime.rawstring is non-deterministic, reason: calls non-deterministic function runtime.mallocgc\r\n                                runtime.mallocgc is non-deterministic, reason: calls non-deterministic function runtime.gcStart\r\n                                  runtime.gcStart is non-deterministic, reason: calls non-deterministic function runtime.gcBgMarkStartWorkers\r\n                                    runtime.gcBgMarkStartWorkers is non-deterministic, reason: starts goroutine\r\n              (*fmt.pp).printValue is non-deterministic, reason: calls non-deterministic function internal/fmtsort.Sort\r\n                internal/fmtsort.Sort is non-deterministic, reason: calls non-deterministic function (reflect.Value).MapRange\r\n                  (reflect.Value).MapRange is non-deterministic, reason: calls non-deterministic function (reflect.flag).panicNotMap\r\n                    (reflect.flag).panicNotMap is non-deterministic, reason: calls non-deterministic function (reflect.flag).mustBe\r\n                      (reflect.flag).mustBe is non-deterministic, reason: calls non-deterministic function reflect.valueMethodName\r\n```\r\n\r\nBasically many things that cross into reflection we say are non-deterministic. We should explicitly mark these deterministic. We should also consider marking some reflection things non-deterministic at the level of the function instead of having them give this big long stack.","closedAt":"2023-02-14T16:46:44Z","comments":[{"id":"IC_kwDODN1w685VIalb","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"This appears to happen more in recent version of golang 1.19 and 1.20 and is blocking updating the golang version on some pipelines.","createdAt":"2023-02-13T16:44:12Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/980#issuecomment-1428269403","viewerDidAuthor":false}],"createdAt":"2022-12-09T16:55:49Z","labels":[{"id":"MDU6TGFiZWwyMDUzODEzNTY0","name":"potential-bug","description":"","color":"90c109"}],"milestone":null,"number":980,"reactionGroups":[],"state":"CLOSED","title":"workflowcheck should allow fmt.Errorf and fmt.Sprintf and others","updatedAt":"2023-02-14T16:46:44Z","url":"https://github.com/temporalio/sdk-go/issues/980"}
