{"assignees":[],"author":{"id":"MDQ6VXNlcjQ3MTI0MzA=","is_bot":false,"login":"danielhochman","name":"Daniel Hochman"},"body":"**Is your feature request related to a problem? Please describe.**\r\nThe ability to lazy connect to the server was removed in v1.14.0 with the addition of the getCapabilities call on client creation.\r\n\r\nIdeally the SDK would still offer the option to connect lazily. Fail fast in a critical application with multiple concerns (i.e. Temporal access plus at least one other concern) is a non-starter. It can block and bring an entire service down during a deploy, scale up, or other lifecycle event even if only a small portion of the service is not operational.\r\n\r\n**Describe the solution you'd like**\r\nEach call on the client can check whether or not the connection has been created, and use a mutex to lock and create it before allowing any calls to proceed.\r\n\r\n**Describe alternatives you've considered**\r\nOne option would be to duplicate the entire interface in our application to wrap every call with the solution described above. From a maintenance perspective it's not great. Would prefer to have this option in the upstream client.\r\n\r\nA client factory can help, but the factory has side-effects in that case. This is an anti-pattern, so additional warnings are then needed to prevent a developer from calling the factory somewhere it could block (e.g. in the instantiation of a module during dependency injection or similar). To better mitigate the problem an application can implement a factory that creates the config and then an additional `GetConnection()` call off of the returned struct. This signals to the developer that the call will connect to the server and should not be used during application start.\r\n\r\n**Additional context**\r\nSee this thread for more discussion: https://temporalio.slack.com/archives/CTRCR8RBP/p1645050691089599","closedAt":"2022-05-06T14:58:35Z","comments":[{"id":"IC_kwDODN1w685B-XyD","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"After some discussion internally and across languages, it looks like we may end up moving to this model.","createdAt":"2022-04-22T21:13:27Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/753#issuecomment-1106869379","viewerDidAuthor":false}],"createdAt":"2022-03-14T17:28:12Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":753,"reactionGroups":[],"state":"CLOSED","title":"Allow lazy connection on client","updatedAt":"2022-05-06T14:58:35Z","url":"https://github.com/temporalio/sdk-go/issues/753"}
