{"assignees":[],"author":{"id":"MDQ6VXNlcjU1NTIzODE=","is_bot":false,"login":"mastermanu","name":""},"body":"When creating a gRPC context for a call, we take the existing context deadline, calculate the remaining time, divide by two, and then either round up the RPC timeout to a minimum (currently 1 second) or round it down to a maximum (currently 10 seconds).\r\n\r\nThe problem here is that with a 10 second timeout, if the gRPC connection is uncleanly severed with a request is in flight, then it will take the full 10 seconds before the call is failed and then retried. For long polls requests, this is even worse with a 70 second time out. As a result, SDK users can see spikes in overall latencies if they Temporal Cluster they are connecting to is undergoing an upgrade or recycling.\r\n\r\nWe should do a few things to enable the user to minimize the exposure here depending on their scenario. Options include (but are not limited to):\r\n\r\n1) reduce the maximum gRPC timeout from 10 seconds to something smaller (of course, this could impact scenarios where the customer is sending/receiving large payloads on a low-bandwidth connection).\r\n2) Enable the user to specify what the maximum gRPC request timeout should be so that they can make the decision for themselves.\r\n3) Have more intelligently calculated timeouts or consider decoupling timeout from the context timeout on the request.","closedAt":null,"comments":[{"id":"MDEyOklzc3VlQ29tbWVudDg0OTM0NTE0Mg==","author":{"login":"vitarb"},"authorAssociation":"CONTRIBUTOR","body":"Do we know what is our p99.9 for the cloud service calls (excluding long poll)? Maybe we should adjust the default and set it to a multiple of that as an upper limit for all non long-poll calls? But then as you've mentioned we may start timing out calls with larger payloads. \r\nI'm not a big fan of being too smart with timeouts and trying to calculate them on the fly based on payload sizes or things alike as it may result in unexpected behavior that can be difficult to debug.\r\nOn one hand I think making maxRPCTimeout configurable could solve the problem of large payloads, allowing us to have lower the default, but on the other if users are going to hit the limit often enough they would start overriding it back to higher values, which would bring us back to the square one.\r\nFor long polls I don't think we can do much better besides keepalive check as we want those timeouts to be as long as they are.\r\nBetter question, I think, is why would we abruptly drop connections during maintenance on the server? Isn't it possible to do a graceful shutdown of a node instead? Then we would avoid this problem in a first place.","createdAt":"2021-05-27T05:54:41Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/444#issuecomment-849345142","viewerDidAuthor":false},{"id":"MDEyOklzc3VlQ29tbWVudDg1MDAwODc5OQ==","author":{"login":"mastermanu"},"authorAssociation":"MEMBER","body":"agree that we should try our best to make sure node shutdowns are graceful. but that can never truly be guaranteed. also agree that smart logic for timeouts is ugly. Will get back to you on P99 latency, but at least letting maxRPCTimeout be configurable (w/o changing current default) might be an okay option for now?","createdAt":"2021-05-27T23:34:53Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/444#issuecomment-850008799","viewerDidAuthor":false},{"id":"IC_kwDODN1w686mGUUi","author":{"login":"antmendoza"},"authorAssociation":"MEMBER","body":">  letting maxRPCTimeout be configurable (w/o changing current default) might be an okay option for now?\n\n+1 \n\nSome customers would like to set the RPC timeout > 10 seconds (specifically for StartWorkflowExecution), and [the current implementation doesn't allow it](https://github.com/temporalio/sdk-go/blob/729bc240a1004e1a897c4144bed5489e61a6b768/internal/internal_utils.go#L132-L138). \n\nI think this should be configurable in the Go SDK, as it is in other SDKs like Java and TypeScript \n\nRelated issue: https://github.com/temporalio/sdk-go/issues/1104 \n\n\n\n","createdAt":"2025-04-08T14:37:13Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/444#issuecomment-2786673954","viewerDidAuthor":false},{"id":"IC_kwDODN1w686mROeS","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"@antmendoza - Not that we disagree, but can you share the use case for having a call that should complete in milliseconds have its timeout over 10s?","createdAt":"2025-04-09T12:26:13Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/444#issuecomment-2789533586","viewerDidAuthor":false}],"createdAt":"2021-05-14T19:44:53Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzA3NDky","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":444,"reactionGroups":[],"state":"OPEN","title":"maxRPCTimeout value is too long","updatedAt":"2025-04-09T12:26:14Z","url":"https://github.com/temporalio/sdk-go/issues/444"}
