{"assignees":[],"author":{"id":"MDQ6VXNlcjIyODg0OTMz","is_bot":false,"login":"davidlbudiman","name":"David Latief Budiman"},"body":"Hi, there!\n\nI want to understand further on how to understand the Worker slots gauge. I tried to search the documentation but I couldn't make sense of it. \n\nHere's more context:\n* Metrics Dashboard: DataDog\n* MaxConcurrentWorkflowTaskExecutionSize: 7500\n* MaxConcurrentLocalActivityExecutionSize: 7500\n* IsLocalActivityWorkerOnly: True\n* MaxConcurrentWorkflowTaskPollers: 2\n* Workflow avg latency: 50ms\n* Workflow max latency: 5min.\n* Expected incoming workflow per second: 1k and expected to increase on further development.\n* Duration of incoming workflow per second: Possibly 6 hours, there might be need to make the duration goes faster, which means incoming workflow per second will be higher based on the business requirements.\n\nI wanted to increase the # of Workflows that can be taken per second. But, I don't understand the gauge. Because it kept showing at max it takes 7 for the WorkflowTask Workers. What does this 7 mean? Is it that the worker takes 7 workflows at that second, or is it that it creates 700% concurrent workflow tasks? How do I know the number of running workflows per seconds? The reason I'm focusing on MaxConcurrent*ExecutionSize, I find that increasing them seems to increase the concurrency of the workflows. But, am I right? How do I make sure of this?","closedAt":"2025-12-12T02:33:43Z","comments":[{"id":"IC_kwDODN1w687ZPNiQ","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Worker slots is the number of concurrently running workflow tasks at that point in time. Increasing it would increase the number of concurrent workflow tasks. The max value it can be is `MaxConcurrentWorkflowTaskExecutionSize`. We have a whole docs page that cover Worker performance and improving a workers performance I would recommend reviewing at your connivence https://docs.temporal.io/develop/worker-performance.\n\nClosing this issue since we do not use github for support.\n\nIn the future please use our slack for any support or questions https://t.mp/slack","createdAt":"2025-12-12T02:33:43Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-go/issues/2136#issuecomment-3644643472","viewerDidAuthor":false}],"createdAt":"2025-12-03T13:51:54Z","labels":[],"milestone":null,"number":2136,"reactionGroups":[],"state":"CLOSED","title":"Understanding the Worker Slots Gauge","updatedAt":"2025-12-12T02:36:15Z","url":"https://github.com/temporalio/sdk-go/issues/2136"}
