{"assignees":[],"author":{"id":"MDQ6VXNlcjExOTQyMg==","is_bot":false,"login":"tsurdilo","name":"Tihomir Surdilovic"},"body":"tag workflow_failed counter metric with the application failure type that caused workflow to fail\r\n\r\nthis would allow users to filter this metric and omit failure types for which their business logic is expecting to fail the exec, allowing them to still be able to alert on workflow failed counts for unexpected failures","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs6UZc3j","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I am not sure we can blindly do this by default. Many people send metrics off to third parties that charge per label/cardinality IIUC and to potentially increase this significantly for a user on SDK upgrade may not be the best thing. We may be able to make it an opt-in option. Also not every failure is an application failure, so would need to know what to set the label to on those.\r\n\r\nWhat we usually tell users that want more than what our metrics offer by default is to make their own metrics. Granted on some SDKs this may not properly catch all types (such as non-determinism in core-based SDKs when configured to make it a failure instead of task failure), but in general an interceptor should work for this case. The benefit of this approach is when a user wants the next label for workflow failure based on something, and then the next, and so on, this can easily be done without altering SDKs.","createdAt":"2024-11-20T22:55:54Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2489699811","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6UiR6B","author":{"login":"tsurdilo"},"authorAssociation":"MEMBER","body":"not sure i fully understand as temporal_activity_execution_failed does include \"exception\" field that includes the exception type thrown on activity failure (in java sdk at least). \r\nnot sure why we could not do the same thing for workflow failures?","createdAt":"2024-11-21T18:50:01Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2492014209","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6UkL3I","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I think that is only in Java and it's not documented at https://docs.temporal.io/references/sdk-metrics#activity_execution_failed. It's not that we can't add this, it's that we need to be cautious about adding by default and increasing label counts and cardinality on users that simple do an SDK upgrade. In the meantime, users can, for the most part, emit their own metrics with whatever error information they want (including the type). Also there's a difference between \"error/exception data type\" and \"application failure error type\" that would have to be discussed too.","createdAt":"2024-11-21T22:48:21Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2492513736","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6UkT7M","author":{"login":"tsurdilo"},"authorAssociation":"MEMBER","body":"got it. ok its just that this use case comes up a lot. basically users cannot fail their executions as part of their business logic, because later on they can no longer alert on unexpected workflow failures. but then that skews their completion metrics too. and workarounds of custom metrics and/or custom search attributes are not really good workarounds at all (at least havent been in past when we suggested to users) ","createdAt":"2024-11-21T23:16:33Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2492546764","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6Ukuga","author":{"login":"Sushisource"},"authorAssociation":"MEMBER","body":"> users cannot fail their executions as part of their business logic, because later on they can no longer alert on unexpected workflow failures\r\n\r\nThat says it all right there, then. Workflow failures are generally something that is supposed to be _because_ of unexpected reasons. If they're failing them _intentionally_ because of business reasons, well, then that really shouldn't be a failure, but a different return value from the workflow.","createdAt":"2024-11-22T00:57:53Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2492655642","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6Ukx3Z","author":{"login":"longquanzheng"},"authorAssociation":"NONE","body":"I actually really wanted to add some tags to the metrics emitted by SDK\r\n(and optional). It saved a lot of time if we had this\r\n\r\n\r\nThanks,\r\nQuanzheng\r\n\r\n\r\nOn Thu, Nov 21, 2024 at 4:58 PM Spencer Judge ***@***.***>\r\nwrote:\r\n\r\n> users cannot fail their executions as part of their business logic,\r\n> because later on they can no longer alert on unexpected workflow failures\r\n>\r\n> That says it all right there, then. Workflow failures are generally\r\n> something that is supposed to be *because* of unexpected reasons. If\r\n> they're failing them *intentionally* because of business reasons, well,\r\n> then that really shouldn't be a failure, but a different return value from\r\n> the workflow.\r\n>\r\n> —\r\n> Reply to this email directly, view it on GitHub\r\n> <https://github.com/temporalio/features/issues/563#issuecomment-2492655642>,\r\n> or unsubscribe\r\n> <https://github.com/notifications/unsubscribe-auth/ABCQPM32KICCKFPK4H4G4TL2BZ6SPAVCNFSM6AAAAABSFUEOBGVHI2DSMVQWIX3LMV43OSLTON2WKQ3PNVWWK3TUHMZDIOJSGY2TKNRUGI>\r\n> .\r\n> You are receiving this because you are subscribed to this thread.Message\r\n> ID: ***@***.***>\r\n>\r\n","createdAt":"2024-11-22T01:11:20Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2492669401","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6Upotu","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> add some tags\r\n\r\nNote this is about a _single_, predefined tag on a single metric that we probably cannot even enable by default, not general purpose addition of tags to SDK metrics. Many metrics are emitted throughout the SDK and even with the metrics abstraction, context is not provided at metrics record time. If possible, any custom metrics needs may need to be done with custom metrics. Granted there are parts of the internal code we don't have user callbacks/interceptors within.","createdAt":"2024-11-22T14:53:55Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2493942638","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6Ut6-E","author":{"login":"tsurdilo"},"authorAssociation":"MEMBER","body":"> That says it all right there, then. Workflow failures are generally something that is supposed to be because of unexpected reasons. If they're failing them intentionally because of business reasons, well, then that really shouldn't be a failure, but a different return value from the workflow.\r\n\r\nas much as id like to agree with this..well i do, but often its more difficult than that.\r\n\r\nits currently not possible to filter executions (visibility api nor metrics) for completed workflows by their result value. this then forces users to use custom search attributes and upsert to some business \"failure\" value, which on cloud costs an action too. then they no longer can alert on this via metrics either, and have to resort to visibility api, so all in all, to me this is more of a philosophical question, but was told many times by users that they actually want to fail execution in case of business failures. idk whats best but as things are currently, having exception type in workflow failed metric would be useful imho.  \r\n\r\nthe custom metrics approach seems ok but we have sdks that iirc dont allow custom tags as of yet, so still a bit hard to do overall","createdAt":"2024-11-22T23:07:22Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2495065988","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6Uvc4C","author":{"login":"gandhisamay"},"authorAssociation":"NONE","body":"> > users cannot fail their executions as part of their business logic, because later on they can no longer alert on unexpected workflow failures\r\n> \r\n> That says it all right there, then. Workflow failures are generally something that is supposed to be _because_ of unexpected reasons. If they're failing them _intentionally_ because of business reasons, well, then that really shouldn't be a failure, but a different return value from the workflow.\r\n\r\n@Sushisource @tsurdilo if there are scenarios where retrying doesn't make any sense, simply because the activity responded with a bad request, in that case what is the ideal way to stop the workflow execution? Currently what we do is, we set the property `non_retryable=true`  and throw an application failure. Is there any better way of tackling these, so that we can generate correct metrics for that as well? ","createdAt":"2024-11-23T12:43:30Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2495467010","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6Uvr2_","author":{"login":"drewhoskins-temporal"},"authorAssociation":"MEMBER","body":"Would it help to be able to specify an exception's severity (info, warn, error, critical or the like), tag it in metrics, and then filter that tag out?  That would address the metrics cardinality issue.","createdAt":"2024-11-23T16:18:43Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2495528383","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6U5kAS","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> the custom metrics approach seems ok but we have sdks that iirc dont allow custom tags as of yet, so still a bit hard to do overall\r\n\r\nIs this only TypeScript at https://github.com/temporalio/sdk-typescript/issues/1229? We need to solve this, I will look into prioritizing. There are a lot of customizations people want to do to metrics.\r\n\r\n> tag it in metrics, and then filter that tag out?\r\n\r\nWe have no real concept of filtering tags out today (but of course users can do whatever they want in the abstractions/collectors). The concern is automatically adding new tags by default on those with an expectation of their tag list not surprisingly growing. We can do anything opt-in of course. Yes it can seem unfortunate that we can't add tags at will by default on SDK and server-side metrics. We can add metrics though, and we can allow opt in, and we do allow custom metrics. Or we can decide as a team if adding tags by default on SDK upgrade is worth the cost.","createdAt":"2024-11-25T14:07:24Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2498117650","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6V7qLx","author":{"login":"tsurdilo"},"authorAssociation":"MEMBER","body":"> Would it help to be able to specify an exception's severity (info, warn, error, critical or the like), tag it in metrics, and then filter that tag out? That would address the metrics cardinality issue.\r\n\r\ni think this could work but not sure how it would be set in scenario where user does not handle activity failure which then fails the workflow execution. guess would need to be set in activity (failure type), which then i think goes back to original ask of this feature which is to add the failure type to failed_counter metric. maybe im missing something, let me know","createdAt":"2024-12-03T20:05:19Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/563#issuecomment-2515444465","viewerDidAuthor":false}],"createdAt":"2024-11-20T22:36:24Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":563,"reactionGroups":[],"state":"OPEN","title":"Tag workflow_failed counter metric with exception type","updatedAt":"2024-12-03T20:05:22Z","url":"https://github.com/temporalio/features/issues/563"}
