{"assignees":[],"author":{"id":"MDQ6VXNlcjUyMzA0","is_bot":false,"login":"bergundy","name":"Roey Berman"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nUsers often start workflows from an activity or local activity for various reasons instead of using child workflows.\r\nThe major downside to this approach is that they lose the relationship between the \"parent\" and \"child workflows.\r\n\r\n### Describe the solution you'd like\r\n\r\nWith Nexus, we added a way to add links to history events. The approach is not specific to Nexus though and can be leveraged to link workflows started from an activity using a Temporal client.\r\n\r\nIt's debatable whether links should automatically be established when using a client from an activity or this should be opt-in.\r\n\r\n### Additional context\r\n\r\nWe may want to wait until we implement #203 in SDKs to provide a wrapped client that will automatically link.\r\nNote that links are not exclusively meant for starting workflows, signals and updates can also be linked.\r\nLinks are bidirectional, which means the local activity marker event or ActivityTaskCompleted events should include a link back from any Temporal primitives initiated by the activity. We will need to change the `RespondActivityTaskCompleted` (and `RespondActivityTaskCompletedById` APIs to accept links.\r\n\r\nThere should also be a server / SDK side config to limit the number of links tracked by a single activity.\r\n\r\n### Per-SDK Tickets\r\n\r\n- [ ] Go - \r\n- [ ] Java - \r\n- [ ] Core - \r\n- [ ] TypeScript - \r\n- [ ] Python - \r\n- [ ] .NET - \r\n- [ ] Ruby\r\n- [ ] PHP - \r\n- [ ] Temporal CLI - \r\n","closedAt":null,"comments":[],"createdAt":"2024-09-10T16:42:00Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":534,"reactionGroups":[],"state":"OPEN","title":"Bidirectional linking of workflows through activity","updatedAt":"2024-09-10T21:19:27Z","url":"https://github.com/temporalio/features/issues/534"}
