{"assignees":[],"author":{"id":"MDQ6VXNlcjMzOTcxMzQ=","is_bot":false,"login":"nikhil-pandey","name":"Nikhil Pandey"},"body":"### Is your feature request related to a problem? Please describe.\n\nSome information stored in a payload is more sensitive than the rest of the payload, to the point that it would be ideal to separately secure that information.\n\n### Describe the solution you'd like\n\nThe sensitive information would not be visible in the temporal UI.\n\n### Original Request from user for a specific piece of information\n\nWhile using HostedMCPTool inside a Temporal workflow we noticed that the tool config (including HTTP headers) is serialized into the activity input/history, so secrets end up in worker logs and the Temporal UI. Is there—or could there be—a way for the plugin to avoid persisting these headers (e.g., a hook to resolve headers only when the activity executes, or built-in redaction)?","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs7LWSAP","author":{"login":"tconley1428"},"authorAssociation":"MEMBER","body":"> e.g., a hook to resolve headers only when the activity executes\n\nDoing something like that would require that the tool, or at least the associated data be defined statically during construction of the worker since the data would need to be available inside the activity and wouldn't be able to be provided by the workflow. \n\n> or built-in redaction\n\nIf I take your meaning with redacted correctly, we don't have a mechanism for specifying secrets inside inputs. We do however, have a mechanism for treating _all_ payloads as secrets. You can use a payload codec to encrypt all traffic through the temporal server. See https://docs.temporal.io/develop/python/converters-and-encryption. This is a very common practice that we see often for users with private data moving between worker and server.","createdAt":"2025-10-15T04:03:43Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/685#issuecomment-3411615759","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs7LWSAm","author":{"login":"nikhil-pandey"},"authorAssociation":"NONE","body":"Yeah, I'm already using a codec, but the issue is that the tokens still show up in plain text when someone browses the Temporal UI — which isn't ideal from a security perspective. What would be really helpful is an option to omit or lazily resolve sensitive headers, so they don’t get serialized into the activity input at all.","createdAt":"2025-10-15T22:40:23Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/685#issuecomment-3411615782","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs7LWSA5","author":{"login":"tconley1428"},"authorAssociation":"MEMBER","body":"We'll triage that request, but it would be a pretty large feature across more than the Python SDK and potentially require server and UI components, so it would be unlikely to have a short term resolution.","createdAt":"2025-10-16T16:03:35Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/685#issuecomment-3411615801","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs7LWTXk","author":{"login":"tconley1428"},"authorAssociation":"MEMBER","body":"@nikhil-pandey I've moved the issue to the general cross component Features repo and attempted to generalize the issue statement from the specifics of Python and the Agents SDK integration. Let me know if you think I mischaracterized your need.","createdAt":"2025-10-16T16:07:54Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/685#issuecomment-3411621348","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs7LWYyJ","author":{"login":"tconley1428"},"authorAssociation":"MEMBER","body":"Received some new information from other folks on the team actually. Since you have a codec and see the payloads in the UI, I'm assuming you are also running a codec server. Your response from the codec server for these payloads can omit these portions of the payload so that they will not appear in the UI.","createdAt":"2025-10-16T16:14:05Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/685#issuecomment-3411643529","viewerDidAuthor":false}],"createdAt":"2025-10-15T01:25:25Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":685,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Omit HostedMCPTool headers from serialized activity input?","updatedAt":"2025-10-16T16:14:05Z","url":"https://github.com/temporalio/features/issues/685"}
