{"assignees":[],"author":{"id":"MDQ6VXNlcjI1MTI4OA==","is_bot":false,"login":"lorensr","name":"Loren ☺️"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\n<!-- A clear and concise description of what the problem is. Ex. I'm always frustrated when [...] -->\r\n\r\nCurrently, have to run tctl or a client sdk script to start and update Schedules. Is suboptimal for maintainability (compared to eg terraform/declarative infra).\r\n\r\n\r\n### Describe the solution you'd like\r\n\r\n<!-- A clear and concise description of what you want to happen. SCREENSHOTS OR CODE SAMPLES ARE VERY HELPFUL -->\r\n\r\nDeclare what schedule a workflow should be run at, in code or markup file, and automatically upsert it.\r\n\r\nFrom @dnr:\r\n\r\nAs a user, the main \"higher level\" thing I want in a schedule api is declarative schedules: I shouldn't have to use an imperative api to work with something that should just \"be there\". I want to annotate a workflow with a schedule and have it \"take effect\" when I deploy the worker.\r\n\r\nThis needs some design work and maybe we should do it in a meeting, but a few things to consider to start:\r\n\r\n- The schedule that starts a workflow could be specified as an annotation on that one, or a separate object, or both options.\r\n- The schedule id could be implicit or explicit.\r\n- Deploying a worker with a changed schedule should be able to change the calendar spec and other stuff, but it should not reset the paused state. We'll have to think field by field what makes sense.\r\n- Having two versions of workers deployed at once should not flip the schedule back and forth, the newer one should take priority.\r\n\r\n## Discussion items\r\n\r\n<!-- Add any other context or screenshots about the feature request here. -->\r\n\r\n### Code location\r\n\r\nDepending on the lang, could be in the same file as workflow. Could be next to that file, like `myWorkflow.ts` and `myWorkflow.schedule.ts`.\r\n\r\n### How it gets run\r\n\r\n- On Worker startup:\r\n  - Pro: easier to set up, better initial DX\r\n  - Con: issues w/ coupling to worker startup\r\n- By running a script in prod CI \r\n  - tctl reading config files (wait this is temporal! we don't use those here)\r\n  - terraform\r\n  - script provided by SDK, or sample script with helpers provided by SDK\r\n\r\nProvided script could be `update-schedules ./workflows/*.schedule.ts`, and those files could include something like:\r\n\r\n```ts\r\nimport { myWorkflow } from './myWorkflow'\r\n\r\nexport function upsertSchedule() {\r\n  return ({ \r\n    id: 'myWorkflow-schedule', \r\n    spec,   \r\n    action: {\r\n      workflowId: 'myWorkflow-schedule-workflow',\r\n      type: myWorkflow,\r\n      args: ['arg1', 'arg2'],\r\n    }, \r\n  })\r\n}\r\n```","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs5IluNd","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I don't understand this exactly. If they are using code, why can't they make the client call to update the schedule? Also, I don't think the SDK team needs to be maintaining binaries and scripts and such.\r\n\r\n> I shouldn't have to use an imperative api to work with something that should just \"be there\". I want to annotate a workflow with a schedule and have it \"take effect\" when I deploy the worker.\r\n\r\nJust like you have to use an \"imperative api\" to have a workflow just \"be there\", same for a schedule. There is no such thing as \"annotate a workflow\" and we shouldn't pretend there is nor should we make a new concept for this. If you want something to \"take effect\", call the effecting call. There's not really any benefit to adding extra create-if-not-already-created layer. Anyone can ignore already-exists when they make the call.","createdAt":"2022-08-17T10:48:38Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1217848157","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5InkUe","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"We're talking about deploying a worker. A worker generally isn't using a client to make imperative calls, it's just registering workflows and activities and then listening on a task queue. It _could_ make imperative calls at startup, and my proposal is essentially an easier-to-use wrapper around that, with some common pitfalls handled automatically.\r\n\r\nLots of languages have ways to annotate code, and there's no reason we shouldn't use those to make it easy to do some common patterns. Ignoring schedules, if I write an entity workflow and want there to be a single global instance of that workflow running at all times, I _would_ like to be able to just declare that and have it happen without an explicit \"start\" step.\r\n\r\nIn general, entity workflows and schedules are stateful bits of infrastructure. People these days prefer to manage stateful infrastructure with declarative approaches, e.g. terraform, k8s manifests, etc. We should provide ways to do that.","createdAt":"2022-08-17T18:00:07Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":3}}],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1218331934","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5InlOy","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"If you supported declarative namespaces, search attributes, etc it'd make more sense. Otherwise schedules doesn't deserve special create-if-not-created treatment IMO. Whether other people prefer declarative is unrelated to whether schedules get some special treatment over the rest of our patterns.","createdAt":"2022-08-17T18:03:37Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1218335666","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5InpyU","author":{"login":"lorensr"},"authorAssociation":"CONTRIBUTOR","body":"I'm fine with non-uniformity of this pattern. Also, instead of deserve special treatment, you could think of it as: this is the direction we want to go in, and Schedules is the first step.","createdAt":"2022-08-17T18:25:10Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1218354324","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5Inp5A","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"We should totally have a declarative way to manage namespaces, search attributes, etc. If you want to treat this as lower priority than those, that's fine; I'm not suggesting any special treatment. The difference is that those are operator-level things, so on a separate level from user workflow code in some sense. And work differently in cloud vs self-hosted, so there's some complication there. I suspect the demand for declarative entity workflows and schedules to be higher than declarative namespaces.","createdAt":"2022-08-17T18:25:38Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1218354752","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5Inu-_","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":":+1: In Java we actually are creating a declarative approach for workers using Spring Boot as an added feature. It would make plenty of sense to have a `@WorkflowSchedule(\"0 0 * * *\")` above a workflow for that use because it's normal to use Spring to declare this. As for all of our SDKs, it'd be a bit of a tougher sell to lazily initialize things on startup instead of requiring the user make explicit calls to start/do anything as we do today.","createdAt":"2022-08-17T18:50:27Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1218375615","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5JrldA","author":{"login":"lorensr"},"authorAssociation":"CONTRIBUTOR","body":"Example case in which declarative would be helpful: user starts cron on startup, and winds up with multiple concurrent crons unnecessarily doing the same thing\n\n![image](https://user-images.githubusercontent.com/251288/188280296-7517cada-c701-4311-976a-0c326b0e49b6.jpeg)","createdAt":"2022-09-03T16:45:06Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1236162368","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5JzEvp","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"The final update from the user gets it. Start-if-not-started is a general Temporal concern and is unrelated to schedules or cron. If we want to tackle that in a general way, no problem.","createdAt":"2022-09-06T13:06:23Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1238125545","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5J6-Je","author":{"login":"lorensr"},"authorAssociation":"CONTRIBUTOR","body":"I see it as related to declarative—I meant that if we support declaration of something, the user doesn't have to worry about X-if-not-already-Xed, as that's taken care of for them.","createdAt":"2022-09-08T04:14:26Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1240195678","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5K5iib","author":{"login":"nediamond"},"authorAssociation":"NONE","body":"it would be cool if there was a generic schedule file format (yaml/json?) where each file could be loaded & treated as its own sort of \"schedule namespace\"(?) and therefore could safely delete any existing schedule configurations in that file & then the mechanism could safely clear all schedule entries within its \"schedule namespace\" and re-apply the file. and file would functionally be a list of sets of options available to [tctl schedule create](https://docs.temporal.io/tctl/schedule/create)","createdAt":"2022-09-23T19:30:01Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":2}}],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1256597659","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5ZewZr","author":{"login":"lorensr"},"authorAssociation":"CONTRIBUTOR","body":"I came up with a `createOrUpdateSchedule` function when I [migrated](https://github.com/temporalio/github-repo-notion-sync/commit/71d075810b73ed148c3a588792efb84031a8e8a2) from a GitHub Action cron:\r\n\r\nhttps://github.com/temporalio/github-repo-notion-sync/blob/01e4bfb51e6863a05fa763cd419581904c6f80b4/.github/workflows/cron.yaml#L3-L5\r\n\r\nto Schedules:\r\n\r\nhttps://github.com/temporalio/github-repo-notion-sync/blob/71d075810b73ed148c3a588792efb84031a8e8a2/createOrUpdateSchedule.ts\r\n\r\ncalled on Worker startup here:\r\n\r\nhttps://github.com/temporalio/github-repo-notion-sync/blob/71d075810b73ed148c3a588792efb84031a8e8a2/main.ts#L16","createdAt":"2023-04-09T23:17:15Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"HOORAY","users":{"totalCount":1}}],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1501234795","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5hdBhb","author":{"login":"mbernier"},"authorAssociation":"NONE","body":"I am now tracking this, as well. ","createdAt":"2023-07-13T22:30:16Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1634998363","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5nteFI","author":{"login":"wyattanderson"},"authorAssociation":"NONE","body":"This would be a nice capability to have off-the-shelf or in a community-supported tool (that maybe I should write and open-source, I guess). An analogue that I can think of is a Kubernetes cron schedule: the schedule configuration is maintained declaratively by Kubernetes and I can change it without rebuilding or redeploying the underlying binary, because as @dnr says, \"a worker generally isn't using a client to make imperative calls, it's just registering workflows and activities and then listening on a task queue\".\r\n\r\nIf I were to start building something like this today for our needs, I'd probably build a small binary that read in a `CreateScheduleRequest` in textproto or JSON format from files in the repo, called `CreateSchedule`/`UpdateSchedule` as necessary, and integrate that binary into our CI pipeline as necessary. If I were feeling ambitious, I'd also consider writing a Terraform provider to do something similar (and I'd love it if such a Terraform provider already existed and let us manage things like namespaces and search attributes).\r\n\r\n> * Having two versions of workers deployed at once should not flip the schedule back and forth, the newer one should take priority.\r\n\r\nThis is something that concerns me with an approach that involves the worker making the scheduling calls. It seems fine if you're running a singleton instance of the worker, but I can think of a number of edge cases that make me nervous when running multiple workers. For instance, if you're doing a rolling deploy of a worker pool, what happens if a worker configured with the previous version of the schedule restarts during the deploy and clobbers the newer version of the schedule?","createdAt":"2023-09-28T20:39:58Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1739972936","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5oYU0S","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"To clarify the request here, users want to be able to ~create and update schedules in a declarative language (e.g. YAML)~ ensure a schedule with a certain set of settings exists and need to be able to do so from UI, CLI, and SDK.","createdAt":"2023-10-06T18:09:08Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1751207186","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5oYXaI","author":{"login":"nediamond"},"authorAssociation":"NONE","body":"@cretz i think there is also value in being able to represent and manage group of schedules st you could remove a schedule entry from a file and that will represent \"deleting\" the schedule as it will be unapplied next time the group is loaded from that file. currently we are upserting schedules on worker start from hard coded list using existing sdks, but this will require manual deletion when we want to remove one of these","createdAt":"2023-10-06T18:18:41Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1751217800","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5oYpAZ","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"Yeah, it's not just about YAML. I also want to be able to create a config value in code (e.g. from the results of a db query) and make a call to say \"ensure that this schedule exists with this config\". And then also, \"ensure that no other schedules exist (with this search attribute value, say, to provide some namespacing)\".","createdAt":"2023-10-06T19:10:56Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":2}}],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1751289881","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5oYp09","author":{"login":"dnr"},"authorAssociation":"MEMBER","body":"> For instance, if you're doing a rolling deploy of a worker pool, what happens if a worker configured with the previous version of the schedule restarts during the deploy and clobbers the newer version of the schedule?\r\n\r\nI think this can be solved with a version number. If you change it, increment the version. If an older worker restarts, its version will be less than the latest, so its request would be ignored.\r\n\r\nI would want the feature to be usable from workers with no extra infrastructure for simple cases, though for more involved use cases doing it outside the worker makes more sense.","createdAt":"2023-10-06T19:14:15Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1751293245","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5uwqXO","author":{"login":"mfateev"},"authorAssociation":"MEMBER","body":"I would add the ability to watch a file folder (git repository folder, S3 bucket, etc) that contains files with schedule definitions as a feature that should be built on top of the features discussed in this issue.","createdAt":"2023-12-15T17:43:37Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/features/issues/118#issuecomment-1858250190","viewerDidAuthor":true},{"id":"IC_kwDOGflYbs6IXLO3","author":{"login":"johncburns1"},"authorAssociation":"NONE","body":"Hey all, checking in on this.  I am using Temporal schedules and would love to manage them declaratively with the tcloud terraform provider.  My coworker at Nordstrom and I would like to contribute this feature if you all would be open to it.  If so, here is a very high level proposal for adding schedule support to the tcloud terraform provider.\r\n\r\n# Terraform Design Document for Temporal Schedules\r\n\r\n## Overview\r\n\r\nThis design document describes the implementation of additional Temporal Schedule resources within the existing Temporal Cloud Terraform provider that wraps the Temporal API. The goal is to extend the current provider to allow users to manage Temporal schedules (e.g., create, update, delete, trigger) through Terraform configuration files. This solution aims to provide a declarative method of managing Temporal schedules.\r\n\r\n## Design Flow\r\n\r\nThe extended Temporal schedule functionality of the provider will follow a standard CRUD (Create, Read, Update, Delete) approach for managing Temporal schedules.\r\n\r\n## Components\r\n\r\n### 1. Provider\r\n\r\nThe Temporal Cloud Terraform provider will be extended to include additional resources for managing Temporal schedules.  This provider will continue to handle configuration tasks, such as setting up the connection to the Temporal service (e.g., address, authentication), but will now also support new resources specific to Temporal schedules.\r\n\r\n```mermaid\r\ngraph TD\r\n    A[Temporal Provider] --> B[Temporal Client]\r\n    B --> C[Schedule Resource]\r\n    B --> D[Backfill Resource]\r\n    B --> E[Trigger Resource]\r\n```\r\n\r\n### 2. Resources\r\n\r\n#### 2.1 Schedule Resource `(temporalcloud_schedule)`\r\n\r\nRepresents the lifecycle of a Temporal schedule, including creation, update, and deletion.\r\n\r\n- Attributes:\r\n  - schedule_id: The unique identifier for the schedule.\r\n  - workflow_id: The ID of the workflow to be triggered.\r\n  - task_queue: The task queue for the workflow.\r\n  - workflow_type: The type of workflow.\r\n  - interval, calendar, cron: Scheduling parameters.\r\n  - overlap_policy: Policy to handle overlapping workflows.\r\n  - start_time, end_time: Schedule timing.\r\n  - time_zone: Time zone for the schedule.\r\n  - toggle:\r\n    - pause: Boolean to pause or unpause the schedule.\r\n    - reason: The reason for the action.\r\n- Actions:\r\n  - Create --> `POST /api/v1/namespaces/{namespace}/schedules/{scheduleId}`\r\n  - Update --> `POST /api/v1/namespaces/{namespace}/schedules/{scheduleId}/update`\r\n  - Delete --> `DELETE /api/v1/namespaces/{namespace}/schedules/{scheduleId}`\r\n  - Toggle --> `POST /api/v1/namespaces/{namespace}/schedules/{scheduleId}/patch`\r\n\r\n#### 2.2 Backfill Resource `(temporalcloud_schedule_backfill)`\r\n\r\nHandles the backfilling of missed or delayed schedule actions. Any change to backfill will trigger a backfill action.\r\n\r\n- Attributes:\r\n  - schedule_id: The unique identifier for the schedule.\r\n  - start_time, end_time: Time range for the backfill.\r\n  - overlap_policy: Policy for handling overlap during backfill.\r\n- Actions:\r\n  - Create --> `POST /api/v1/namespaces/{namespace}/schedules/{scheduleId}/patch`\r\n  - Update --> `POST /api/v1/namespaces/{namespace}/schedules/{scheduleId}/patch`\r\n  - Delete\r\n\r\n#### 2.3 Trigger Resource `(temporalcloud_schedule_trigger)`\r\n\r\nAllows immediate triggering of a schedule action.\r\n\r\n- Attributes:\r\n  - schedule_id: The unique identifier for the schedule.\r\n  - overlap_policy: Override the overlap policy during the trigger.\r\n  - nonce: Any change to this value will trigger one immediate action.\r\n- Actions:\r\n  - Create --> `POST /api/v1/namespaces/{namespace}/schedules/{scheduleId}/patch`\r\n  - Update --> `POST /api/v1/namespaces/{namespace}/schedules/{scheduleId}/patch`\r\n  - Delete\r\n\r\n","createdAt":"2024-08-14T03:38:08Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/features/issues/118#issuecomment-2287776695","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6Ia6j3","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Thanks! We are looking into how we can support declarative schedules better (for Terraform and others) and are looking into approaches for a Terraform provider for namespace-specific workflow service items (including schedules). The Terraform cloud provider has not traditionally worked with this API before so there are some hurdles that may have to be overcome. I will see if I can get the Temporal team working on the Terraform provider to reach out. This may be a bit of a different ask than general purpose declarative schedules.","createdAt":"2024-08-14T13:31:13Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-2288756983","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6IchtM","author":{"login":"johncburns1"},"authorAssociation":"NONE","body":"That would be great! \r\n\r\nWould love to hear more about these hurdles and any ideas you all are working on.  If not here, you can reach out to me on the Temporal Slack (Jack Burns).","createdAt":"2024-08-14T15:55:06Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-2289179468","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs6l8bZZ","author":{"login":"mrodriguez-openly"},"authorAssociation":"NONE","body":"Checking in on this, is this still being discussed or worked on? This issue has come up in our org as well and an official terraform provider would be great.","createdAt":"2025-04-07T17:30:32Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/118#issuecomment-2784081497","viewerDidAuthor":false}],"createdAt":"2022-08-17T04:39:05Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":118,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":8}}],"state":"OPEN","title":"[Feature Request] Declarative schedules: upsert, sync, terraform, etc.","updatedAt":"2025-04-07T17:30:33Z","url":"https://github.com/temporalio/features/issues/118"}
