{"assignees":[],"author":{"id":"MDQ6VXNlcjUyMzA0","is_bot":false,"login":"bergundy","name":"Roey Berman"},"body":"Currently the only way for an activity to get notified that a timeout has expired (such as start-to-close) is by heartbeating.\r\nThe SDK throttles heartbeats and does not notify (`*`) the activity implementation that it should stop running since the server will reject the completion after timeout has expired.\r\nWhile for sensitive workloads, there's no way around making activity implementations reentrant, adding the worker side timeout notification lowers the chance of duplicate activity executions.\r\n\r\nA couple things worth noting:\r\n- In the future the server might want to accept the activity after start-to-close timeout has expired assuming that it hasn't issued a new activity task to avoid needlessly losing the progress made by the activity (TODO: verify this is not supported today).\r\n- We plan on adding an operator API to modify activity attributes such as timeouts, to support this properly, we would have to propagate the activity configuration to the worker running the activity\r\n\r\n### Open questions\r\n- Which timeouts would we want to notify the activity about?\r\n  - start-to-close?\r\n  - schedule-to-close?\r\n  - heartbeat\r\n\r\n(`*`) Apart from Go which sets a deadline on the context\r\n\r\n### SDK specific implementation\r\n- Go could cancel the context (it already does this today)\r\n- Java would throw from heartbeat method\r\n- Core based SDKs will propagate this via the per SDK cancellation mechanism","closedAt":"2023-11-03T16:17:20Z","comments":[{"id":"IC_kwDOGflYbs5qNRFz","author":{"login":"Sushisource"},"authorAssociation":"MEMBER","body":"After a little discussion:\r\n\r\nRe:\r\n>API to modify activity attributes such as timeouts\r\n\r\nAs long as this modification only applies to the *next attempt* that's fine, that information can already be delivered via activity tasks. Something that changes the *current attempt*'s timeout would be an obnoxious new path which should be able to be sufficed by the normal existing cancel mechanisms (since the SDK would need to have a working connection to server already to receive the new timeouts).\r\n\r\n* We should respect all 3 of the listed timeouts\r\n* SDK does not reply to server w/ timeout (since by definition it should have already timed out server side and all we'd get is a \"not found\")","createdAt":"2023-10-26T20:38:43Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/170#issuecomment-1781862771","viewerDidAuthor":false}],"createdAt":"2022-11-23T20:00:46Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":170,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Worker enforcement of activity timeouts","updatedAt":"2023-11-03T16:17:20Z","url":"https://github.com/temporalio/features/issues/170"}
