{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nTypeScript and Java both support setting activity options at the workflow level for all activities of a type. Java even supports setting default activity options for all activities. Go and Python support neither of these.\r\n\r\nOutstanding questions:\r\n\r\n* Should we support workflow-activity-type-level options in Python or is it expressive enough that they can pass options around?\r\n* Should we support workflow-activity-type-level options in Go, or is there concern about how it would merge given zero-types of some values?\r\n* Should we support workflow-level default activity options for TypeScript, Python, and Go?\r\n\r\nThis intentionally doesn't discuss contextual activity options like only Go has or invocation time options like only Python has","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs5PfwRs","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"> TypeScript and Java both support setting activity options at the workflow level for all activities of a type. Java even supports setting default activity options for all activities. Go and Python support neither of these.\r\n\r\nIn Python you can bake `partial` functions, that gives you the same semantics as the proxy and stub methods in TS and Java. I'd say the Python approach is superior and I would have liked to use the same in TS if we didn't have the restriction where we can't import the activity function into the sandbox.\r\n\r\n> Should we support workflow-level default activity options for TypeScript, Python, and Go?\r\n\r\nTypeScript supported this in the pre-alpha stage, we removed this a long time ago. I definitely see some value in it since activity options are an implementation detail and shouldn't be the caller's concern.\r\nI would prefer a more generalized solution where workflow and activity options can be defined on the implementation side. I think that's what most users want.","createdAt":"2022-12-01T12:56:03Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/174#issuecomment-1333724268","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5Pf1iy","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"This request was initially made by @mfateev in a more narrowly scoped way - Should we provide something like https://www.javadoc.io/static/io.temporal/temporal-sdk/1.17.0/io/temporal/worker/WorkflowImplementationOptions.Builder.html#setActivityOptions(java.util.Map) in Go? I just expanded the scope of the discussion to make sure I captured it. I have no problem leaving each language to its own approach here.\r\n\r\nAs concepts of Go get potentially redesigned, I think it's clear that invoking an activity or child workflow should accept options for that activity or child workflow at the call site not in context. But that isn't changing anytime soon. And of course support for definition-site options aren't happening anytime soon.","createdAt":"2022-12-01T13:10:20Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/174#issuecomment-1333745842","viewerDidAuthor":false}],"createdAt":"2022-11-30T17:20:51Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":174,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Consider higher-level activity options for some languages","updatedAt":"2024-07-13T01:07:30Z","url":"https://github.com/temporalio/features/issues/174"}
