{"assignees":[],"author":{"id":"MDQ6VXNlcjM2NzEzMg==","is_bot":false,"login":"ghaskins","name":"Gregory Haskins"},"body":"Some use cases involve creating an Activity meant to run indefinitely until canceled.    However, the Java SDK doesn't offer a first-class way to disable the StartToClose/ScheduleToClose timeouts.\r\n\r\nThere are options such as [ChronoUnit/FOREVER](https://docs.oracle.com/javase/8/docs/api/java/time/temporal/ChronoUnit.html), but using them is somewhat awkward and throws an ArithmeticException.\r\n\r\nThe feature request is to provide a first-class way to disable the timeout as an option.  This could be supplied as a convenient Duration \"MAX\" type that is Temporal compatible or some option that allows *Close options to remain unspecified.\r\n","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs5tM2zK","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"The Java SDK does not offer a way to disable timeouts because the Temporal server does not have a way to disable timeouts.  I am not a fan of adding any convenient `MAX` durations types since I wouldn't want to encourage any users to run an activity indefinitely unless they knew what they were doing. If we did add such a flag the Server we should also enforce a heartbeat timeout is set at the very least.\r\n\r\nThe `ArithmeticException` is probably coming from how the Java SDK converts the java `Duration` to a `protobuf.Duration` using `toMillis` instead of passing the seconds and nanoseconds directly, that should probably be fixed.\r\n\r\nEdit: opened an issue for the `ArithmeticException` https://github.com/temporalio/sdk-java/issues/1938 and once that is resolved you could use the `FOREVER` with the SDK. If we want to truly disable the timeout that would require server support. ","createdAt":"2023-11-19T22:12:31Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1832086730","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5tM3GV","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Moving out of the Java SDK since this is not Java specific other then the `ArithmeticException` that I moved to a separate issue","createdAt":"2023-11-29T15:12:58Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1832087957","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5tNT3X","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":":+1: This is a general-purpose Temporal request to disable timeouts for activities (even if just doing it by setting a very large timeout). Temporal has intentionally chosen to require some timeout here and we encourage users to set maximums they are ok with. We do not want to encourage disabling (or \"effectively disabling\").\r\n\r\nWe can confer with other team members, but I am inclined to close this as something we intentionally are not wanting to add to any SDK.","createdAt":"2023-11-29T16:06:27Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1832205783","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5uD6TV","author":{"login":"ghaskins"},"authorAssociation":"NONE","body":"Should I interpret this as \"run until cancelled\" activities are an invalid use case for temporal?","createdAt":"2023-12-08T04:08:53Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1846518997","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5uHbgn","author":{"login":"ghaskins"},"authorAssociation":"NONE","body":"Here are the relevant threads with @mfateev in support of the feature request: \r\n\r\nhttps://temporalio.slack.com/archives/CTT84KXK9/p1700410957355959\r\nhttps://temporalio.slack.com/archives/CTRCR8RBP/p1698425786531759\r\nhttps://temporalio.slack.com/archives/CTRCR8RBP/p1698426188348989\r\n\r\n> Should I interpret this as \"run until cancelled\" activities are an invalid use case for temporal?\r\n\r\nI should rephrase this.  Temporal is really good at this use case, other than a bit of awkwardness around expressing it.  It's not clear to me why you would object @cretz.  I am not suggesting that this should be the default.  I agree that the defaults should be conservative and promote safety.  On the other hand, if the notion is truly intractable, I should redesign my code, so I would like to know.\r\n\r\n","createdAt":"2023-12-08T15:58:28Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1847441447","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5uHhLw","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> It's not clear to me why you would object @cretz\r\n\r\nWe have an API that requires an explicit duration and always has and the SDKs require an explicit duration and always have. It's not the best idea to just change the SDK to accept some form of infinite to implicitly assume that means max duration. The UI/CLI will be thoroughly confusing when printing these timeouts. Also in many languages there is not an \"infinite duration\" that is indistinguishable from unset. That Java chose to model \"forever\" as max duration doesn't mean every other language will (for instance in .NET, `Timeout.InfiniteTimeSpan` is `-1`).\r\n\r\nSo, now that we know Java's fake version of infinite is not cross-language compatible and we know that we have to show these timeouts as infinite in UI/CLI, the only approach would be to make these timeouts optional from a Temporal API POV. I think optional timeouts is not ideal and is backwards incompatible with all existing consumers of the API that expect one of the two durations to always be present (and backwards incompatible for newer SDKs using older servers). You can just put an effectively unreachable max here (we are fixing that Java-specific overflow issue separately but it'd be poor form to assume this Java overflow exception is a problem for Temporal as a whole).","createdAt":"2023-12-08T16:14:59Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1847464688","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5uHn8V","author":{"login":"ghaskins"},"authorAssociation":"NONE","body":"Ok.  To be clear, I wasn't suggesting that it had to be expressed as a variation of infinite or an outright disable.  I would be fine with either.  I am also not suggesting that we should do anything that violates backward compatibility or principles of least surprise.  All I am suggesting is that I felt that I found a fairly good application of Temporal as a solution to my problem, but that required a somewhat awkward path to get there.  So, I am wondering if there is an opportunity to improve the product to support such use cases as first-class.  At the very least, I would like to understand if what I am doing is just a bad fit for Temporal and I should do it another way.  Thanks for the consideration.","createdAt":"2023-12-08T16:33:22Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1847492373","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5uI9cv","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"It's not necessarily bad for Temporal in any way I can think of.\r\n\r\nMay be worth thinking of it as any other API that requires a duration/timeout. From a Java POV it's like asking to disable timeout for `Thread.sleep` or `ExecutorService.awaitTermination` or something. They know that the timeout can effectively be disabled with a large number, but a no-timeout overload or explicit support for infinite is not present by intention.","createdAt":"2023-12-08T21:05:44Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1847842607","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5wQxn0","author":{"login":"husam-e"},"authorAssociation":"NONE","body":"Per https://github.com/temporalio/features/issues/397, would it be possible to relax the requirement to accept a `HeartbeatTimeout` in lieu of `StartToClose` and `ScheduleToClose`?","createdAt":"2024-01-09T17:05:50Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/377#issuecomment-1883445748","viewerDidAuthor":false}],"createdAt":"2023-11-19T17:31:26Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":377,"reactionGroups":[],"state":"OPEN","title":"Support an option to disable \"Close\" timeouts for indefinitely running Activities","updatedAt":"2024-01-09T17:05:51Z","url":"https://github.com/temporalio/features/issues/377"}
