{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"### Describe the problem\r\n\r\nToday in core-based SDKs, we set workflow completion immediately upon workflow return and discard anything else that may happen on the same task. In Go/Java, we let the coroutines all complete even if they make commands and then set workflow completion _after_ that. We should do the same in core-based SDKs.\r\n\r\nIn order to do this in a backwards-compatible way, we will need to leverage SDK flags. And in order to not have to put this flag on every workflow henceforth, SDKs will need to determine whether there are post-completion commands after the workflow returns.\r\n\r\n### An approach (EDIT: this is what was decided) (EDIT2: we decided not to go with this):\r\n\r\nSDKs can choose one of the two options:\r\n\r\nOption 1:\r\n\r\n* Change SDKs to, upon workflow function return, store the result and note the commands currently in buffer\r\n* Upon workflow completion and all coroutines settled:\r\n  * If replaying and SDK flag not set, add the workflow completion command and discard any that came after\r\n  * If not replaying and there are other commands before workflow completion, set the SDK flag and set those commands before setting workflow completion\r\n\r\nOption 2:\r\n\r\n* When workflow complete command is in activation completion command set, do one of these three:\r\n  * If SDK flag not set and replaying, do same thing as today (don't set flag, allow commands after completion to be removed)\r\n  * If there are no non-query-complete commands after completion, do same thing (don't set flag)\r\n  * Set the SDK flag and move the completion to the end (i.e. before any trailing query completions)\r\n\r\n### Another approach (EDIT: this was decided against) (EDIT 2: we decided to do this)\r\n\r\n* Send all post-complete commands to core instead of truncating like we do today\r\n* Let core decide to move workflow completion to the end + set flag or truncate post-completion commands if replaying and flag wasn't set\r\n### Describe the solution you'd like\r\n\r\n### Decision\r\n\r\nWe're going with the first approach above. And core doesn't need to do anything, it already allows flags.\r\n\r\n### Per-SDK Tickets\r\n\r\n- [x] Go - N/A\r\n- [x] Java - N/A\r\n- [ ] Core - https://github.com/temporalio/sdk-core/issues/778\r\n- [ ] TypeScript - https://github.com/temporalio/sdk-typescript/issues/1421\r\n- [ ] Python - https://github.com/temporalio/sdk-python/issues/528\r\n- [x] .NET - https://github.com/temporalio/sdk-dotnet/issues/249\r\n- [ ] .NET II - https://github.com/temporalio/sdk-dotnet/issues/305\r\n- [x] PHP - N/A\r\n- [x] Temporal CLI - N/A","closedAt":null,"comments":[],"createdAt":"2024-05-17T18:15:16Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":481,"reactionGroups":[],"state":"OPEN","title":"Do not set workflow completion until after all coroutines have settled in the task","updatedAt":"2024-07-13T12:39:43Z","url":"https://github.com/temporalio/features/issues/481"}
