{"assignees":[],"author":{"id":"MDQ6VXNlcjUxNzY4Mw==","is_bot":false,"login":"Sushisource","name":"Spencer Judge"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nRight now, there is no way when inspecting workflow history to tell if the workflow is actually waiting on something to be resolved (ex: receive a signal) or is completely stuck and will never be able to make progress.\r\n\r\nBeyond that, it is immediately obvious how useful it would be to know things like \"Oh, I am WFT heartbeating because I'm waiting on a local activity\". Or \"This workflow is currently waiting on two signals\", etc etc.\r\n\r\n### Describe the solution you'd like\r\n\r\nWe should add a new field to workflow task completions which allows us to record this information. Possibly, it makes good sense to just have a generic map field, so that we can record anything SDKs feel like without needing to go back and add a new field each time. However, it does make good sense to make the value we record be a proto so that it can be viewed in the UI.\r\n\r\nWe should record:\r\n\r\n* Number of executing local activities\r\n* Counts of how many of each thing that can be awaited are actively being awaited (signals, activities, timers, children, etc)\r\n\r\n\r\nThis will allow us to understand why a workflow completed a task with no commands. If it's not waiting on anything, then by definition the workflow is now stuck. Detecting this situation and alerting the user would be incredibly useful.","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs5F3xRJ","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Concur. My specific proto suggestion would be adding needed fields on `temporal.api.workflowservice.v1.RespondWorkflowTaskCompletedRequest` and adding a new proto `temporal.api.workflow.v1.CompletedWorkflowTaskInfo` (similar to its sibling `PendingWorkflowTaskInfo`) that is present on a new `last_completed_workflow_task` field of `temporal.api.workflowservice.v1.DescribeWorkflowExecutionResponse`. We wouldn't want this in history for obvious reasons.","createdAt":"2022-07-01T11:30:36Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/65#issuecomment-1172247625","viewerDidAuthor":false}],"createdAt":"2022-06-30T23:19:44Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":65,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Attach info about unresolved commands to WFT completions","updatedAt":"2024-07-13T01:08:19Z","url":"https://github.com/temporalio/features/issues/65"}
