{"assignees":[],"author":{"id":"MDQ6VXNlcjUyMzA0","is_bot":false,"login":"bergundy","name":"Roey Berman"},"body":"Our generated Go API uses [this patch](https://github.com/temporalio/gogo-protobuf/commit/b38fb010909b8f81e2e600dc6f04925fc71d6a5e) which causes tooling like the web UI and CLI to generate invalid JSON protos when exporting histories, converting CONSTANT_CASE enum values to CamelCase.\r\n\r\nSDK replayers should support the hacked JSON output as well as valid proto JSON output to allow downloading histories programmatically in addition to the CLI and UI.\r\nEventually we could get rid of the hacked JSON output generation and remove the custom conversion code in all SDKs which reverts the hack.\r\n","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs5On1Pn","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"To clarify, most SDKs before using proto3 JSON just need to not add the prefix to the enum if it's already there. It should be a single conditional for most.\r\n\r\nNow, in Go this is a different deal. We violated proto3 in the generated code. I am not sure there's an easy path forward to proto3-valid JSON there.","createdAt":"2022-11-17T18:53:10Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/164#issuecomment-1319064551","viewerDidAuthor":false},{"id":"IC_kwDOGflYbs5OocvC","author":{"login":"Spikhalskiy"},"authorAssociation":"CONTRIBUTOR","body":"I don't think this is the right direction. We already have a format of Temporal History Json that is supported across all the tooling. This format is better than proto3 json for a person reading the histories, because it actually makes enum values much easier to read and follow.\r\nCreating several supported formats doesn't solve pretty much any problem, but creates additional maintenance and support burden and unneeded fragmentation.\r\n\r\nI think for us as a product it's better in a long run to have our own stable Temporal Histories Format that takes a dependency on a general-purpose format imposed by Google, specific to protobuf version 3, and is not tolerant to any potentially incompatible changes to our proto structures. In comparison to these cons, the maintenance and development burden of our own Temporal History Json format is relatively small.\r\n\r\n","createdAt":"2022-11-17T21:27:08Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/164#issuecomment-1319226306","viewerDidAuthor":false}],"createdAt":"2022-11-17T18:24:56Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":164,"reactionGroups":[],"state":"OPEN","title":"Support valid proto JSON in SDK replayers","updatedAt":"2024-07-13T01:07:35Z","url":"https://github.com/temporalio/features/issues/164"}
