{"assignees":[],"author":{"id":"MDQ6VXNlcjU4MzkxOQ==","is_bot":false,"login":"underrun","name":"J Derek Wilson"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nThere are conditions under which it would be advantageous to make routing, balancing, rate limiting decisions on requests at L7 based on the namespace associated with the request. This is especially true for multitenant environments to manage QoS across many namespaces. Currently a workaround for this is to create DNS names per namespace that all point to the same temporal server and inject SNI info into the http header at the edge, but this can also get unmanageable at scale and requires coordinating creating a domain with registering a namespace which should ordinarily be a light weight operation.\r\n\r\n### Describe the solution you'd like\r\n\r\nIdeally, all requests from all SDKs would include an http header that indicates the temporal namespace the request is associated with. This leaves out operations that don't relate to a namespace, but as these are relatively few it shouldn't be an issue (or could be addressed in the future if it becomes a problem).\r\n\r\n### Additional context\r\n\r\nThis can also be useful in the context of very large temporal services where namespaces are sharded across multiple temporal servers behind the same L7 loadbalancer but that do not require the SDK client to know which temporal server the namespace is hosted on.","closedAt":"2024-07-30T15:36:47Z","comments":[{"id":"IC_kwDOGflYbs6GoDnf","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"duplicate of https://github.com/temporalio/features/issues/475","createdAt":"2024-07-30T15:36:47Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/86#issuecomment-2258647519","viewerDidAuthor":false}],"createdAt":"2022-07-21T22:51:33Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":86,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Add an http header indicating temporal namespace for each request","updatedAt":"2024-07-30T15:36:47Z","url":"https://github.com/temporalio/features/issues/86"}
