{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"### Describe the solution you'd like\r\n\r\nUsers may want to use heartbeater as a simple keep alive and may not want to setup heartbeats inside of their activity code. We have traditionally left this up to users, but enough users are building \"auto heartbeaters\" which just wrap activities and start an async timer that they stop when activity is done.\r\n\r\nAfter discussion, this is the decision:\r\n\r\n* Each SDK should provide an auto-heartbeating helper\r\n  * After discussion, we discourage this so it's not a worker or activity option, but a helper they have to explicitly invoke\r\n* The auto heartbeater should automatically send a heartbeat sans details every X of the heartbeat timeout (where X is probably the normal heartbeat throttle interval)\r\n* If a user attempts to manually heartbeat while auto heartbeater running, an exception is thrown from the manual heartbeat call\r\n  * After discussion it was decided that this is a better option than letting users mix auto and manual and deciding whether to keep sending old details or what\r\n* Documentation for the auto heartbeater should discourage its use, warning that a stalled yet not complete activity will continue to heartbeat\r\n\r\nThis is not an option, this is a helper. So in Go it might look like:\r\n\r\n```go\r\nfunc MyActivity(ctx context.Context) error {\r\n\th := activity.StartAutoHeartbeat(ctx)\r\n\tdefer h.Stop()\r\n\r\n\t// ... rest of your code\r\n}\r\n```\r\n\r\n(taken from my forum post at https://community.temporal.io/t/why-doesnt-the-sdk-go-have-enableautoheartbeat/6340/2)","closedAt":null,"comments":[],"createdAt":"2023-02-17T20:34:50Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":229,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":6}}],"state":"OPEN","title":"[Feature Request] Auto heartbeating","updatedAt":"2023-02-17T20:35:07Z","url":"https://github.com/temporalio/features/issues/229"}
