{"assignees":[],"author":{"id":"MDQ6VXNlcjUxNzY4Mw==","is_bot":false,"login":"Sushisource","name":"Spencer Judge"},"body":"### What are you really trying to do?\r\n\r\n<!-- \r\nTell us at a high level what you're doing, to avoid XY problem (https://en.wikipedia.org/wiki/XY_problem) \r\n-->\r\n\r\n### Describe the bug\r\n\r\nRecently there was a bug in TS sdk triggered by protos changing some activity timeout values from 0 to nil. Fixed by https://github.com/temporalio/temporal/pull/5444 and https://github.com/temporalio/temporal/pull/5445\r\n\r\nThe relevant question is why did our features tests (as run by the server repo) not catch this? Even though our activity coverage as of the time of writing is anemic (only two tests). It still should've been caught. It's unclear why it wasn't.\r\n\r\nWhen I run the hello world sample as mention in Tim's fix, indeed, it repros running against server main (before his or Roey's fix). But... when I run the exact same TS version as in samples (1.8.4) with the exact same code, except inside of features, it does not repro. \r\n\r\n### Minimal Reproduction\r\n\r\nRunning https://github.com/temporalio/features/tree/main/features/activity/cancel_try_cancel against server before the linked PRs should trigger the bug, but it doesn't. Alternatively creating a new feature with the simplest possible code (like the hello world sample) still doesn't trigger it.\r\n\r\n\r\nIf I had to guess, there's some weird dependency magic going on here where maybe the version we think we're running isn't the version we're really running... but it sure looks like everything is working right.","closedAt":"2024-02-22T23:43:28Z","comments":[],"createdAt":"2024-02-22T00:41:53Z","labels":[{"id":"LA_kwDOGflYbs7XtLc0","name":"bug","description":"Something isn't working","color":"d73a4a"}],"milestone":null,"number":421,"reactionGroups":[{"content":"ROCKET","users":{"totalCount":1}}],"state":"CLOSED","title":"[Bug] Why doesn't this repo trigger TS barfing on null activity timeouts?","updatedAt":"2024-02-22T23:43:28Z","url":"https://github.com/temporalio/features/issues/421"}
