{"assignees":[],"author":{"id":"MDQ6VXNlcjQ1MjM5NTU=","is_bot":false,"login":"longquanzheng","name":"Quanzheng Long"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nWhen executing many local activities in a row or parallel within a workflow task, (or a local activity is retrying), the workflow task is waiting until passed 80% of the workflow task timeout(10s). This could cause a big delay of query processing, or signal processing. \r\n\r\nIn certain scenarios, it's more flexible to let user workflow to decide when they can report the workflow task completed and then get(lease) a new workflow task to execute the next activities. This will then make it possible to process query task, or new signals. \r\n\r\n### Describe the solution you'd like\r\n\r\n* LocalActivityOptions provides a flag to allow user to force complete current workflow task when it's completed and/or failed. \r\n* alternatively, have an API like activity.forceCompleteWorkflowTask() to be invoked by user code \r\n* It should be only a SDK feature, likely server doesn't need to do anything.\r\n\r\n### Additional context\r\n\r\n[Acknowledged by Maxim in the internal thread. ](https://indeed-pte.slack.com/archives/C02E8TQA01G/p1708399091085179?thread_ts=1707947751.463399&cid=C02E8TQA01G)\r\n","closedAt":null,"comments":[{"id":"IC_kwDOGflYbs51Fhaa","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"This sounds like you want to just expose the internal concept we have called workflow task heartbeating (whereby we request a new workflow task for long running local activities). I think that is probably doable, though if you know that you may go beyond a workflow task boundary, it might be worth questioning whether local activities were the right thing to use. It could be very dangerous to expose this because people might inadvertently blow up their history with tasks if I understand correctly.\r\n\r\n","createdAt":"2024-02-26T15:14:08Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/features/issues/424#issuecomment-1964381850","viewerDidAuthor":false}],"createdAt":"2024-02-23T03:49:43Z","labels":[{"id":"LA_kwDOGflYbs7XtLc6","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":424,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Allow force complete current workflow task when localActivity is completed or failed","updatedAt":"2024-02-26T15:14:10Z","url":"https://github.com/temporalio/features/issues/424"}
