{"assignees":[],"author":{"id":"U_kgDOCeuzXQ","is_bot":false,"login":"drewhoskins-temporal","name":"Drew Hoskins"},"body":"When a user resets an activity the activity should be restarted.  \n* They may have passed `--reset-heartbeats` in which case heartbeat details should be cleared\n* If they didn't pass it, they may nonetheless want the code to start from the beginning of the method (perhaps they've deployed a code fix which improves efficiency or fixes a memory leak, or have non-deterministic code that has randomly gotten into a bad state.)\nThe server will inform the SDK that heartbeats were reset so that it can throw an error in the user's Activity.\n\nRequirements:\n\n* Users shouldn't have to predict that resets will happen when writing their activity code \n* Code should by default do the right thing and exit and restart, provided they haven't written an exception handler.\n* Should work as much like pause and cancel as possible for consistency.\n*  Users should be able to write a simple exception handler that cleans up after *any* interruption, including cancellation, pausing, and reset.  \n* Users should also be able to differentiate.  For example, after cancel, cleanup would be permanent, but after pause/reset, it would be temporary, which may mean the user would want to take different actions.\n\n* [ ] Ruby https://github.com/temporalio/sdk-ruby/issues/254\n* [ ] TypeScript https://github.com/temporalio/sdk-typescript/issues/1693\n* [ ] Python https://github.com/temporalio/sdk-python/issues/847\n* [ ] PHP https://github.com/temporalio/sdk-php/issues/605\n* [ ] Go https://github.com/temporalio/sdk-go/issues/1931\n* [ ] .NET https://github.com/temporalio/sdk-dotnet/issues/464\n* [x] Java https://github.com/temporalio/sdk-java/issues/2488\n","closedAt":null,"comments":[],"createdAt":"2025-04-23T19:08:03Z","labels":[],"milestone":null,"number":620,"reactionGroups":[],"state":"OPEN","title":"SDK support for activity reset","updatedAt":"2025-08-19T14:08:02Z","url":"https://github.com/temporalio/features/issues/620"}
