{"assignees":[],"author":{"id":"MDQ6VXNlcjM5ODMyMzA=","is_bot":false,"login":"KMilhan","name":"Milhan"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nIn [here](https://github.com/temporalio/sdk-python#exceptions), the project describes how the exception from workflows are handled.\r\n\r\nRecently, I discovered many exceptions (such as `httpx` timeout) from activity create start_to_close timeout. I wish we have better documentation about the exception from activity side\r\n\r\n### Describe the solution you'd like\r\n\r\nAdditional description about exceptions from the activity (worker) side. Which exception can we raise to mark it failed activity run and retry? what are not allowed exceptions?\r\n","closedAt":"2022-09-21T12:43:22Z","comments":[{"id":"IC_kwDOGusT1c5KdyPu","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Can you clarify the suggestion a bit?\r\n\r\n> I discovered many exceptions (such as httpx timeout) from activity create start_to_close timeout\r\n\r\nAll exceptions from activities are treated equally (except for some special exceptions concerning cancellation and complete async). Not sure what you mean by \"create start to close timeout\" but the relation of timeouts/retries to errors are explained at https://docs.temporal.io/activities.\r\n\r\n> Which exception can we raise to mark it failed activity run and retry?\r\n\r\nAll\r\n\r\n> What are not allowed exceptions?\r\n\r\nAll exceptions are allowed. Can you clarify the question?\r\n\r\n(also feel free to contact us on Slack at https://temporal.io/slack or the forum at https://community.temporal.io to get quicker answers)","createdAt":"2022-09-16T12:49:11Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/134#issuecomment-1249321966","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5KmzrC","author":{"login":"KMilhan"},"authorAssociation":"CONTRIBUTOR","body":"Let me work on my side if I can reproduce the behavior I saw the last couple of weeks.\r\n\r\n> All exceptions are allowed. Can you clarify the question?\r\n\r\nIn the current README,\r\n\r\nit says\r\n\r\n> Exceptions\r\n> Workflows can raise exceptions to fail the workflow\r\n> Using temporalio.exceptions.ApplicationError, exceptions can be marked as non-retryable or include details\r\n\r\nI wanted to know what exceptions we can raise to mark the activity `failed` because I've seen activities left \"stale\" with the exception cases and Workflow has `ApplicationError` to officially mark it as failed workflow. Can we use this exception in activity too? or any exceptions are treated as failures? For activities, what's the exception that marks it \"retryable\" and what's the one that marks it \"non-retryable\"?\r\n\r\nSo I thought maybe an exception explanation for the activities is \"missing\" by mistake. So I created this ticket. I know the readme I quote above is under the workflow section, but activities section does not have exception subsection.\r\n\r\nAlso, thank you for giving me the reference to the slack and community channel. I'll write questions on those channels.","createdAt":"2022-09-19T23:53:21Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/134#issuecomment-1251687106","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5KpQbs","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> because I've seen activities left \"stale\" with the exception cases\r\n\r\nThere is no such thing as a \"stale\" activity. Are you sure it's not continually retrying? What does the UI show?\r\n\r\n> Can we use this exception in activity too?\r\n\r\nYes, you can use the exception in activities too (it's good for passing details, setting type, and marking exceptions as not retryable)\r\n\r\n> or any exceptions are treated as failures?\r\n\r\nFor activities, they are\r\n\r\n> For activities, what's the exception that marks it \"retryable\" and what's the one that marks it \"non-retryable\"?\r\n\r\nAll are retryable by default except for 1) if you create `ApplicationError` with `non_retryable=True`, 2) the `retry_policy` set when you invoke the activity has a `non_retryable_error_types` that includes the unqualified name of the exception class (or application error `type`), or 3) the retry policy permits no more retries (i.e. max attempts has been reached; set it to 1 to disable retries).\r\n\r\n> So I thought maybe an exception explanation for the activities is \"missing\" by mistake\r\n\r\n:+1: I can make this section. Note, the README is not the canonical source of documentation, it's just there while the https://docs.temporal.io/application-development/ gets up to speed. The concept of activity failures/errors is not Python specific (though there are of course Python-specific parts). I will also submit a request to improve https://docs.temporal.io/application-development/foundations?lang=python#activity-execution and https://docs.temporal.io/activities/#activity-execution with regards to activity exceptions.","createdAt":"2022-09-20T13:07:36Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/134#issuecomment-1252329196","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5KsUH_","author":{"login":"KMilhan"},"authorAssociation":"CONTRIBUTOR","body":"Thank you very much @cretz. In the UI, we had numerous activities reaching the max timeouts when the code raised an error (based on log), which looked like it didn't catch the exception as a failure but lost the activity worker.\r\n\r\nI tried to reproduce the error but it seems like I can't with the minimal configuration. Seems like the issue was actually on our codebase side not on temporalio sides.\r\n\r\nAlso appreciate your consideration of adding readme section and guiding me to the resources.\r\n\r\nPlease feel free to close this ticket. Many thanks!","createdAt":"2022-09-21T02:32:24Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/134#issuecomment-1253130751","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5KuUQT","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":":+1: I have communicated with documentation to document errors properly for workflows and activities.","createdAt":"2022-09-21T12:43:22Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/134#issuecomment-1253655571","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6Ryn0y","author":{"login":"yitian-reevo"},"authorAssociation":"NONE","body":"lol, a follow up question from year 2024, i think for latest version 1.8.0 (i may have an example), can you please take a look at this issue (https://github.com/temporalio/sdk-python/issues/679)? @cretz thanks!\r\n\r\nI found no matter how I write, the activity are still being retried, no sure if it's our codebase problem.","createdAt":"2024-10-30T06:19:35Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/134#issuecomment-2445966642","viewerDidAuthor":false}],"createdAt":"2022-09-16T04:57:20Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":134,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Extend readme contents about exception from activity","updatedAt":"2024-10-30T06:19:36Z","url":"https://github.com/temporalio/sdk-python/issues/134"}
