{"assignees":[],"author":{"id":"MDQ6VXNlcjY5NjA0MDA=","is_bot":false,"login":"ytaben","name":"Yaroslav Taben"},"body":"### Is your feature request related to a problem? Please describe.\r\nGreetings, this is more of a 'hear your thoughts' kind of feature. If you believe the idea is viable for the SDK - we would also be happy to help with a contribution for it.\r\n\r\nAs of now - various activity and workflow parameters such as timeouts, task queue, retry policy and so on have to be specified at call sites. What we find in practice from experience - these parameters are _almost_ always tied to the definition\\declaration of the workflow\\activity itself.\r\n\r\nFor example - if an author makes a non-idempotent activity that should never be retried - it makes sense to specify maximum attempt to 1 in activity declaration. Same thing with heartbeating: if the author implemented heartbeating - the users will either forget to specify it at call site or copy paste the same heartbeat timeout everywhere. With regular timeouts - we just find people copy-pasting the same values or making helper functions like 'start_my_activity' that encapsulates those params.\r\n\r\n### Describe the solution you'd like\r\nThe proposed solution is to allow these parameters to be specified in declarations.\r\nFor example:\r\n```\r\n@activity.defn(\r\n  task_queue=\"urgent_important_task_queue\",\r\n  start_to_close_timeout=timedelta(minutes=10),\r\n  heartbeat_timeout=timedelta(seconds=30),\r\n  retry_policy=RetryPolicy(maximum_attempts=1)\r\n)\r\ndef my_activity(...) -> ...:\r\n  ...\r\n```\r\n\r\nIn each relevant SDK method - such as `start_activity` or `execute_activity`, etc we would pick call-site value first and fall back to declaration if not given.\r\n\r\n### Additional context\r\n\r\nThe intention would be to keep any existing behavior exactly the same.\r\nThere are some edge cases to think about such as having to use a sentinel value as default to allow explicitly setting `None`.\r\n\r\nWe are also happy to do this in our wrapper internally but wanted to share in case this makes the overall SDK experience better.\r\n","closedAt":"2024-07-18T20:05:31Z","comments":[{"id":"IC_kwDOGusT1c6FVvfi","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Many users in all SDKs choose to set their activities at the definition site and often refer to them at call site (or use a helper method for activity invocation that retrieves them). This is very common and we encourage it. It is well known that for many/most, it makes more sense for the activity implementer to define their options than the caller.\r\n\r\nHowever, the SDK is unable to make these general assumptions about which definition site is the actual one desired because the call site may be a completely different set of code (and options) from the definition site. Also, it may give the implementer a false sense of what the options are since the caller is the true definer of the options not the implementer (i.e. can override). The Temporal platform would have to be altered to support worker-side options which we may have in the future but not at this time.\r\n\r\nSo while we definitely encourage users to put their options where they fit with their code best, I fear at this time without Temporal platform support for declaration-side options, it is too confusing to pretend that it exists (especially since it may exist one day). The lack of this is common across all SDKs and we regularly encourage users to put their reusable options in code where they prefer.","createdAt":"2024-07-18T16:49:28Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/588#issuecomment-2237069282","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6FXRY0","author":{"login":"ytaben"},"authorAssociation":"CONTRIBUTOR","body":"That is fair reasoning.\r\nI, as an end user, would be ok with understanding 'these are defaults but end users override them' but I can see how this extends to situations where it's not even the default. Someone can just call an activity as string from anywhere and the decorator is not at play at all.\r\n\r\n\r\nI also do think that platform support for worker side options has value (i.e. non-idempotent activities for example) so we'll likely add these default options to our wrapper and if worker side options become a thing - adapt our wrapper then.\r\n\r\nThank you!","createdAt":"2024-07-18T20:05:31Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/588#issuecomment-2237470260","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6FXUH5","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> I also do think that platform support for worker side options has value\r\n\r\nWe agree. There is a potential effort coming that will let you update the options via a client (i.e. externally from the workflow) for already started activities which technically allows activities to update their own options. The more explicit ahead-of-time options definition from a worker will be a bit harder and take longer because Temporal has no mechanism to even make the server aware an activity exists ahead of time much less some options it may have.","createdAt":"2024-07-18T20:13:04Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/588#issuecomment-2237481465","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6F1aEK","author":{"login":"ytaben"},"authorAssociation":"CONTRIBUTOR","body":"> Temporal has no mechanism to even make the server aware an activity exists ahead of time\r\n\r\nYeah, that's definitely a new thing with its own quirks (probably similar to task queue rate limit where last update from any worker wins).\r\nWe'll keep an eye for 'update options via a client' functionality cause that in theory allows _some_ degree of control from definition site (though not sure how it works for something like a timeout cause it doesn't make sense to change it once you're in flight)","createdAt":"2024-07-23T14:11:38Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/588#issuecomment-2245370122","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6GLd0K","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"https://github.com/temporalio/temporal/issues/6339 is a tracking issue for the server-side activity update concept","createdAt":"2024-07-25T18:30:39Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/588#issuecomment-2251152650","viewerDidAuthor":false}],"createdAt":"2024-07-18T15:45:47Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":588,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Default Workflow\\Activity Params In Declaration","updatedAt":"2024-07-25T18:30:41Z","url":"https://github.com/temporalio/sdk-python/issues/588"}
