{"assignees":[],"author":{"id":"MDQ6VXNlcjk1NTk2NTU=","is_bot":false,"login":"gregbrowndev","name":"Greg Brown"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\n[Slack discussion](https://temporalio.slack.com/archives/CTT84RS0P/p1728929473099159)\r\n\r\nHi,\r\n\r\nI've been rolling out an OpenTelemetry-based observability solution for my Temporal app. The reason for using OTel is partly due to the Temporal Python SDK already using OTel for traces and metrics (in the SDK), so I want to adopt those SDKs for custom metrics and logging.\r\n\r\nEverything works great in async activities. I've been able to use OTel tooling for logging and tracing (using the `TracingInterceptor` as [seen in this example](https://github.com/temporalio/samples-python/blob/main/open_telemetry/worker.py)), I can see traces with their correlated logs for each activity in my backend (Grafana, Loki, Tempo). The Temporal SDK provides `activity.metric_meter()`, which I've used to add custom metrics to async activities.\r\n\r\nHowever, I'm having several issues with sync activities running on process-pool-based workers (I'm happy to split them into separate issues):\r\n\r\nThe `trace_id` and `span_id` injected into the logs are incorrect for all except the first activity that runs on that worker. It seems that the first activity's IDs are injected into all activities that follow it.\r\n- Temporal SDK's `activity.metric_meter()` doesn't work in process-pools, which is clearly a known but probably related issue. I planned to set up a separate OTel `MetricProvider` to support custom metrics in my sync activities. However, this looks to have the same limitations (I haven't tried everything exhaustively yet).\r\n\r\nNote: I suspect initialising the `MeterProvider` for each process/activity will be a lot more simple because it isn't attached to a global root logger.\r\n\r\nWhile these issues are likely inherently within the OTel SDKs, the same issues are also known to be true for the TracingProvider ([ref](https://opentelemetry-python.readthedocs.io/en/latest/examples/fork-process-model/README.html)), yet Temporal managed to get that to work. \r\n\r\nPlease provide guidance on setting up OTel logging and custom metrics in process-pool-based workers or support them natively like you do OTel tracing.\r\n\r\n<!-- A clear and concise description of what the problem is. Ex. I'm always frustrated when [...] -->\r\n\r\n### Describe the solution you'd like\r\n\r\nSupport for the remaining OpenTelemetry SDKs (metric and logging) natively in both async, thread-pool, and process-pool workers. \r\n\r\n<!-- A clear and concise description of what you want to happen. SCREENSHOTS OR CODE SAMPLES ARE VERY HELPFUL -->\r\n\r\n","closedAt":null,"comments":[],"createdAt":"2024-10-14T20:46:25Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":669,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Support / provide guidance on using OpenTelemetry logging + metrics SDKs with process-pool workers ","updatedAt":"2024-10-14T20:46:25Z","url":"https://github.com/temporalio/sdk-python/issues/669"}
