{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"### Describe the solution you'd like\r\n\r\nToday we only use a type hint if the arg count matches the input count. But the args may have default values. So we need to at least use type hints when the required arg count matches the input count. Maybe we should just remove the check altogether and just use as many type hints as we can.","closedAt":null,"comments":[{"id":"IC_kwDOGusT1c7ZK9X0","author":{"login":"asavartsov"},"authorAssociation":"NONE","body":"I guess not a lot changed? I stumbled into this in very funny way: I have a workflow which first argument is a model, and some rest have default values for single reason: being able to quickly \"Start Workflow Like This One\" from UI because it supports only one argument.\n\nAs you guess, in the programmatic flow all values are provided and everything works fine, but when starting from UI, the model becomes a `dict`. \n\nThere are a lot of options of course, from the wrapping to checking if a dict and `model_validating` in manually. Anyway, not knowing about type-hinting limitations, I attributed this sudden appearance of dict to incorrect data converter configuration, and was digging in wrong direction.\n\nSo maybe this limitation worth to be mentioned in README, somewhere around `@workflow.run` and  Pydantic sections.","createdAt":"2025-12-11T19:46:02Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/360#issuecomment-3643528692","viewerDidAuthor":false}],"createdAt":"2023-08-01T21:54:50Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":360,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Allow use of type hints even if arg count mismatches in case of default params","updatedAt":"2025-12-11T19:46:03Z","url":"https://github.com/temporalio/sdk-python/issues/360"}
