{"assignees":[],"author":{"id":"MDQ6VXNlcjE2NjAzNDU=","is_bot":false,"login":"reith","name":"amir"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nI have a workflow that runs activities in an explicitly set task queue. One reason for this is that I have two different task queues but the issue affects any workflows that set task queues explicitly. In workflow tests, in which I merely mock activities, I don't really need to run multiple workers, one per task queue. My current approach is to subclass my workflow in the test suite, override task queues names and forward `run` to the actual superclass but I don't like it because I have to deal with workflow and data validation for my dummy workflow that I only added for tests.\r\n\r\nNote that, there is no straightforward way to run multiple workers in test suites, or I haven't found it yet. The bellow code:\r\n\r\n```python\r\nasync with Worker(task_queue=queue_a, activities=[activitiy_a], workflows=Workflow):\r\n    async with Worker(task_queue=queue_b, activities=[activity_b], workflows=[]):\r\n       await env.client.execute_workflow(Workflow.run, task_queue=queue_a) \r\n```\r\n\r\nerrors _activity function activity_b is not registered on this worker_. I can run the other worker in a separate thread though.\r\n\r\n### Describe the solution you'd like\r\n\r\nI can think of some solutions:\r\n- `testing.WorkflowEnvironment` can provide a `with_overriden_task_queue` which modifies the client to run all workflows in a single queue.\r\n- support nested Workers() (above code)\r\n- provide a helper, `WorkerGroup`, that can act as an async context provider for multiple workers.","closedAt":"2024-07-10T01:12:22Z","comments":[{"id":"IC_kwDOGusT1c6EP7ws","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> In workflow tests, in which I merely mock activities, I don't really need to run multiple workers, one per task queue\r\n\r\nIt should be harmless to do so and it's helpful; to possibly get errors about misconfigured task queue name and such during tests\r\n\r\n> My current approach is to subclass my workflow in the test suite, override task queues names and forward run to the actual superclass but I don't like it because I have to deal with workflow and data validation for my dummy workflow that I only added for tests.\r\n\r\nThe best approach is to just run as many workers as you need in tests. But if you are sure you don't want to run multiple workers in tests, consider using workflow input to drive the task queue name instead of subclassing.\r\n\r\n> Note that, there is no straightforward way to run multiple workers in test suites, or I haven't found it yet.\r\n\r\nRunning multiple workers is no different in tests or production. The library code is intentionally the same.\r\n\r\n> The bellow code: errors activity function activity_b is not registered on this worker. I can run the other worker in a separate thread though.\r\n\r\nThis sounds like you are trying to call `activity_b` in your workflow from `queue_a`.\r\n\r\n> testing.WorkflowEnvironment can provide a with_overriden_task_queue which modifies the client to run all workflows in a single queue.\r\n\r\nThe environment is unrelated to the workers you start on it. It has no knowledge of workers, it is simply a built-in Temporal server. Some people use the environment for \r\n\r\n> support nested Workers() (above code)\r\n\r\nThese are supported. If it is not working there must be something else incorrect such as improperly calling an activity on a task queue worker that it is not registered on.\r\n\r\n> provide a helper, WorkerGroup, that can act as an async context provider for multiple workers.\r\n\r\nThis is easy enough for anyone to write. You don't have to nest, you can just use `run`, e.g. maybe something like:\r\n\r\n```\r\nworkers = [\r\n    Worker(task_queue=queue_a, activities=[activity_a], workflows=[WorkflowA]),\r\n    Worker(task_queue=queue_b, activities=[activity_b], workflows=[WorkflowB]),\r\n    Worker(task_queue=queue_c, activities=[activity_c], workflows=[WorkflowC])\r\n]\r\nasync with asyncio.TaskGroup() as tg:\r\n    worker_tasks = [tg.create_task(w.run()) for w in workers]\r\n    # Do stuff\r\n    for w in worker_tasks:\r\n        w.cancel()\r\n```\r\n\r\nThat is untested (just typed here in GitHub), but the idea is there. Use Python asyncio utilities like task group or `gather` to run multiple things concurrently (but nested is fine too like your previous code). Feel free to come join us on [Slack](https://t.mp/slack) in `#python-sdk` to discuss general test questions/approaches.","createdAt":"2024-07-09T21:34:14Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/576#issuecomment-2218769452","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6ER51W","author":{"login":"reith"},"authorAssociation":"NONE","body":"Thanks @cretz for the detailed response.\r\n\r\n> This sounds like you are trying to call `activity_b` in your workflow from `queue_a`.\r\n\r\nThis is the intended usage. I run my workflow in `queue_a,` along with some activities, but that workflow also executes some specific activities in task queue `queue_b`. \r\n\r\n> This is easy enough for anyone to write. You don't have to nest, you can just use run, e.g. maybe something like.\r\n\r\nI'll try this. Thanks!\r\n","createdAt":"2024-07-10T01:12:22Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/576#issuecomment-2219285846","viewerDidAuthor":false}],"createdAt":"2024-07-09T18:38:17Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":576,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] better workflow testing in multi-worker scenarios","updatedAt":"2024-07-10T01:12:22Z","url":"https://github.com/temporalio/sdk-python/issues/576"}
