{"assignees":[],"author":{"id":"MDQ6VXNlcjUyMjA1","is_bot":false,"login":"dandavison","name":"Dan Davison"},"body":"Currently, when workflow and activity workers are run in the same process, they share the the same thread (same event loop):\n\nhttps://github.com/temporalio/sdk-python/blob/b0dfaef0f029244a44f56c4c1970cda8621b4e68/temporalio/worker/_worker.py#L489-L492\n\nRunning these (and Nexus workers when they arrive) in different threads would prevent an async activity that incorrectly does blocking I/O from blocking workflow progress. In addition to limiting blast radius it should make it easier to understand the failure modes.","closedAt":null,"comments":[{"id":"IC_kwDOGusT1c6kl_Y3","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"This is going to be tough to do. Notes:\n\n* We have to be able to use the primary/user-controlled event loop for running (some) activities/operations anyways, so maybe this is a workflow worker only thing?\n* Workflow workers will have to remove async and go threaded which will cost threads. There is the blocking call for polling (currently async, so not using Python thread). Then the code backgrounds the work when received which uses async today. And then _that_ work uses a thread on a pool so that it can impose a deadlock timeout on it. This means every workflow activation uses 1 thread from the thread pool today. We either have to double the in-use thread count or run a single thread for the life of the workflow worker that runs its own asyncio event loop so it can background activations as received (not to be confused with the next point).\n* Workflow workers will always need to use primary/user-controlled event loop for user codecs anyways (e.g. via `asyncio.run_coroutine_threadsafe`) which means it is subject to the same blocking concerns. So any benefits are only for those not using codecs.\n\nWe will have to decide whether the benefit is worth the costs here.","createdAt":"2025-03-28T13:48:56Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/803#issuecomment-2761422391","viewerDidAuthor":false}],"createdAt":"2025-03-27T20:44:35Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":803,"reactionGroups":[],"state":"OPEN","title":"Run different worker types in separate threads","updatedAt":"2025-03-28T14:06:29Z","url":"https://github.com/temporalio/sdk-python/issues/803"}
