{"assignees":[],"author":{"id":"MDQ6VXNlcjU1ODU3NTg=","is_bot":false,"login":"schibrikov","name":"Eugeny Schibrikov"},"body":"### What are you really trying to do?\r\n\r\nI want to shutdown worker and then spin it up again later. So I'm calling `worker.shutdown()`, and then after it is off for some time calling `worker.run()` again.\r\n\r\n### Describe the bug\r\n\r\n`run()` throws `Already started` error, despite worker has shut down already. This happens because `self._started` is set to `True` when starting, but not reset when shutting down.\r\n\r\nI believe this is a bug and we should reset `self._started` flag to False, when worker has shut down.\r\nIs it the case or I'm doing something very wrong?\r\n\r\n### Extra context\r\n\r\nMy worker is processing long-running, resource-consuming tasks, so that only 1 can be processed at a time. Though the whole workflow consists of 3 different tasks (file-system dependent) that should run on a single node. So effectively I'm running 3 workers:\r\n\r\n1. One is for the workflow itself, no activities\r\n2. Second contains an activity that reports unique worker id and that shut down itself\r\n3. Third processes all 3 long-running activities on the unique task queue and after that, in a separate activity - restarts the second worker.\r\n\r\nIs this scheme meaningful or I can get it running simply other way?","closedAt":"2023-02-23T17:19:27Z","comments":[{"id":"IC_kwDOGusT1c5V7sSZ","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":">  Is it the case or I'm doing something very wrong?\r\n\r\nWorkers are single use by intention to prevent confusion and misuse. You can create another worker with the same config and call `run` on it.\r\n\r\n> Is this scheme meaningful or I can get it running simply other way?\r\n\r\nI would need to know more about _why_ you need to restart a worker. Most workers run forever and you use workflows to orchestrate or limit activities. If easier this can be discussed in our forum or Slack.","createdAt":"2023-02-23T12:45:55Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/286#issuecomment-1441711257","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5V8-lr","author":{"login":"schibrikov"},"authorAssociation":"CONTRIBUTOR","body":"Yeah, right, I had no luck manually setting `worker._started = False` after shut down, so there are other concerns with restarting it. And yes, I got around this issue by simply running a new worker, instead of reusing, so they kind of \"one-off\" now and it works exactly as I expected, thanks.\r\n\r\nI would happily describe my use-case in details later, since it appears common to me and may worth documenting.\r\nIn short: I'm running ML workflow (download-inference-upload/cleanup). So I need to stick my workflow to a single node and onyly run a single one on this node, also inference is long-running, so I don't want to assign the next workflow to a node currently computing. And I cannot simply follow sticky sessions tutorial, since my set of nodes is dynamic.","createdAt":"2023-02-23T16:12:01Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/286#issuecomment-1442048363","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5V9XN9","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> I would happily describe my use-case in details later\r\n\r\n:+1: Will be on the look out and close this issue as not a bug.\r\n\r\n> And I cannot simply follow sticky sessions tutorial, since my set of nodes is dynamic.\r\n\r\nThe sticky sessions example at https://github.com/temporalio/samples-python/tree/main/activity_sticky_queues is for a dynamic number of nodes too. You don't have to use UUID to identify each host if you need more specific service discovery. You can also use workflows identified by host-specific identifiers to orchestrate activities onto host-specific task queues if needed.\r\n\r\nCan discuss in another place if needed, closing as not a bug.\r\n\r\n","createdAt":"2023-02-23T17:19:27Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/286#issuecomment-1442149245","viewerDidAuthor":false}],"createdAt":"2023-02-23T10:30:20Z","labels":[{"id":"LA_kwDOGusT1c7gQgHY","name":"question","description":"Further information is requested","color":"d876e3"}],"milestone":null,"number":286,"reactionGroups":[],"state":"CLOSED","title":"[Bug] Worker started state is not reset after shutdown","updatedAt":"2023-02-23T17:19:27Z","url":"https://github.com/temporalio/sdk-python/issues/286"}
