{"assignees":[],"author":{"id":"MDQ6VXNlcjM5ODMyMzA=","is_bot":false,"login":"KMilhan","name":"Milhan"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nI tried to use UUID as an argument of activity. Received an error that UUID is not JSON serializable.\r\n\r\n### Describe the solution you'd like\r\n\r\nUUID is considered JSON serializable in many popular Python libraries, for example, Pydantic and FastAPI, hence Python devs tend to consider UUID as JSON serializable objects. i.e., string form of UUID.\r\n\r\nIs there any limitation from the Temporal core side? If not, it would be great to have UUID support in Python SDK.","closedAt":"2022-09-06T14:43:42Z","comments":[{"id":"IC_kwDOGusT1c5JH1Fz","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I think FastAPI just uses Pydantic, so not sure it's \"many\" popular libs.\r\n\r\nYes, Pydantic probably considers several things JSON serializable that the Python JSON lib does not and we do not. I don't think any of our SDKs support serialization of UUIDs by default (except maybe Go because it's a byte array) and I'm not sure we want to make Python special here.\r\n\r\nPydantic also supports JSON serialization of dates/times, IP addresses, enums besides just `IntEnum`, `Path`s, etc. But we do not. We have to concern ourselves with cross-language compatibility. I will consult with the team, but i am not sure we should support these types by default in Python unless we support them by default in all of our SDKs.","createdAt":"2022-08-25T05:21:05Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/113#issuecomment-1226789235","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5JH8-m","author":{"login":"KMilhan"},"authorAssociation":"CONTRIBUTOR","body":"Thank you very much for your thoughtful message.\r\n\r\nTotally understand supporting various data types such as DateTime/path in a cross-platform/language environment is a challenge and appreciate all the consideration.\r\n\r\nIf you allow me to add a little bit more about UUID - it has quite a straightforward conversion (str to native ds) in popular languages, and it is a greatly common choice for unique ID design. For example, we use UUID for workflow ID where we want every workflow to be unique and don't want to limit the execution by it. I carefully believe that many other users have chosen a similar approach.\r\n\r\nThanks again for your consideration.","createdAt":"2022-08-25T06:14:53Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/113#issuecomment-1226821542","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5JVUuq","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Definitely a straightforward conversion. As it is for many of those other types I listed. I am not sure UUID is special here nor am I sure that we need every SDK to support UUID as a type natively. I will consult with the team, but we can probably support this.\r\n\r\nOf course, since the conversion is so straightforward you can do this conversion yourself and just store as a string. Just like you would a file path, IP address, or any other type with a string representation that Python doesn't consider JSON serializable.","createdAt":"2022-08-29T13:42:31Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/113#issuecomment-1230326698","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5JaR_q","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"I think we can reopen this until I at least get team confirmation that we do or don't want to support this.","createdAt":"2022-08-30T12:53:17Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/113#issuecomment-1231626218","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5Jzjlu","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"After some research, yeah since UUIDs don't have nested abilities to auto-encode to JSON, it causes trouble with https://docs.python.org/3/library/dataclasses.html#dataclasses.asdict and similar use cases. So while we could support encoding single UUIDs to JSON and we could support decoding single UUIDs _and_ nested UUIDs from JSON, we cannot (easily) support encoding nested UUIDs to JSON.\r\n\r\nGonna close this for now as not supported, but if it's a large enough burden to rework our nested encoding, we can look into it.","createdAt":"2022-09-06T14:43:42Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/113#issuecomment-1238251886","viewerDidAuthor":false}],"createdAt":"2022-08-24T08:14:43Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":113,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] UUID support as an arg","updatedAt":"2022-09-06T14:43:43Z","url":"https://github.com/temporalio/sdk-python/issues/113"}
