{"assignees":[],"author":{"id":"MDQ6VXNlcjUyNjY1NzY=","is_bot":false,"login":"nathanielobrown","name":"Nathaniel Brown"},"body":"### Is your feature request related to a problem? Please describe.\r\nI have a non-async activity and I want to send signals to the parent workflow from this activity. I want to do this because I have existing code that scrapes websites and yields those results in a generator and I want to notify the parent workflow of those results as they are fetched. I would prefer not to convert the activity to async because:\r\n\r\n1. The code the activity calls is not async and I don't want to convert it completely to async (it would ruin my tests requests mocking for one thing)\r\n2. I'm nervous about executing my non-async code in a thread pool. I know there is already a threadpool, but spawning threadpools all over the place _feels_ like it could get out of control. Better to have one thread pool and be able to control it's size is my thought\r\n3. If I convert to async code and run my sync code in a thread pool, I'd have to communicate generator results through a queue and it would be a complicated solution\r\n\r\n### Describe the solution you'd like\r\nWould it be possible to add synchronous versions of `workflow.get_external_workflow_handle_for` (not defined as async, but fails if called outside of async function) and `workflow_handle.signal`? In general I guess the question is, are the functions for interacting with workflows going to support use from non-async code?\r\n\r\nI can imagine lots of future cases where I'll want to interact form non-async code as my database interactions are not async so lots of my code is not async.\r\n\r\n### Additional context\r\nMaybe there are some async patterns I can use to mitigate these issues (for example [asyncer](https://asyncer.tiangolo.com/)) but I have not had much luck so far. I'm not an async expert, so any advice would be appreciated.\r\n","closedAt":"2022-07-05T20:15:59Z","comments":[{"id":"IC_kwDOGusT1c5GEAEC","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"> Would it be possible to add synchronous versions of workflow.get_external_workflow_handle_for (not defined as async, but fails if called outside of async function) and workflow_handle.signal?\r\n\r\nI think there may be some confusion here. Everything in the `workflow` package is only for calling from inside the workflow. You would not use them for an activity. If you want to signal a workflow from an activity, you'd use a client. Activity code is just any regular Python code. \r\n\r\n(granted I need to solve #52 soon so you can have a callable class with the client as a class attribute, but you can create the client inside the activity as needed)","createdAt":"2022-07-05T20:08:24Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/64#issuecomment-1175453954","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5GEBZi","author":{"login":"nathanielobrown"},"authorAssociation":"CONTRIBUTOR","body":"> I think there may be some confusion here. Everything in the `workflow` package is only for calling from inside the workflow. You would not use them for an activity. If you want to signal a workflow from an activity, you'd use a client. Activity code is just any regular Python code.\r\n\r\nOoh, OK. That makes sense and is an easy enough rule to remember. I guess something to highlight in the docs as that gets built out.\r\n\r\nI have some thoughts on the callable class issue, I'll comment on that issue.\r\n\r\n","createdAt":"2022-07-05T20:15:59Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/64#issuecomment-1175459426","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c5GEBqA","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":":+1: I will try to make it clearer at https://python.temporal.io/temporalio.workflow.html and once we get general purpose documentation (actively being worked on) I'll make sure it is clear there too.","createdAt":"2022-07-05T20:17:23Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/64#issuecomment-1175460480","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6MzC5p","author":{"login":"ofirsa"},"authorAssociation":"NONE","body":"Hi,\r\nI’m facing the same situation as you described, meaning, I want to send a signal from a non async activity to the parent workflow.\r\nCan you please explain how you solved the issue?\r\nThanks","createdAt":"2024-09-19T21:02:22Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/64#issuecomment-2362191465","viewerDidAuthor":false}],"createdAt":"2022-07-05T20:03:17Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":64,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Get workflow handle/send signals from non-async code","updatedAt":"2024-09-19T21:03:12Z","url":"https://github.com/temporalio/sdk-python/issues/64"}
