{"assignees":[],"author":{"id":"MDQ6VXNlcjEyMDM4OTM=","is_bot":false,"login":"josh-berry","name":"Josh Berry"},"body":"","closedAt":null,"comments":[{"id":"IC_kwDOGusT1c6JO9ob","author":{"login":"dandavison"},"authorAssociation":"MEMBER","body":"Ultimately, we want static analysis for Temporal SDKs to be both runnable as a standalone process and easily integratable into LSP-based IDE tooling.\r\n\r\nOne possibility here would be [mypy plugins](https://mypy.readthedocs.io/en/stable/extending_mypy.html#extending-mypy-using-plugins). However, it's not clear that mypy is going to be dominant in the future of Python type-checking: Microsoft subsequently created Pyright, which is more closely associated with and widely deployed in developer LSP tooling due to VSCode (as well as a bit faster and perhaps has some other advantages). However, my impression is that Pyright [will not](https://github.com/microsoft/pyright/issues/607#issuecomment-873467941) provide extensibility of the sort that we need.\r\n\r\nNow, [Astral](https://astral.sh/) are [creating](https://github.com/astral-sh/ruff/pulls?q=is%3Apr+label%3Ared-knot+is%3Aclosed) a new Python type-checker. Astral's `ruff` linter and formatter has been extremely well received, and they have created LSP tools to go with it. Clearly, their type checker will be integrated into their LSP solution. (They've also [released](https://astral.sh/blog/uv-unified-python-packaging) a competitor to pip/poetry/pyenv etc).\r\n\r\nI think that we should watch [this space](https://github.com/astral-sh/ruff/pulls?q=is%3Apr+label%3Ared-knot+is%3Aclosed). In particular to understand whether Astral are creating type-checking technology that is extensible in a way that we can make use of, and if so when it would make sense to start prototyping. ","createdAt":"2024-08-21T15:40:00Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/390#issuecomment-2302401051","viewerDidAuthor":false},{"id":"IC_kwDOGusT1c6JPHqf","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Basically there are two static analyzers needed IMO:\r\n\r\n* General purpose Python static analyzer that catches people making thread-blocking calls (directly or transitively) in an `async def` function\r\n* Temporal-specific Python static analyzer that catches people making illegal calls (directly or transitively) in a workflow\r\n\r\nThe first one should be a general product/repo IMO, but they both need a call graph so there is an opportunity for code sharing.\r\n\r\nI have POC'd this with MyPy plugins by the way. You can build a reasonable call graph but storing it in cache is difficult because they only allow you to set some plugin metadata at a higher level not a per function level (read https://github.com/python/mypy/blob/master/mypy/plugin.py). It can be hacked, but I think we should contribute a very small PR to MyPy to allow plugins to store a metadata dict on more specific objects.\r\n\r\nI have researched a good bit about Python call graph builders and there are no good/fast modern ones. And I've only found MyPy to provide extensibility _and_ semantic analysis to build proper call graphs (this can't be done without static analysis). It will be great if Ruff gets this analysis, we could definitely build on it.","createdAt":"2024-08-21T16:00:04Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-python/issues/390#issuecomment-2302442143","viewerDidAuthor":false}],"createdAt":"2023-09-26T18:15:04Z","labels":[{"id":"LA_kwDOGusT1c7gQgHN","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":390,"reactionGroups":[],"state":"OPEN","title":"PoC - Static analyzer for Python","updatedAt":"2024-08-21T16:12:17Z","url":"https://github.com/temporalio/sdk-python/issues/390"}
