{
  "summary": "Spring proxy beans marked with @Component fail to register as activity implementations because the proxy class doesn't properly expose the @ActivityInterface. The issue is that Spring's CGLIB proxies wrap the activity instance but only implement marker interfaces, not the actual activity interfaces.",
  "category": "bug",
  "subcategory": "spring-integration",
  "apis": [
    "registerActivitiesImplementations",
    "registerActivityImplementation"
  ],
  "components": [
    "POJOActivityImplMetadata",
    "POJOActivityTaskHandler",
    "SyncActivityWorker",
    "spring-integration"
  ],
  "concepts": [
    "dependency-injection",
    "proxy",
    "spring-framework",
    "activity-registration",
    "interface-detection",
    "cglib"
  ],
  "severity": "medium",
  "userImpact": "Users cannot register Spring-managed activity beans as activity implementations when using proxy-based dependency injection patterns.",
  "rootCause": "POJOActivityImplMetadata.java doesn't properly detect @ActivityInterface annotations on proxy classes generated by Spring's CGLIB enhancement. The proxy class name (ActivityImpl$$EnhancerBySpringCGLIB$$...) doesn't implement the actual activity interfaces, only marker interfaces.",
  "proposedFix": "Modify the interface detection logic to unwrap Spring proxies and inspect the underlying target class for @ActivityInterface annotations.",
  "workaround": "Inject specific Activity interfaces directly rather than using marker interfaces to request collections of beans from Spring container.",
  "resolution": "invalid",
  "resolutionDetails": "Issue reporter could not provide reproduction case. Maintainer verified that activity beans can be initialized and registered when properly wired, suggesting the issue was with the user's specific Spring configuration rather than a SDK bug.",
  "related": [],
  "keyQuote": "If you inject (or request from the Spring container) specific Activity interfaces - Spring proxies should implement the right Activity interfaces.",
  "number": 718,
  "repo": "temporalio-sdk-java",
  "generatedAt": "2026-01-11T18:36:53.252Z"
}