{
  "summary": "Broken workflow code that creates invalid commands causes workers to continuously hammer the server with faulty commands or task failures. The issue lacks rate limiting or backoff, allowing workers to monopolize all available task processors in a retry cycle, effectively DoS-ing the server.",
  "category": "bug",
  "subcategory": "workflow-task-execution",
  "apis": [],
  "components": [
    "worker",
    "workflow-task-executor",
    "command-validation"
  ],
  "concepts": [
    "backoff",
    "rate-limiting",
    "retry",
    "resource-exhaustion",
    "server-stability",
    "task-processor"
  ],
  "severity": "high",
  "userImpact": "Users with broken workflow code can inadvertently cause a denial-of-service on the Temporal server by exhausting worker task processors without rate limiting.",
  "rootCause": "Invalid commands generated by broken workflow code trigger continuous task failure and recreation cycles. The lack of backoff or rate limiting on the SDK side allows workers to utilize all available task processors hammering the server.",
  "proposedFix": "Implement exponential backoff for workflow tasks on the server side (temporal/temporal#2238). On the SDK side, add proactive validation of options that could cause invalid commands and rely on Workflow Task Run Timeout as a basic backoff mechanism.",
  "workaround": "Use Workflow Task Run Timeout as a basic SDK-side backoff mechanism. Implement basic sanity checks on SDK options rather than duplicating full server-side validation logic.",
  "resolution": "fixed",
  "resolutionDetails": "Addressed through server-side exponential backoff for workflow tasks and SDK-side proactive validation of options that could cause invalid commands.",
  "related": [
    898,
    900,
    2238
  ],
  "keyQuote": "all workers end up utilizing all of their allowed by maxConcurrentWorkflowTaskExecutionSize (200 by default) parallel tasks processors to just hammer the server",
  "number": 901,
  "repo": "temporalio-sdk-java",
  "generatedAt": "2026-01-11T18:52:18.246Z"
}