{"assignees":[],"author":{"id":"MDQ6VXNlcjY2NjY5Ng==","is_bot":false,"login":"mloffer","name":"Micah Loffer"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\n<!-- A clear and concise description of what the problem is. Ex. I'm always frustrated when [...] -->\r\n\r\nI would like to be able to use async operations inside of [Update Validators](https://docs.temporal.io/develop/typescript/message-passing#updates).\r\n\r\n#### Use Case\r\nI need to check complex access controls via a database query (e.g. state of an object in the database; ACL/ABAC/etc), and return an error to the caller if not allowed.\r\n\r\n### Describe the solution you'd like\r\n\r\nAsynchronous Update Validators.\r\n\r\n### Additional context\r\n\r\nWhile the Temporal documentation is fairly clear that Validators must be synchronous, there still seems to be a reasonable expectation that any and everything can be async, as demonstrated by this line in the [temporalio/samples-typescript](https://github.com/temporalio/samples-typescript/blob/486d428b2b56701e7eaa976e40dc55f3abc25c79/message-passing/safe-message-handlers/src/workflows.ts#L30) repo. I originally copied this pattern before discovering that Temporal treats async validators as though they are Activities, i.e. logging them to the Workflow Event History and not returning errors to the caller. (So if this feature request is rejected, that code should at least be updated so as not to be misleading.)\r\n\r\n#### Alternatives\r\nI can convert my access control validators (or anything else that requires async logic) to Activities and call them from their respective Update handlers. However, this will litter the Workflow Event History with largely irrelevant information, and will also require additional logic to poll the Workflow for the result of the access control Activity to see if the Update was even allowed.","closedAt":null,"comments":[],"createdAt":"2024-10-09T00:22:40Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1542,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] Allow Update Validators to be async","updatedAt":"2024-10-09T00:22:40Z","url":"https://github.com/temporalio/sdk-typescript/issues/1542"}
