{"assignees":[],"author":{"id":"MDQ6VXNlcjMzNDY4MDg5","is_bot":false,"login":"vwkd","name":""},"body":"Add support for Deno.\r\n\r\nIt would be great if we could write code like in Deno, which offers native Web APIs like `fetch` and executes TypeScript without a build step.","closedAt":"2023-11-10T17:10:45Z","comments":[{"id":"IC_kwDOEujx185rpvLk","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Sure, we really wish to support Deno at some point. There’s no debate on it’s advantages.\r\n\r\nHowever, getting there will require considerable efforts. For context, TS SDK heavily depends on Worker Threads, VMs, async hooks, promise hooks, native libraries, and many other node-specific APIs. Yes, Deno provides compatibility or alternatives for most of these APIs, but last time I checked, Deno's implementations were not complete enough to support the kind of low level stuff that TS SDK does. But I'm very happy to see that things are progressing in the right direction (welcome `ShadowRealm`!).\r\n\r\nIn practice, I expect that we'll probably need to rewrite/redesign several key components of the TypeScript SDK to get it to run reliably and efficiently on Deno. We may also need to redesign parts of the Core SDK, notably to allow it to be usable as a WASM module rather than a NAPI library.\r\n\r\nIt seems very unlikely that we'll be able to make this a thing in the upcoming year. For now, I will close this ticket, as we use a different system to track and prioritize this kind of long-term/large-scale objectives.","createdAt":"2023-11-10T17:10:45Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/sdk-typescript/issues/1285#issuecomment-1806103268","viewerDidAuthor":false}],"createdAt":"2023-11-09T15:20:32Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1285,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Support Deno","updatedAt":"2023-11-10T17:10:45Z","url":"https://github.com/temporalio/sdk-typescript/issues/1285"}
