{"assignees":[],"author":{"id":"MDQ6VXNlcjY0MTIxNjk=","is_bot":false,"login":"mjameswh","name":"James Watkins-Harvey"},"body":"## Context\r\n\r\nOur APIs contain multiple places where a user defined function expect arguments, and where various TypeScript features are used to ensure type coherency and correctness.\r\n\r\nThough all of these APIs are expected covered by functional tests, we sometime notice deficiencies in type coherency assertions, like [here](https://github.com/temporalio/sdk-typescript/pull/1307) and [there](https://github.com/temporalio/sdk-typescript/issues/1051).\r\n\r\nThese errors could have been caught with tests that are designed specifically to trigger build time errors if some type assertion fails. Some tests of that kind already exist in our code base (notably some that got introduced in response to the two issues mentioned previously), but our test coverage is inconsistent and incomplete.\r\n\r\n## Describe the task\r\n\r\nAssess current typing tests coverage, and add any missing tests.\r\n\r\nThe following is a non-exhaustive list of our APIs that should be included in this effort. Most of these APIs may require more than a single assertion (e.g. user function requiring args vs accepting no arg, returning a `Promise`, some value, or void, etc).\r\n\r\n### Signals\r\n- [ ] `defineSignal`\r\n- [ ] `wf.setHandler`\r\n- [ ] `client.getWorkflowHandler().signal()`\r\n- [ ] `client.getWorkflowHandler().signalWithStart()`\r\n- [ ] `wf.getExternalWorkflowHandler().signal()`\r\n- [ ] `wf.startChild(...).signal()`\r\n\r\n### Updates\r\n- [ ] `defineUpdate`\r\n- [ ] `wf.setHandler` (both updater handler and validation handler)\r\n- [ ] `client.getWorkflowHandler().update()`\r\n\r\n### Queries\r\n- [ ] `defineQuery`\r\n- [ ] `wf.setHandler`\r\n- [ ] `client.getWorkflowHandler().query()`\r\n\r\n### Workflows\r\n- [ ] `client.start(...)`\r\n- [ ] `client.execute(...)`\r\n- [ ] `client.signalWithStart(...)`\r\n- [ ] `wf.startChild()`\r\n\r\n### Activities\r\n- [ ] `wf.proxyActivities()`\r\n\r\n### Local Activities\r\n- [ ] `wf.proxyLocalActivities()`\r\n\r\n### Schedules\r\n- [ ] `client.createSchedule({ ... })`\r\n- [ ] `client.getScheduleHandle().update({ ... })`","closedAt":null,"comments":[{"id":"IC_kwDOEujx185uduTF","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"Apart from that [one issue](https://github.com/temporalio/sdk-typescript/issues/1051) where we weren’t maintaining the name in the type, we haven’t had any complaints about deficiencies in the type definitions.\r\n\r\nI fear over testing the types is a non productive effort. How come non of our other SDKs are subjected to such requirements?","createdAt":"2023-12-13T05:19:49Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1308#issuecomment-1853285573","viewerDidAuthor":false},{"id":"IC_kwDOEujx185uk8Q6","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"> Apart from that https://github.com/temporalio/sdk-typescript/issues/1051 where we weren’t maintaining the name in the type, we haven’t had any complaints about deficiencies in the type definitions.\r\n\r\nThat one and the one that Dan just exposed. And I vaguely remember a few related issues that got introduced during work on features like Schedule and Updates, but got identified and fixed before the PRs got merged in.\r\n\r\nI mean, I'm not claiming we have tons of similar deficiencies. But the difficulty here is that this is really about deficiencies that affect _incorrect_ user code (i.e. some code that should not compile does due to improper typing rules).\r\n\r\nWhen an incorrect type definition prevents correct code from compiling, we are very likely to identify and fix these very quickly. But when an incorrect type accepts incorrect code, you won't figure it out unless you actually know that code is incorrect, i.e. by writing code that you would expect to not compile. Users writing incorrect code that compiles probably don't realize they made a mistake, and we are certainly not intentionally introducing mistakes in our tests.\r\n\r\nThat's why they can stay there for very long time without getting noticed, and why it's very easy to introduce similar issues while developing new features.","createdAt":"2023-12-14T05:41:15Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1308#issuecomment-1855177786","viewerDidAuthor":false},{"id":"IC_kwDOEujx185uk9YW","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"> How come non of our other SDKs are subjected to such requirements?\r\n\r\nIs that a philosophical question? I'm tempted to say that's because only TypeScript has a type system so extensive and so expressive (even to the point that it is Turing complete)... yet it fails to actually impose even the most basic of these rules at runtime.\r\n\r\nI mean, each language is different, and I don't think I can't reasonably provide a short yet complete answer to that question. Still, I feel that in other SDKs, the responsibility of asserting type coherency on workflows/activities/signals/etc arguments relies either on very simple and highly reliable language level constructs (eg. interfaces + proxies in Java and call tree analysis in .Net both ends up making these looks like pure method calls from the compiler's perspective) and/or on runtime level features (eg. reflectively calling a method with incorrect signature will result in a runtime failure in most languages)... or clearly is the responsibility of users when that is not possible (eg. when starting a workflow or scheduling an activity in Go, args are untyped, that's the way it is, so deal with it).\r\n\r\nIn TS SDK, most of that burden falls on us (or arguably, _we accepted_ that burden for the convenience of our users). Arguments are often accepted through non-simple language constructs (e.g. mapped/conditional/inferred types/parameterized functions/etc), and users get the impression that they can trust and rely on type assertions that our APIs impose, including those resulting from calculated types. These typing assertions are especially important given that runtime is not helping out.","createdAt":"2023-12-14T05:47:09Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1308#issuecomment-1855182358","viewerDidAuthor":false},{"id":"IC_kwDOEujx185uk_U7","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"> I fear over testing the types is a non productive effort.\r\n\r\nI don't see this is as a long or complex effort. Each case is very simple (one liners in most cases) and involve no _functional_ assertions. Many of the tests have already been written out in [test-interface-type-safety.ts](https://github.com/temporalio/sdk-typescript/pull/1307/files#diff-8d2392d50a59028e11acd1d694a5cb9a4fab8a4c6737b8f010c6d261fe94142d), and missing ones will just follow the same patterns.\r\n\r\nThe only real effort here is just to assesses which APIs have effectively been covered and which haven't, and copy-paste the code to cover whatever's missing at this point.\r\n\r\nHopefully we don't find any new issue... great! Still, we'll have gained a way to reduce the probability of future regressions, and avoid repeating some past mistakes when eventually introducing new features.","createdAt":"2023-12-14T05:57:11Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1308#issuecomment-1855190331","viewerDidAuthor":false},{"id":"IC_kwDOEujx185vcXi8","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"Seems like fairly low ROI.\r\n\r\n> That one and the one that Dan just exposed.\r\n\r\nThat issue was closed, it was working as expected.\r\n\r\nSo again, it's just a single time where we didn't capture the name of the signal / query definition.\r\n\r\nI'm okay with leaving this open, I would just rather prioritize other features and bugs over this.","createdAt":"2023-12-26T18:30:54Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1308#issuecomment-1869707452","viewerDidAuthor":false}],"createdAt":"2023-12-05T21:17:45Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDA2","name":"bug","description":"Something isn't working","color":"d73a4a"}],"milestone":null,"number":1308,"reactionGroups":[],"state":"OPEN","title":"[Chore] Add tests to assert proper type rules on all \"user defined function with args\" APIs","updatedAt":"2023-12-26T18:30:55Z","url":"https://github.com/temporalio/sdk-typescript/issues/1308"}
