{"assignees":[],"author":{"id":"MDQ6VXNlcjI3MDg=","is_bot":false,"login":"Inviz","name":"Yaroslaff Fedin"},"body":"I'd like to be able to record markers from workflow. This is so i can later read them from history later. There's RecordMarker command, but no way to invoke it. I want to use it to side-channel some things from workflow, without causing activation. ","closedAt":"2025-04-29T17:49:13Z","comments":[{"id":"IC_kwDOEujx186onQFf","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Hey @Inviz!\n\nCan you please provide more details on your specific use case? What information you would like to channel out of workflows? From where would you want to consume that information? Would these be security sensitive? How large? How often? Why exactly do you want to avoid workflow activations? etc.\n\nThere may already be appropriate methods to expose the information you need, without the need for new features. Depending on your use case, you may want to look for Memo, Search Attributes, User Data, Local Activity, Updates, and more. With some details, I can guide you in the right direction. Or if there's a need for something that really can't be done today, let's clarify what that is.\n\nAs for Markers — I think the name might be a bit deceptive — they are a low level primitive meant to support the construction of higher level features by the SDKs themselves, without requiring server side logic. Despite their apparent simplicity, Markers really involve complex replay logic, that is _distinct for every single type of marker_. This is particularly true in the case of Core-based SDKs, as the state machines that handle \"workflow task to activation\" conversion and \"command-to-history reconciliation\" are internal to the Core SDK. That means that from the lang SDK's perspective (i.e. in Workflow Activations), there are \"patch\" and \"local activities\" commands/events, but there are no \"markers\".\n\nIn short though we're likely to introduce new features in the future based on Markers, Markers themselves are not meant for direct usage, and a general \"Record a Marker\" API is simply not on the road map.","createdAt":"2025-04-24T21:07:30Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1695#issuecomment-2828861791","viewerDidAuthor":false},{"id":"IC_kwDOEujx186ooZti","author":{"login":"Inviz"},"authorAssociation":"NONE","body":"My use case is unorthodox. Please dont freak out :)\n\nI am building a framework that combines databases and temporal tightly. I'm using temporal as a way to create lifecycle scripts for \"rows\" in database. So that creating new row in table creates a lifecycle workflow, and then workflow advancements updates that table in return. I'm making some sort of a framework, where temporal acts as a flexible \"scenario\". Something akin to SQL triggers, but async and on steroids. \n\n i'm lisetning to temporal events as they arrive into the database, and immedaitely interpreting them to side-channel the information to other table(s). This is done inside trigger over `history_node` table.\n\nSo i.e. i'm turning state of the workflow, its input and output, and some other things into well presented db table. So that i can work with that able outside of temporal and use it as a source of truth for outside system, as it essentially works within same PG transaction as temporal itself. I use it in place of visibility api. So it allows workflows (and other parts of the system) to query each other's state without delay.  This way workflows able to do introspection via activity for low-stakes scenarios (what are my running children, and what are they doing)\n\nSo far so good, however i also want workflows to be able to also make their intermediate state (essentially local varibles) to be visible to outside. Because i'm lisetning to event log, i need an event that can store that state, that i can later interprete or side channel.  I could use signalling, but that causes workflow activations needlessly.  Marker seems ideal, as it is a part of event history,  subject to replay, ignored by the system, doesnt make visibility api heavier. \n\nReason to avoid activations is - i dont want for state to become visible to outside world ASAP. I dont want to replay workflow without a great reason.\n\nThank you for good list of questions:\n\n> What information you would like to channel out of workflows? \n\nEssentially, local variables and stats sets currently. But i'm looking for a cheap mechanism to do even more. This state needs to be visible progressively, during execution of long workflows. \n\n> From where would you want to consume that information? \n\nDirectly in SQL trigger that works event log, later from dedicated tables (i.e. `workflows { type, id, output, input, locals }`) \n\n> Would these be security sensitive? \n\nGreat question - i'd think they could be encoded with the same codec mechanism. But right now i'm not using codecs, which allows me to keep everything inside SQL \n\n> How large? \n\nLocal variables: 0-10kb total, essentially i want local variables to be turned into SQL table columns\nStats: 0-100kb, these are some KPI metrics that are computed during workflow runtime, which i want to be able to surface immediately as they are computed before workflow is complete. \n\n> How often? \n\nOn every activation if it changes any local state\n\n> Why exactly do you want to avoid workflow activations? etc.\n\nBecause i want workflow to be able to log things into event log, without causing round-trip re-evaluation of code. I dont want replay to happen, and i dont want workflow to make itself slower.\n\nWhy current mechanisms dont do it for me:\n\n> Memo\n\nMemo seems to be very close to what i want, but it's seen in visibility api and such. Maybe that's alright. I initially discounted it, before your suggestion. But after i tried, it seems that it matches the closest what I wanted to do. The downsides is: Merging is shallow, so either i take over whole memo with my properties as fields (which is acceptable), or if i use like `memo.state` proeprty, i'd need to overwrite it each time. \n\nSo far this is what i decided to go with. Thank you.\n\n> Search Attributes\n\nI dont need visibility api to see it, and i dont want to make indexing/filtering slower because of large amount of data\n\n> User Data\n\nYou mean inputs? It needs to be work with long living workflows. \n\n> Local Activity\n\nThis can work, actually, but it still goes through queueing and has needless roundtrips between workflow and worker.\n\n> Updates\n\nUpdates are quite heavy mechanism, do a lot of work (your docs about it say it all).\n\n> and more\n\n Signal is simplier, but also causes activation of workflow. Not sure what are other options.\n\n> As for Markers — I think the name might be a bit deceptive — they are a low level primitive meant to support the construction of higher level features by the SDKs themselves, without requiring server side logic. \n\nI think that's about what i want to do too. Create new sdk feature, without requiring server side logic.\n\n> Despite their apparent simplicity, Markers really involve complex replay logic, that is distinct for every single type of marker. This is particularly true in the case of Core-based SDKs, as the state machines that handle \"workflow task to activation\" conversion and \"command-to-history reconciliation\" are internal to the Core SDK. \n\nI did notice it has a hodge-podge of attributes and use cases. A bit of escape hatch. However as long as i can correlated it to some workflow (via tree_id being run_id), and i can name it (via markerName), and have data payload - i'm good\n\n> In short though we're likely to introduce new features in the future based on Markers\n\nSure, i dont insist on marker being the thing. I just thought it'd make it easy to expose it. It could be `recordEvent(type, data)` feature that uses marker. But that would probably not happen too quickly. You guys have a huge surface area of apis and languages, i understand the hesitation of changing or adding things.\n\n\nSo far I tried to use pushCommand feature of activator (wich i can read on globalThis.__TEMPORAL_ACTIVATOR__) to record marker myself. The issue there was that it has some stricter validation for markers, was getting \"at least one command has empty variant\" error).\n\n### Summary\n\nSo thanks to your suggestion, i'll go with upsertMemo. I'll structure my memo data so that i export my local variables on top level of the object, so i can update just one instead of whole object.","createdAt":"2025-04-25T01:11:23Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1695#issuecomment-2829163362","viewerDidAuthor":false}],"createdAt":"2025-04-24T11:37:53Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1695,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Ability to record markers from workflow","updatedAt":"2025-04-29T17:49:13Z","url":"https://github.com/temporalio/sdk-typescript/issues/1695"}
