{"assignees":[],"author":{"id":"MDQ6VXNlcjE0MDMyNzE=","is_bot":false,"login":"pauldraper","name":"Paul Draper"},"body":"### Is your feature request related to a problem? Please describe.\n\nTemporal workers are incredibly heavy.\n\n```sh\nyarn init\nyarn add @temporalio/worker\ndu -Ahs node_modules\n```\n\n```txt\n169M    node_modules\n```\n\nA simple \"Hello world\" worker is over 100 MiB. *Excluding* the Node.js runtime.\n\n### Describe the solution you'd like\n\nIt appears that Temporal worker pulls in developer tooling: webpack, swc, webassemblyjs, etc.\n\nI generate the workflow file at build time. (As a general rule, I run all of my build tools at -- well -- build time. I recommend it.)\n\nIf Temporal wants to do it in production, I guess that's convenient for someone. But put in `@temporalio/worker-build` or `@temporalio/worker-dev` or something.\n\n### Additional context\n\n\\-","closedAt":"2025-01-28T19:48:54Z","comments":[{"id":"IC_kwDOEujx186cIWvK","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"I agree, this is a problem for some target environments. That has been on my personal wish list for a very long time.\n\nUnfortunately, fixing this at this point won't be easy. A large portion of our users rely on the \"bundle workflows at runtime\" ability in their production setup. Moving build tools to a different package would be breaking for those users. Same for marking Webpack and other build dependencies as optional (unfortunately, NPM doesn't allow users to be selective in which optional deps should be installed; you either install all of them or none).\n\nA possible way to get there would be to not only move build dependencies out of `worker`, but to _completely_ split that package in two, let's say `bundler` and `worker-core`, and reexport everything exposed by those two packages from the legacy `worker` package. Then, users like you who want to avoid build dependencies would depend on the `worker-core` package, rather than `worker`.\n\nNow, that's totally feasible, but still has some painful consequences, especially in regard to other ongoing development efforts (pretty much all outstanding PRs and WIP on feature branches would get broken by this change, requiring non-trivial manual work to conciliate changes). That's obviously not a complete blocker, but simply means that we should try to complete and merge as much ongoing work as we can before investing effort in splitting `worker`.\n\nIn the mean time, I think you should be able to have `yarn` ignore the offending dependencies by perusing [the `resolutions` property](https://classic.yarnpkg.com/en/docs/package-json#toc-resolutions) in your `package.json` file. That is, make those dependencies to a very simple stub package that you define locally. I never did that with Yarn classic, but I remember doing that with PNPM a very long time ago.","createdAt":"2025-01-28T16:07:54Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1613#issuecomment-2619435978","viewerDidAuthor":false},{"id":"IC_kwDOEujx186cKNQI","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Closing as duplicate of #933.","createdAt":"2025-01-28T19:49:15Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1613#issuecomment-2619921416","viewerDidAuthor":false}],"createdAt":"2025-01-25T22:20:50Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1613,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"state":"CLOSED","title":"[Feature Request] Split worker build tool dependencies into a separate package","updatedAt":"2025-01-28T19:49:32Z","url":"https://github.com/temporalio/sdk-typescript/issues/1613"}
