{"assignees":[],"author":{"id":"MDQ6VXNlcjY0MTIxNjk=","is_bot":false,"login":"mjameswh","name":"James Watkins-Harvey"},"body":"### Describe the bug\r\n\r\nWe have a workflow that depends on some interfaces/enums/basic utility functions in another module, which in turn depends on some \"heavyweight\" external package. That external package could actually be any package that depends on node's internal packages (such as filesystem, dns, buffer, url...), or any package that contains native code. When the workflow code gets bundled (either implicitly in `Worker.create(...)` or explicitly by calling `bundleWorkflowCode(...)`), **Webpack is sometime unable to determine that the external package is not actually required at runtime, and will therefore try to load it, causing a build failure.**\r\n\r\nThe error message looks something like the following (truncated to keep it readable; I actually get 46 errors). Note that in this case, the \"external\" package is `got` (an HTTP client, similar to `request`) and problematic dependencies are `process`, `util`, `url`, `dns` and others, which are all packages provided internally by node.\r\n\r\n```\r\n[ERROR] modules with errors 390 bytes [errors]\r\n[ERROR]   node:process 39 bytes [built] [code generated] [1 error]\r\n[ERROR]   node:util 39 bytes [built] [code generated] [1 error]\r\n[ERROR]   node:url 39 bytes [built] [code generated] [1 error]\r\n[ERROR]   + 7 modules\r\n        ...\r\n[ERROR] ERROR in ./node_modules/cacheable-lookup/source/index.js 10:4-18\r\n[ERROR] Module not found: Error: Can't resolve 'dns' in '/Users/jwatkins/Development/temporal/bug-heavyweight-dependency-bundling/node_modules/cacheable-lookup/source'\r\n[ERROR] resolve 'dns' in '/Users/jwatkins/Development/temporal/bug-heavyweight-dependency-bundling/node_modules/cacheable-lookup/source'\r\n        ...\r\n[ERROR]   Parsed request is a module\r\n[ERROR]   using description file: /Users/jwatkins/Development/temporal/bug-heavyweight-dependency-bundling/node_modules/cacheable-lookup/package.json (relative path: ./source)\r\n        ...\r\n[ERROR]  @ ./node_modules/got/dist/source/core/options.js 10:0-47 28:25-40\r\n[ERROR]  @ ./node_modules/got/dist/source/index.js 2:0-40 4:17-24 11:0-55 11:0-55 12:0-34 12:0-34\r\n[ERROR]  @ ./src/api/client.ts 7:30-44\r\n[ERROR]  @ ./src/api/index.ts 17:13-32\r\n[ERROR]  @ ./src/temporal/myWorkflow.ts 4:16-39\r\n[ERROR]  @ ./src/temporal/myWorkflow-entrypoint-caf2c449-bc91-46c7-9b6b-dc05043a9065.js\r\n```\r\n\r\n### Minimal Reproduction\r\n\r\nSee https://github.com/mjameswh/temporalio-sdk-typescript-issue-heavyweight-dependency-bundling for a workspace that demonstrate this issue.\r\n\r\nNote that, in this specific case, the issue can easily be worked around by simply importing from `../api/models` instead of `../api/index` (in myWorkflow.ts). However, our actual use case spans multiple projects in a monorepo structure, and we have not yet found any simple, practical solution to this issue.\r\n\r\n### Environment/Versions\r\n\r\n- Temporal typescript-sdk version: 0.19.0-rc.1\r\n\r\n### Solutions to be considered\r\n\r\n- **Add [`target: 'node'`](https://webpack.js.org/configuration/target/) to bundleWorkflowCode's [webpack config](https://github.com/temporalio/sdk-typescript/blob/82351ccc69a5d3876e5b44d4860c20ec71cfca28/packages/worker/src/workflow/bundler.ts#L117).** Without this option, Webpack will simply not allow importing node's internal packages. In fact, by default, Webpack assume that you are bundling for a browser environment, which could cause some weird issues at some point in the future. Still, given that most of node's internal packages are unusable in isolated vm context, it is not clear if allowing these imports would actually help or just push issues a little bit father. It also does not resolve similar issues caused by packages that contains native code.\r\n\r\n- **Allow users to specify a list of dependencies to be ignored.** For example, an optional property `ignoreModules` could be added to [`BundleOptions`](https://github.com/temporalio/sdk-typescript/blob/82351ccc69a5d3876e5b44d4860c20ec71cfca28/packages/worker/src/workflow/bundler.ts#L189). That list would be used to dynamically add values to Webpack's `resolve.alias` or `resolve.fallback` (ie. `{ \"got\": false }`). That would solve this specific issue and would be relatively easy to understand for most developers facing similar issues.\r\n\r\n- **Allow users to apply more generic overrides to the Webpack config.** For example, an optional property `webpackConfigOverrides` could be added to `BundleOptions`. If it is there, that property would be merged with the default/calculated Webpack configuration. Alternatively, it could be an override function, which receive the default/calculated Webpack configuration, and returns the modified configuration (this is much more flexible, and easier from our point of view, more harder to work with for developers). This is for example [how Gatsby works](https://www.gatsbyjs.com/docs/how-to/custom-configuration/add-custom-webpack-config/). This approach would not only solve the current issue, but also provide a way to deal with many other very custom needs that developers may have (think of.. _Hey guys! We would like to use [`define`](https://webpack.js.org/plugins/define-plugin/) for our workflows_ ðŸ˜„ ) However, this would be more complex for developers to use, and arguably, there are not that many things that can be customized in Temporal's Webpack build process without risking breaking things.","closedAt":"2022-08-16T13:58:51Z","comments":[{"id":"IC_kwDOEujx184_QmRu","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"Thanks for the detailed summary @mjameswh.\r\n\r\nHave you tried any of the workarounds you've suggested successfully?\r\nSeems like, as you're suggesting, `resolve.alias` and `resolve.fallback` would address this issue.\r\n\r\nUp until now we've purposefully hidden any advanced webpack options because we consider webpack to be an implementation detail, for example, I know some user on our slack channel replaced webpack with esbuild and got dramatically faster builds.\r\nI do understand that there are some advanced users that would like the extra power so we'd have to discuss how best to exposed this functionality.","createdAt":"2022-03-08T01:34:49Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1061315694","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_Qtr2","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Haven't started implementing any of this yet, though I have done something very similar to my second proposition on another project.\r\n\r\nI'm highly confident that both propositions 2 and 3 can solve the issue we have right now. I just wanted to see first which (if any) would make sense to your team. I agree that this is somewhat lower level matters and I know that you want to avoid exposing developers to implementation details. That's exactly why I'm hesitating. But I also think that this issue will hurt more and more people as the typescript SDK get used in larger and larger projects, and that, in the end, developers might be exposed to even more complicated issues if there is no practical solution to this. \r\n\r\nArguably, the `ignoreModules` approach would not be that much of an implementation detail... I think the very same option could also work in a esbuild bundling process (either using `--external` or an `onLoad` plugin). On a side note, I have to admit that I would be very interested in an esbuild bundler; our application have quite a few workflows already, and were planing to have many times more. I expect that bundling workflows could represent a significant time by the end of the project. I may give it a shot later on, but can't do this right now.\r\n\r\nIf that's good for you, I'll try to have something along the line of proposition number 2 tomorrow.","createdAt":"2022-03-08T02:37:07Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1061346038","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_Qt4P","author":{"login":"swyxio"},"authorAssociation":"CONTRIBUTOR","body":"and you probably already saw this but just in case you havent, you can bundle code yourself and just specify `workflowBundle`: https://docs.temporal.io/docs/typescript/production-deploy#pre-build-code\r\n\r\nshould serve as a temporary fix while we try to figure out a better solution to our default bundling.","createdAt":"2022-03-08T02:39:05Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1061346831","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_QuOp","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"@sw-yx Yes I know. But using `bundleWorkflowCode(...)` won't help since the webpack's config is an internal detail of `WorkflowCodeBundler`. One alternative would be make a custom bundler (eg. a copy of the original bundler, with private modifications), but then, shouldn't I share my contribution with others? ðŸ˜‰ \r\n\r\nActually, I was going to say to that I would add customization options only on the `bundleWorkflowCode()`/`BundleOptions` interface... That is, I think the `Worker.create(...)` function should _not_ include such feature, so most users would not even be exposed to this.","createdAt":"2022-03-08T02:42:25Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1061348265","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_Q0f0","author":{"login":"lorensr"},"authorAssociation":"CONTRIBUTOR","body":"Thanks James, I really appreciate the clarity and thoroughness of your issues & PRs ðŸ˜ŠðŸ™\r\n\r\nPersonally in favor of the bundler-agnostic `ignoreModules`, although would like something more automatic / better DX, like ignoring all built-in Node modules by default. Issue with that is I'm not sure how to make clear what's happening when errors are thrown from the ignored modules actually being used (like `dns.resolve()` being run)? I guess we could replace `dns` with a file that had all the same exports but threw an informative error. But that only covers functions. Wonder if default-exporting a Proxy that errored on access to all properties would work? ðŸ˜„\r\n\r\nIf we can't make that clear, then I think it would be nice if, instead of or in addition to this being logged:\r\n\r\n`Module not found: Error: Can't resolve 'dns' in`\r\n\r\n, we logged: \r\n\r\n```\r\nYour Workflow code (or a library used by your Workflow code) is importing `dns`, a built-in Node module. Workflow code don't have access to built-in Node modules (in order to help enforce determinism). If your code just imports `dns` and doesn't use what it imports, you can add it to `BundleOptions.ignoreModules`. If your code uses what it imports, then you need to change the code or remove the library.\r\n\r\nhttps://typescript.temporal.io/api/namespaces/worker/#bundleworkflowcode\r\n```\r\n\r\n>  I have to admit that I would be very interested in an esbuild bundler\r\n\r\nYay ðŸ˜ƒðŸ’ƒ","createdAt":"2022-03-08T03:40:39Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1061373940","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_Q14B","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"> I guess we could replace `dns` with a file that had all the same exports but threw an informative error. But that only covers functions. Wonder if default-exporting a Proxy that errored on access to all properties would work? ðŸ˜„\r\n\r\nWell... I don't think it would be that hard... Technically, we could add a stub module in modules-overrides that does exactly that, and then alias every node-internal packages to the path of that module. But I doubt this would really give the usability we're hopping for.\r\n\r\n```\r\nYour Workflow code (or a library used by your Workflow code) is importing `dns`, a built-in Node module. Workflow code don't have access to built-in Node modules (in order to help enforce determinism). If your code just imports `dns` and doesn't use what it imports, you can add it to `BundleOptions.ignoreModules`. If your code uses what it imports, then you need to change the code or remove the library.\r\n\r\nhttps://typescript.temporal.io/api/namespaces/worker/#bundleworkflowcode\r\n```\r\n\r\nNow, that sounds like a great idea... IIRC, `resolve.fallback` can be a function, which is called with the name of the module being requested... I'll give it a try.\r\n\r\nStill, let's not forget that it won't help with dependencies that contains native code...","createdAt":"2022-03-08T03:56:06Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1061379585","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_Sv07","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"After some research, I don't think it is desirable to ignore all Node built-in modules by default.\r\n\r\nA few modules pose actually no issue at all (`util`, `punycode`, `path/posix`, `path/win32`, `buffer`...), or are very unlikely to pose actual issue in real life (`path` would pose an issue only if replaying a workflow on a different platform). For many others modules, only some functions are problematic, while other functions of the same package are not problematic AND could be arguably useful in workflows for some use cases; eg. `crypto` is likely to be non-deterministic when cyphering data (which might implies using a secure RNG), but should be deterministic in most other situations (including deciphering and validating hashes...)\r\n\r\nI think we should allow node built-in modules, but report a warning indicating the list of found modules dependencies that are known to be potential issues. More over, that list could grow over time to include known popular external libraries that also pose issues (eg. native code) and/or that are probable marker of issues in how the workflow is designed (eg. `@temporalio/client`, `mysql`, `aws-sdk`, `axios`...).","createdAt":"2022-03-08T15:09:10Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1061879099","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_U_H5","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"We will not allow node built-ins because we eventually want to support running untrusted workflow code.\r\nThat being said, we can allow injection of some of these node built-ins for users that don't want that feature.\r\n\r\nThere's more thought to be put in here though.","createdAt":"2022-03-09T01:37:51Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1062466041","viewerDidAuthor":false},{"id":"IC_kwDOEujx184_VWZ6","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"> We will not allow node built-ins because we eventually want to support running untrusted workflow code.\r\n\r\nI totally agree.\r\n\r\nActually, forget about my previous comment, it was based on an incorrect understanding of my part.... I originally thought that `require` and node built-ins were accessible inside isolated environments, and that only a Webpack misconfiguration was preventing it from working. So my earlier argument was essentially that Webpack should not add _artificial_ restrictions, as this reduced usability without improving security and determinism (eg. one could do `eval('require(...)')` inside a workflow to work around a Webpack-level restriction). I backtracked on my previous opinion once I realized I had this fact wrong.\r\n \r\n>That being said, we can allow injection of some of these node built-ins for users that don't want that feature.\r\n>\r\n>There's more thought to be put in here though.\r\n\r\nI think there is a potential need here, but that's more hypothetical at this point. I can imagine that, at some point, one may report something like: \"Can't bundle my workflow because it _legitimately_ needs access to the `foo` module\". Think for example custom data converter that provides data encryption, using the `crypto` built-in module (haven't checked that, but I assume that custom data converters are loaded inside the workflows isolated environment...).\r\n\r\nStill, there are very few node built-in modules that are likely to be used in such scenarios. `assert` is one of them, and it has already been handled using a stub module  [`assert` module](https://github.com/temporalio/sdk-typescript/blob/82351ccc69a5d3876e5b44d4860c20ec71cfca28/packages/worker/src/workflow/module-overrides/assert.ts). That seems like the way to go for such cases.\r\n\r\nBut that would be distinct issues...","createdAt":"2022-03-09T05:13:07Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1062561402","viewerDidAuthor":false},{"id":"IC_kwDOEujx185BZv_Y","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"> I think there is a potential need here, but that's more hypothetical at this point. I can imagine that, at some point, one may report something like: \"Can't bundle my workflow because it legitimately needs access to the foo module\". Think for example custom data converter that provides data encryption, using the crypto built-in module (haven't checked that, but I assume that custom data converters are loaded inside the workflows isolated environment...).\r\n\r\nSo far I haven't seen a legitimate request to access node built-ins, we can offer that if needed.\r\nAs for custom data converters, encryption and compression should be done in `PayloadCodec`s which are run outside of the sandbox.","createdAt":"2022-04-12T21:59:50Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/516#issuecomment-1097269208","viewerDidAuthor":false}],"createdAt":"2022-03-08T01:10:56Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDA2","name":"bug","description":"Something isn't working","color":"d73a4a"}],"milestone":null,"number":516,"reactionGroups":[],"state":"CLOSED","title":"[Bug] bundleWorkflowCode fails on \"heavyweight\" dependencies","updatedAt":"2022-08-16T13:58:51Z","url":"https://github.com/temporalio/sdk-typescript/issues/516"}
