{"assignees":[],"author":{"id":"MDQ6VXNlcjE5NDgwMzky","is_bot":false,"login":"marc-wilson","name":"Marc"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nWe use an nx monorepo for our code base and we are trying to create our first workflows. Since most of our libraries/packages are written in Nestjs, we want our workers to be nestjs so that we can leverage them without having to re-write a bunch of dependencies.\r\n\r\nHowever, since NestJs uses webpack by default, you end up with a single main.js file after build and your `workflowsPath` won't resolve.\r\n\r\n### Describe the solution you'd like\r\n\r\nInstead of providing a file path where your workflows exist, we should be able to use native imports and register our workflows that way. Much like we do with activities.\r\n\r\nie:\r\n```\r\nimport * as activities from './app/activities';\r\nconst worker = await Worker.create({\r\n    connection,\r\n    namespace: 'default',\r\n    taskQueue: 'hello-world',\r\n    // Workflows are registered using a path as they run in a separate JS context.\r\n    workflowsPath: require.resolve('./app/workflows'),\r\n    activities, // <-- from the imports\r\n  });\r\n```\r\n\r\nThe ideal solution would be something like this:\r\n```\r\nimport * as activities from './app/activities';\r\nimport * as workflows from './app/workflows';\r\nconst worker = await Worker.create({\r\n    connection,\r\n    namespace: 'default',\r\n    taskQueue: 'hello-world',\r\n    workflows,\r\n    activities,\r\n  });\r\n```\r\n\r\n### Additional context\r\n\r\nIt seems many others have hit this and all of the workarounds are pretty unfavorable as it comes down to getting off webpack (which comes with other issues) or hacking webpack with hard-coded outputs and entry points.\r\n\r\nAccording to the temporal docs, there is another applicable property called workflowBundleConfig but it's not clear how it's used.\r\n\r\nI am sure this question has been asked multiple times since there are plenty of hits in temporal community threads. However, there isn't any great solution out there. Obviously, there's a finger-pointing game to play since a valid question may be, \"why are you using webpack for backend code?\" Well, the answer is we don't have much of a choice with NX and Nest. If you remove NX/Nest from the equation, webpack goes with it and problem is solved. But, we are left with a bunch of work to re-write packages.\r\n\r\nBefore throwing in the towel on NX/Nest, I would like to understand why things are setup like this instead of following the same pattern as the activities import.\r\n\r\nIf there is a non-hacky example of NX and Temporal being used to together that supposrts importing dependencies and the usage of decorators, I would love to see it. The ones that are currently out there leverage a hacked-together esbuild or some other heavy-config based implementation.\r\n","closedAt":"2024-11-06T00:19:32Z","comments":[{"id":"IC_kwDOEujx186PANcY","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"That's indeed a recurring question. Believe me, we would definitely prefer passing Workflow functions or objects directly to the Worker; that would be much easier for everyone, including us.\r\n\r\nBut that's simply not possible.\r\n\r\nWhy? The short answer is already in your code snippet: \"Workflows are registered using a path as they run in a separate JS context\". That \"separate JS context\" is [a Node.js VM](https://nodejs.org/docs/latest/api/vm.html#vm-executing-javascript), itself running in a [Node.js Worker Thread](https://nodejs.org/docs/latest/api/worker_threads.html#worker-threads).\r\n\r\nBoth of these layers (VM and Worker Thread) have their own requirements that point toward the necessity of having a distinct Workflow Bundle.\r\n\r\n- Communication between the main Node.js thread and Worker Threads go through the [V8 Serialization protocol](https://nodejs.org/docs/latest/api/v8.html#serialization-api), which doesn't support serialization of functions. That means that it would not be possible to pass \"Workflow Functions\" from the main thread to the Workflow Worker Thread. In fact, if you look at [Node's Worker Thread API](https://nodejs.org/docs/latest/api/worker_threads.html#new-workerfilename-options), you can see that starting a new Worker Thread actually requires pointing at a _file name_! No live object.\r\n\r\n- We use Node's VM API as part of our Workflow sandboxing mechanism. For that mechanism to actually provide \"isolation\" between Workflows, we need each Workflow VM to get initialized with its own private copy of user-defined modules (i.e. your Workflow source code and files that are imported from there).\r\n\r\nBut then… Why do we even need these two isolation layers? Because Workflow code needs to be deterministic. Among other things, the Sandbox allows us to mock various global functions to ensure that they behave deterministically (e.g. Date.now(), Math.random(), setTimeout()), and to control execution order of microtasks (Promise and await). These are intrusive changes to the JS execution environment, which would be unsafe to do on the main Node.js thread.\r\n\r\nActivities don't need to go through that type of bundling because they don't have determinism requirement.\r\n\r\n> Note that I'm intentionally cutting down on details here. There would be much more to say, but time simply doesn't permit.","createdAt":"2024-10-08T08:29:11Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":2}}],"url":"https://github.com/temporalio/sdk-typescript/issues/1540#issuecomment-2399196952","viewerDidAuthor":false},{"id":"IC_kwDOEujx186SiRDQ","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Closing because can't fix.","createdAt":"2024-11-06T00:19:32Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1540#issuecomment-2458456272","viewerDidAuthor":false}],"createdAt":"2024-10-08T00:10:33Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1540,"reactionGroups":[],"state":"CLOSED","title":"Remove workflowsPath in favor or imports (like activities)","updatedAt":"2024-11-06T00:19:32Z","url":"https://github.com/temporalio/sdk-typescript/issues/1540"}
