{"assignees":[],"author":{"id":"MDQ6VXNlcjE0Mzc0NA==","is_bot":false,"login":"milesj","name":"Miles Johnson"},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\n<!-- A clear and concise description of what the problem is. Ex. I'm always frustrated when [...] -->\r\n\r\nWe're profiling our TS monorepo and the `@temporalio` packages have popped up as a hot path. I've noticed a few issues that can probably be optimized:\r\n\r\n1. Importing the `@temporalio/client` package takes 1 second. In the flame chart below, you'll notice that our `temporalclient.ts` file, which imports `@temporalio/client` takes most of the compilation time.\r\n\r\n<img width=\"1490\" alt=\"Screenshot 2024-07-30 at 3 05 25 PM\" src=\"https://github.com/user-attachments/assets/9156eeb9-6525-4068-b2b6-c280a0d19455\">\r\n\r\nThis can _maybe_ be optimized by removing barrel imports (giant index exports), and moving things into deep path imports. Additionally, this may be caused by #2. \r\n\r\n2. The `@temporario/proto` TS declaration file is 49k lines long and is 2.67 MB in size. The generated file at `@temporalio/proto/protos/root.d.ts` is massive and is most likely consuming most of the parsing/checking time.\r\n\r\nThis can _maybe_ be optimized by splitting `root.d.ts` into multiple files so they can be checked in parallel. Probably split into `coresdk.d.ts`, `temporal.d.ts`, `google.d.ts`, `grpc.d.ts`, etc.\r\n\r\n### Describe the solution you'd like\r\n\r\n<!-- A clear and concise description of what you want to happen. SCREENSHOTS OR CODE SAMPLES ARE VERY HELPFUL -->\r\n\r\n\r\nImproved TS compiler speeds. I listed some possible solutions above.\r\n\r\n### Additional context\r\n\r\n<!-- Add any other context or screenshots about the feature request here. -->\r\n\r\nThis is using project references and was tested simply using `tsc --build`.\r\n","closedAt":"2025-02-07T16:03:10Z","comments":[{"id":"IC_kwDOEujx186HSESn","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"> Importing the @temporalio/client package takes 1 second. In the flame chart below, you'll notice that our temporalclient.ts file, which imports @temporalio/client takes most of the compilation time.\r\n\r\nThis is not how I read your flame chart. Locating, reading and parsing source files to memory appears to be taking ~250ms. That's for all sources files used by that TS project, including loading the `@temporalio/client` and `@types/node` modules, and many more. You see these in your flame chart as the pink `findSourceFile`, green `createSourceFile` bars (and more).\r\n\r\nThe `checkSourceFile` step, which is taking 1.1 seconds in your flame graph, is for type checking of a _single_ source file (i.e. your `temporalclient.ts` file); `checkSourceFile` is not recursive. That's indeed huge, especially given that this time corresponds to essentially two expressions.\r\n\r\nIf you look the details on these `checkExpression`, you should see the exact location of those expressions in your source file. What exactly are you doing there? My intuition is that you might be passing `Client` or `Connection` objects across subpackages of your mono repo, which are compiled against different copies of `@temporalio/*` packages. That forces TSC to assert that both type definitions are compatible, which can indeed be very long on complex types.\r\n\r\nAlso make sure you are using a recent version of TSC. They have been working hard recently on build-time performance.\r\n\r\n> The @temporario/proto TS declaration file is 49k lines long and is 2.67 MB in size. The generated file at @temporalio/proto/protos/root.d.ts is massive and is most likely consuming most of the parsing/checking time.\r\n>\r\n> This can maybe be optimized by splitting root.d.ts into multiple files so they can be checked in parallel. Probably split into coresdk.d.ts, temporal.d.ts, google.d.ts, grpc.d.ts, etc.\r\n\r\nOn my local machine, `findSourceFile` on `@temporalio/proto/protos/root.d.ts` takes 124ms. That's indeed larger than most other modules, but not unusually large. For comparision, `findSourceFile` on `@types/node/index.d.ts` gives me 94ms. And unless `skipLibCheck` is sets to `false` in tsconfig.json (it is generally recommended to leave it to its default value, which is `true`), those large imports should not incur any time for type checking.\r\n\r\nSplitting `root.d.ts` to multiple subfiles would therefore not make a significant difference (no more than a few tens of ms). TSC can't do parallel parsing/checking, and those namespaces depends on each others, so you'd end up loading most of them anyway. The only gain we may get would be from skipping the `coresdk` and `temporalio.test` namespaces, which are not used in the context of `@temporalio/client`, but these are rather small packages, and that gain might be offset by having to open and load more files.\r\n\r\nIf you still think this is an issue, would you mind providing more details on exactly how you measured this? And if possible, please include a sample repo so we know that we are measuring the same thing.","createdAt":"2024-08-05T18:29:36Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/sdk-typescript/issues/1481#issuecomment-2269660327","viewerDidAuthor":false}],"createdAt":"2024-07-30T22:13:56Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1481,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Reduce TS parsing/evaluation times","updatedAt":"2025-02-07T16:03:10Z","url":"https://github.com/temporalio/sdk-typescript/issues/1481"}
