{"assignees":[],"author":{"id":"MDQ6VXNlcjY0MTIxNjk=","is_bot":false,"login":"mjameswh","name":"James Watkins-Harvey"},"body":"### Describe the bug\n\nDue to the composed nature of the Update-with-Start API, the server reports errors from that API in an aggregated form, containing only a generic error message, `MultiOperation could not be executed`. The list of actual errors are attached as details to the aggregated error, using the `MultiOperationExecutionFailure` protobuf message type, which itself needs to be decoded to obtain actual underlying errors.\n\nThe Workflow Client already does some work to decode and extract a proper error message out of `MultiOperationExecutionFailure`. It then replace the grpc error's generic message by that more specific error message. We have tests that confirm that this behavior works properly.\n\nHowever, it appears that printing out the grpc error prints the original, generic message rather than the proper, detailed one.\n\nFor instance, printing out `error` gives:\n\n```\nError: 8 RESOURCE_EXHAUSTED: MultiOperation could not be executed.\n    at callErrorFromStatus\n    at Object.onReceiveStatus\n    // ...\n```\n\neven though `error.message` contains:\n\n```\nlimit on number of concurrent in-flight updates has been reached (10)\n```\n\nAs users generally don't print out `error.message` explicitly to their logs, a user is left without a clue of what actually went wrong. A better behavior would be for the error to print out with a composed message, such as:\n\n```\nError: 8 RESOURCE_EXHAUSTED Update-with-Start could not be executed: limit on number of concurrent in-flight updates has been reached (10)\n    at callErrorFromStatus\n    at Object.onReceiveStatus\n    // ...\n```","closedAt":null,"comments":[],"createdAt":"2025-06-03T15:56:11Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDA2","name":"bug","description":"Something isn't working","color":"d73a4a"}],"milestone":null,"number":1721,"reactionGroups":[],"state":"OPEN","title":"[Bug] Error thrown from Client's Update-with-Start doesn't show proper message","updatedAt":"2025-06-03T15:56:11Z","url":"https://github.com/temporalio/sdk-typescript/issues/1721"}
