{"assignees":[],"author":{"id":"U_kgDOBt8YMg","is_bot":false,"login":"jinvillaz","name":"Jhonatan Villanueva"},"body":"# Proposal: Sticky Sessions Support in TypeScript SDK\n\nHi Temporal team,\n\nFirst, thank you for all your work maintaining the Temporal SDKs — they’ve been incredibly helpful.\n\n## Context\n\nIn the Go SDK, Temporal supports **sticky sessions** (sticky execution), which ensures that all tasks of a workflow are executed on the same worker.  This is especially important for workflows that maintain **local state** or process resources incrementally, such as downloading and processing a large file piece by piece.\n\nCurrently, the TypeScript SDK **does not have this feature**. If multiple workers are running, Temporal may distribute tasks of the same workflow across different workers, breaking workflows that depend on local state.  \nEven in the official documentation, it is mentioned that sticky sessions are the recommended way to handle this type of workflow, but the feature is only implemented in Go.\n\n## Proposed Solution\n\nI have implemented a manual sticky execution mechanism in a NestJS project using the `nestjs-temporal-core` library and the TypeScript SDK.  \n\nThe key components are:\n\n1. **WorkerRegistrationService** – Registers workers, tracks workflow IDs, and manages worker availability.\n2. **HeartbeatService** – Sends periodic heartbeats, detects dead workers, and cleans up workflows that are no longer running.\n3. **WorkflowBalancerService** – Assigns workflows to available workers to ensure a workflow runs entirely on a single worker.\n\nThis approach currently runs in my own projects using a manual implementation in TypeScript, and it effectively ensures sticky execution for workflows that require it.  \n\nThis implementation introduces the concept of **worker capacity (`maxCapacity`)** to limit the number of workflows a worker can handle simultaneously.  In production environments, each worker runs on a host with finite CPU and memory. By tracking capacity manually, we ensure that workflows are only assigned\nto workers with available resources, preventing overloading and maintaining predictable performance.  \nThis complements sticky execution: even if all tasks of a workflow remain on a single worker, we still need to respect its capacity limits. My implementation checks if a workflow with the same `workflowId` is already running, \nwhether triggered manually or via a schedule, to prevent duplicate executions and ensure workflow consistency.\n\n\nI propose to implement **native sticky sessions in the TypeScript SDK**, using this approach as a reference, so that it becomes an official feature that other developers can use easily without needing to implement it themselves.\n\n## Benefits\n\n- Provides workflow consistency for workflows that rely on local state and makes sticky execution available as a native feature.\n- Eliminates the need for users to manually track workers and workflow assignments.\n- Brings the TypeScript SDK closer to feature parity with the Go SDK.\n- Ensures predictable performance by respecting worker capacity limits.\n\nI would love for this feature to be implemented, ideally based on the approach I have already implemented in my own project.  If possible, I would be happy to create a PR to contribute this solution to the SDK.\n\n\nThank you for considering this proposal! Looking forward to your thoughts.\n\nRegards\nJhonatan\njinvillaz@gmail.com\n","closedAt":"2025-12-01T19:32:07Z","comments":[{"id":"IC_kwDOEujx187WfNP-","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Thanks for offering your help on this. I greatly appreciate your thorough explanations of how you envision implementing this. I will, however, have to decline.\n\nAdding Sessions support to other SDKs is something our team has discussed many times. We do recognize the practical value of that mechanism. To some extent, it is possible to achieve almost the same behavior with the [Worker Specific Task Queue](https://github.com/temporalio/samples-typescript/tree/main/worker-specific-task-queues) pattern, but it is quite daring to properly implement by users. User-land implementations of this pattern also have limited ability for controlling execution concurrency at the worker level, though things have significantly improved in that regard with the recent addition of Custom Slot Providers and Poller Behaviors.\n\nSo yes, we do intend to add Sessions support at some point. And when we do, we'll add it to _all_ of our official SDKs, not only TypeScript. That will, however, be a complete redesign of the feature. The experience acquired over time from usage of the Go implementation of Sessions demonstrates that the current design can't actually offer the kind of DX and operational guarantees that Temporal users expect, notably when it come to error-handling scenarios. These shortcomings are deeply rooted into the original design of Go's Sessions, and can only be fixed by holistically rethinking the whole feature.\n\nFor the moment, we can't provide intel regarding the prioritization or ETA of that feature.\n\nBy the way, this feature request is already tracked under temporalio/features#562. I'll close this one as a duplicate to make it easier for tracking. I'll copy/paste your description to the other thread. You are welcome to discuss over there.","createdAt":"2025-12-01T19:31:07Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1811#issuecomment-3598504958","viewerDidAuthor":false}],"createdAt":"2025-10-28T04:37:17Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1811,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Sticky Sessions Support in TypeScript SDK","updatedAt":"2025-12-01T19:32:07Z","url":"https://github.com/temporalio/sdk-typescript/issues/1811"}
