{"assignees":[],"author":{"id":"MDQ6VXNlcjQyNjY0NDc2","is_bot":false,"login":"alex766","name":""},"body":"**Is your feature request related to a problem? Please describe.**\r\nTo ensure determinism in workflows on code changes, I am creating a test that uses `runReplayHistory` by grabbing the 3 oldest running workflow IDs of each workflow type and replaying them. However, this requires replaying around 30 workflows, and I noticed that registering and initializing the worker takes up the majority of the time. I have tried workflow bundling, and this does reduce some of the initialization time, but have run into errors known to Temporal developers that sometimes appear. \r\n\r\n**Describe the solution you'd like**\r\nIt would be useful to have a feature that allows you to kick off a replay that takes in a list of workflow IDs and replays all of them in parallel, and returns which, if any, fail.\r\n\r\n**Describe alternatives you've considered**\r\nI have tried parallelizing myself by kicking off each `runReplayHistory` in series, adding these promises to an array, and using `Promise.allSettled` at the end, but this doesn't provide much speedup, and my assumption is that Typescript and my computer are not running the register and initialize in parallel. \r\n","closedAt":"2022-10-19T02:47:14Z","comments":[{"id":"IC_kwDOEujx185LbJlz","author":{"login":"bergundy"},"authorAssociation":"MEMBER","body":"We’re adding support for this in sdk-core which will enable this work.","createdAt":"2022-10-03T13:04:05Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/775#issuecomment-1265408371","viewerDidAuthor":false}],"createdAt":"2022-07-25T22:50:38Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":775,"reactionGroups":[],"state":"CLOSED","title":"Allow for Batched Replays","updatedAt":"2022-10-19T02:47:14Z","url":"https://github.com/temporalio/sdk-typescript/issues/775"}
