{"assignees":[],"author":{"id":"MDQ6VXNlcjc5MjY1MTc5","is_bot":false,"login":"NavaraKoen","name":""},"body":"### What are you really trying to do?\n\nRunning a unit test in either Jest / Mocha on a bad internet connection / not-so-nice proxy :)\n\n### Describe the bug\n\nWhen running a unit test for the first time, it seems that the (latest?) SDK is being downloaded in the background first. The default timeout of mocha / Jest is like 2000ms, which is way less than the 20s timeout that is set for the download itself.\nThere is no informational message about this download being started, which would be a great debug starter.\n\nIn some cases, the download gets corrupted because of the abrupt interrupt. If you increase the jest / mocha timeout to >20s, you'll be able to spot the following message:\n```\nFailed to start ephemeral server: Temp download file at /var/folders/3w/4_q0ch0n763141t1zb61z_z80000gn/T/temporal-sdk-typescript-1.11.7.downloading not complete after 20 seconds. Make sure another download isn't running for too long and delete the temp file.\n```\n\n### Minimal Reproduction\n\n- Pull the 102 project, for example: https://github.com/temporalio/edu-102-typescript-code\n- Remove the existing SDK if it already exists\n- `npm i` in any solution dir\n- Break your internet connection, or throttle it significantly\n- Run the test suite for the first time\n\nWithout any indication about a download going on - you'll receive a jest / mocha timeout after 2000ms, indicating that some test did not complete.\n\n### Environment/Versions\n\n- OS and processor: Mac M2\n- Temporal Version: 1.11.7, temporal cli version 1.2.0 (I guess not relevant here, but putting it down anyways)\n\n### Additional context\n\nMy suggestion is to trigger an informational message, but only when the download is required of course. Would have been an immense timesaver for our team, as we are behind a very unfriendly proxy that will block the download every now and then, causing all tests to fail for no apparent reason :)\n\nThanks in advance!\n","closedAt":null,"comments":[],"createdAt":"2025-05-01T15:19:23Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDA2","name":"bug","description":"Something isn't working","color":"d73a4a"}],"milestone":null,"number":1702,"reactionGroups":[],"state":"OPEN","title":"[Bug] Test suite timeout on first run","updatedAt":"2025-05-01T15:19:23Z","url":"https://github.com/temporalio/sdk-typescript/issues/1702"}
