{"assignees":[],"author":{"id":"MDQ6VXNlcjQyMTk1OTc0","is_bot":false,"login":"cliaer","name":"Claire Lee"},"body":"`WorkflowIdReusePolicy.TERMINATE_IF_RUNNING` is listed as a valid option in the [Temporal.io docs](https://docs.temporal.io/workflow-execution/workflowid-runid#workflow-id-reuse-policy), but [in-line code docs](https://github.com/temporalio/sdk-typescript/blob/9089bc682b4334287e52cd0bdb4547836f63e335/packages/common/src/workflow-options.ts#L38-L46) show that it is deprecated and recommends to use a combination of `WorkflowIdReusePolicy` and `WorkflowIdConflictPolicy`.\n\nI would like clarification on this discrepancy, and whether or not I can continue using the `TERMINATE_IF_RUNNING` ReusePolicy.\n\nMy intention is to use it for a child workflow whose parent workflow is reset (I would like the child to also stop upon reset and re-execute with the parent, and keep the same workflowIds). Similar discussion found in [this thread](https://github.com/temporalio/sdk-typescript/issues/1628#issuecomment-2672959241), where it is clarified that the server does not support conflict policies for child workflows.\n\nCurrently, it looks like the only way I can configure this behaviour is with `WorkflowIdReusePolicy.TERMINATE_IF_RUNNING`. Do I have any other options when it comes to child workflows?\n\n(moved from the [temporalio/temporal repo](https://github.com/temporalio/temporal/issues/8314))","closedAt":"2025-12-18T20:41:05Z","comments":[{"id":"IC_kwDOEujx187a4Gpw","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Thanks for pointing out this discrepancy.\n\n`WorkflowIdReusePolicy.TERMINATE_IF_RUNNING` is indeed deprecated, even though some references to it still haven't been updated. We [just fixed](https://github.com/temporalio/api/pull/681) the upstream API to clarify this. Any doc or sample that still refers to that option will be pruned soon.\n\nNow, you're right that child workflows do not accept the conflict policy option. Even though that option has been deprecated, the server still accepts terminate as a reuse policy. I don't think you really have an alternative at this time, unfortunately, but I also don't think that the \"parent workflow reset\" use case provides a justification that is strong enough to revert the deprecation of the terminate WID reuse policy.\n\nIn any case, we have no intent of actually removing that option support in the server at any time. The deprecation of that API simply communicates the message that usage of this API is strongly discouraged, because a better alternative exists for normal use case. But in the rare use case for which there is no blessed, exact equivalent of the legacy API, using there is no risk in keeping your existing code as is.","createdAt":"2025-12-18T20:41:05Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1783#issuecomment-3672140400","viewerDidAuthor":false}],"createdAt":"2025-09-11T20:30:00Z","labels":[],"milestone":null,"number":1783,"reactionGroups":[],"state":"CLOSED","title":"`WorkflowIdReusePolicy.TERMINATE_IF_RUNNING` deprecated or not?","updatedAt":"2025-12-18T20:41:05Z","url":"https://github.com/temporalio/sdk-typescript/issues/1783"}
