{"assignees":[{"id":"MDQ6VXNlcjY0MTIxNjk=","login":"mjameswh","name":"James Watkins-Harvey","databaseId":0}],"author":{"id":"MDQ6VXNlcjY0MTIxNjk=","is_bot":false,"login":"mjameswh","name":"James Watkins-Harvey"},"body":"### Describe the bug\r\n\r\nA user reported the following sequence of events:\r\n\r\n- They have a TS Workflow Worker running normally;\r\n- At some point, they get the following ERROR-level log message: `{ code:\"ERR_WORKER_OUT_OF_MEMORY\" }`.\r\n- After that point, it appears that the Worker is no longer making any progress on pending Workflow Tasks, despite the fact that the Worker process is still running.\r\n- From the Server side, metrics indicate a considerable increase in calls to `PollWorkflowExecutionHistory` and a considerable reduction in calls to `PollWorkflowTaskQueue`. Provided data doesn't allow identifying the exact provenance of those calls (they normally operate ~12 active Workers on that NS).\r\n- The situation continues until the Worker process is restarted, after which Workflow progress resumes.\r\n\r\n### Analysis\r\n\r\n`ERR_WORKER_OUT_OF_MEMORY` is an error from Node itself. That means that Node terminated a Worker Thread due to running out of memory.\r\n\r\nGiven the symptoms, it is sensible to assume that the Worker Thread killed by Node would be the Workflow Worker Thread, which means the Temporal Worker will no longer be able to process incoming Workflow Task.\r\n\r\nWhat happens next is not clear, but the correct behavior would be for the Worker to initiate shutdown. There’s very little we can do at that point, but at least, let’s not pretend that everything’s all right. Should probably print a clear CRITICAL level message to the log, and terminate the process ASAP.","closedAt":"2024-10-17T16:58:13Z","comments":[],"createdAt":"2024-09-26T16:27:41Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDA2","name":"bug","description":"Something isn't working","color":"d73a4a"}],"milestone":null,"number":1536,"reactionGroups":[],"state":"CLOSED","title":"[Bug] Worker keeps accepting WFT after Worker Thread terminates due to ERR_WORKER_OUT_OF_MEMORY","updatedAt":"2024-10-17T16:58:13Z","url":"https://github.com/temporalio/sdk-typescript/issues/1536"}
