{"assignees":[],"author":{"id":"MDQ6VXNlcjMzNDY4MDg5","is_bot":false,"login":"vwkd","name":""},"body":"### Is your feature request related to a problem? Please describe.\r\n\r\nThe TypeScript SDK does a great job hiding the magic that's going on under the hood to let us write colocated code in a single language that runs in different execution contexts in different places. For example, Activities run in a normal environment while Workflows run in a custom deterministic environment, Workers run server-side while Clients run client-side.\r\n\r\nBut we still need to write a fair bit of glue code to hook up the different parts, like proxy functions and type annotations. Maybe the TypeScript SDK does a better job than the other SDKs, but it still would be nice to eliminate the remaining glue code.\r\n\r\nWith all the underlying magic that's already happening, the glue code shouldn't be technically necessary. Also, the glue code doesn't really help in explaining the underlying magic, which is much better fit for English documentation.\r\n\r\n### Describe the solution you'd like\r\n\r\n#### Workflows and Activities\r\n\r\nImport and call Workflows and Activities like regular functions instead of proxying them through glue code. The config could be passed as mandatory first argument at function call without specifying it at declaration. A bit like the `self` parameter at method declaration in Rust that's not passed at function call, but the other way around.\r\n\r\n```ts\r\n// workflows.ts\r\nimport { greet } from './activities';\r\n\r\nexport async function hello(name: string): Promise<string> {\r\n const greeting = await greet({\r\n    startToCloseTimeout: '1 minute'\r\n  }, name);\r\n\r\n  return greeting;\r\n}\r\n```\r\n\r\n```ts\r\n// client.ts\r\nimport { hello } from './workflows';\r\n\r\nconst result = await hello({\r\n  taskQueue: 'greetings-1',\r\n  workflowId: 'hello-1',\r\n}, 'Temporal');\r\n```\r\n\r\n#### Workers\r\n\r\nImport and pass Workflows as arguments instead of specifying a path like already done for Activities.\r\n\r\n```ts\r\n// worker.ts\r\nimport { Worker } from \"@temporalio/worker\";\r\nimport * as workflows from \"./workflows\";\r\nimport * as activities from \"./activities\";\r\n\r\nconst worker = await Worker.create({\r\n  identity: \"worker-1\",\r\n  taskQueue: \"greetings-1\",\r\n  workflows,\r\n  activities,\r\n});\r\n```\r\n\r\n### Additional context","closedAt":"2023-12-22T20:57:03Z","comments":[{"id":"IC_kwDOEujx185s-qqt","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Thanks for sharing your observations regarding how the developer experience of the Temporal TypeScript SDK could be improved. We recognize that some of the indirections required when making calls across different execution contexts may make your code feel a bit less natural.\r\n\r\nI disagree however with your claim that _\"with all the underlying magic that's already happening, the glue code shouldn't be technically necessary\"_. It might be possible to bring different forms of glue code, with different compromises, but given that we have to compose with how the language itself is designed, I honestly don't see how it would be possible to \"magically\" avoid any form of glue code.\r\n\r\nWould you mind provide more details on what you are suggesting, and how this would satisfy the following concerns?\r\n\r\n> Import and call Workflows and Activities like regular functions instead of proxying them through glue code. The config could be passed as mandatory first argument at function call without specifying it at declaration.\r\n\r\n- Your workflow/activity functions don't expect workflow/activity options as their first argument. How can `import` (i.e. the JavaScript/TypeScript construct) inserts these arguments into the signature of workflow/activity functions you import?\r\n\r\n- When calling a workflow/activity function, how does code execution get diverted to a Temporal action (i.e. starting a workflow or scheduling an activity), rather than simply calling the workflow/activity function directly?\r\n\r\n- How would this magic mechanism differentiate between importing a workflow/activity function (which needs to execute in a different execution context) and importing some utility functions (which needs to execute in the same execution context as the caller)?\r\n\r\n> Import and pass Workflows as arguments instead of specifying a path like already done for Activities\r\n\r\n- In TS SDK, Workflow code is delegated to a different thread (Worker Thread). Due to the fact that V8 itself is single threaded, anything that is exchanged across threads needs to be serialized. V8's serialization protocol can't serialize functions. Therefore, starting a worker thread necessarily implies loading files by their file path. If user is specifying workflows as actual function objects, how can we \"transfer\" that function to the worker thread execution context?\r\n\r\n- The TS SDK also execute workflow code inside a deterministic sandbox, which prevents reading files from disk, not even to `import()` or `require()` a source file from workflow code. For that reason, we need all the code that might be loaded/executed from the workflow context to be preloaded and transformed so that it effectively become a single source file. That is the reason for the \"workflow bundling\" process. If user is specifying workflows as actual function objects, how can we \"bundle\" that function for use from the sandbox execution context?","createdAt":"2023-11-27T18:11:49Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1287#issuecomment-1828367021","viewerDidAuthor":false},{"id":"IC_kwDOEujx185vWGW3","author":{"login":"mjameswh"},"authorAssociation":"MEMBER","body":"Closing this for now, as it is not actionable as is. I'm open to discuss further improvements, but would need more concrete suggestions.","createdAt":"2023-12-22T20:57:03Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-typescript/issues/1287#issuecomment-1868064183","viewerDidAuthor":false}],"createdAt":"2023-11-10T19:00:43Z","labels":[{"id":"MDU6TGFiZWwyNTQ1Mzg0MDEz","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":1287,"reactionGroups":[],"state":"CLOSED","title":"[Feature Request] Eliminate glue code","updatedAt":"2023-12-22T20:57:03Z","url":"https://github.com/temporalio/sdk-typescript/issues/1287"}
