{
  "summary": "Documentation for workflow ID generation was misleading, suggesting autogenerated IDs are suitable for most cases when business-meaningful IDs are often better. The docs needed to emphasize the importance of intentional workflow ID selection, especially for use cases like signalWithStart, and clarify the distinction between creating handles and creating new workflows.",
  "category": "docs",
  "subcategory": "workflow-id-documentation",
  "apis": [
    "WorkflowClient",
    "signalWithStart",
    "createHandle"
  ],
  "components": [
    "client",
    "documentation",
    "workflow-handle"
  ],
  "concepts": [
    "workflow-id",
    "idempotency",
    "signalWithStart",
    "workflow-handle",
    "business-meaningful-id",
    "documentation-clarity"
  ],
  "severity": "medium",
  "userImpact": "Users were misled by documentation to use autogenerated workflow IDs in cases where business-meaningful IDs would be more appropriate, leading to issues with signalWithStart and workflow handle operations.",
  "rootCause": "Documentation statement 'Most users should do just fine with the autogenerated workflowId' was statistically true but missed important edge cases and use patterns where intentional workflow IDs are necessary.",
  "proposedFix": "Hint that workflow ID selection has important considerations beyond autogeneration and link to full Temporal concepts documentation on workflow IDs. Clarify the distinction between createHandle and creating new workflows.",
  "workaround": null,
  "resolution": "fixed",
  "resolutionDetails": "Made workflowId required in all WorkflowClient methods, eliminating the autogeneration path and forcing intentional ID selection.",
  "related": [],
  "keyQuote": "Most users should do just fine with the autogenerated workflowId. The problem with that statement is that while it is statistically true, there are a class of use cases where it is not suitable",
  "number": 318,
  "repo": "temporalio-sdk-typescript",
  "generatedAt": "2026-01-11T22:05:11.407Z"
}