{
  "summary": "Users reported that calling gevent.monkey.patch_all() breaks workflow asyncio on gevent 1.5.0. The issue stems from gevent monkey-patching pure Python threading but not the C implementation, causing conflicts with the custom asyncio event loop management. The solution involved creating a separate executor for running the asyncio event loop in a native gevent thread.",
  "category": "bug",
  "subcategory": "gevent-integration",
  "apis": [
    "Worker"
  ],
  "components": [
    "worker",
    "event-loop",
    "task-executor",
    "threading"
  ],
  "concepts": [
    "gevent-compatibility",
    "asyncio-event-loop",
    "thread-local-storage",
    "monkey-patching",
    "executor",
    "threading-model"
  ],
  "severity": "high",
  "userImpact": "Users attempting to use Temporal Python SDK with gevent.monkey.patch_all() experience broken workflow execution on gevent 1.5.0.",
  "rootCause": "gevent monkey patches pure Python threading but not the C implementation of thread locals, causing conflicts when asyncio.run() or loop.run_until_complete() set the running loop on the C thread local, which gevent cannot override.",
  "proposedFix": "Use a separate executor for running the asyncio event loop in a native gevent thread, separate from the executor used for workflow/activity task execution.",
  "workaround": "Users can use a custom CFGThreadPool executor that wraps gevent.threadpool.ThreadPoolExecutor and uses loop.call_soon_threadsafe() to safely set futures from worker threads.",
  "resolution": "fixed",
  "resolutionDetails": "Implemented a solution combining gevent and Temporal by creating a separate executor for the asyncio event loop in a native gevent thread, demonstrated in samples-python PR #84.",
  "related": [],
  "keyQuote": "I basically took your approach but I created a _separate_ executor for running the asyncio event loop in a native gevent thread (separate from the executor that is used to execute workflow/activity tasks).",
  "number": 59,
  "repo": "temporalio-sdk-python",
  "generatedAt": "2026-01-11T20:47:27.797Z"
}