{"assignees":[],"author":{"id":"MDQ6VXNlcjIwNjM5Ng==","is_bot":false,"login":"cretz","name":"Chad Retz"},"body":"### Describe the solution you'd like\n\nLike we [built for Go](https://github.com/temporalio/sdk-go/tree/master/contrib/tools/workflowcheck) and [built for Java](https://github.com/temporalio/sdk-java/pull/2356), there is a desire for a \"workflow check\" analyzer for .NET.\n\nInitial notes/thoughts:\n\n* Should be a diagnostic/Roslyn analyzer called \"workflow check\" to match Go and Java equivalents\n* Should _transitively_ check known-yet-configurable invalid actions occurring in a workflow\n  * Transitive is the key/hard part\n    * This requires coloring methods as \"Temporal invalid\" or not, and any method that invokes an invalid method is itself invalid, so this is basically call graph building\n    * For Go, diagnostic checks support \"facts\" which are effectively serializable metadata that can be attached to typed AST, so that was used to mark a method as invalid (including transitively)\n    * For Java, no such thing exists, so we had to completely write an analyzer from scratch\n    * Like Java, .NET analyzer can ideally work from workflow method out and not have to eagerly color all methods\n    * The error needs to show the call graph stack since many times the issue is several calls deep from the workflow itself\n  * Understood that this will miss some things, e.g. reflection\n  * See https://github.com/temporalio/sdk-dotnet#workflow-logic-constraints and https://github.com/temporalio/sdk-dotnet?tab=readme-ov-file#net-task-determinism for what constitutes an invalid action\n* Ideally, should disable or invert certain existing analyzer/diagnostic warnings that are not applicable to workflows\n  * See https://github.com/temporalio/sdk-dotnet?tab=readme-ov-file#workflow-editorconfig for set of rules that should be inverted/disabled\n* If analyzer is cheap enough performance-wise to enable by default when using the `Temporalio` NuGet package, should do so\n* Ideally, if the rules are not too granular, we can create entries at https://github.com/temporalio/rules for each one (so we should prefix with `TMPRL`)\n  * Even if they are fairly granular, it is something we may want\n* https://learn.microsoft.com/en-us/azure/azure-functions/durable/durable-functions-roslyn-analyzer already exists for those curious\n\nAdmittedly research has not been done to confirm that all of these features are possible with .NET code analyzers.","closedAt":null,"comments":[],"createdAt":"2025-12-12T15:31:49Z","labels":[{"id":"LA_kwDOInL6Hs8AAAABJH7znQ","name":"enhancement","description":"New feature or request","color":"a2eeef"}],"milestone":null,"number":576,"reactionGroups":[],"state":"OPEN","title":"[Feature Request] .NET Analyzer for Checking Workflows","updatedAt":"2025-12-12T15:39:04Z","url":"https://github.com/temporalio/sdk-dotnet/issues/576"}
