{"assignees":[],"author":{"id":"U_kgDOC2pKCA","is_bot":false,"login":"DSmith-VERX","name":"D Smith"},"body":"I'm not sure if this would be more of a bug report or a feature request since it could be intentional. The logs within the context of a workflow (Workflow.Logger) show RunId as a property within structured log templates. The logs  within the context of an activity (using ILogger via DI in my case or Activity.Logger itself) use WorkflowRunId for this same information. \nBoth loggers use WorkflowId and other properties with consistent names. Should the run identifier not also use the Workflow prefix with the workflow logger to consistency with the other workflow properties and shared properties within the activity?\n\nThis is not hugely important, but it did initially cause some confusion when filtering our logs to track down an issue where a fully completed activity \"timed out\" and never returned to the main workflow.","closedAt":null,"comments":[{"id":"IC_kwDOInL6Hs62WDNI","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"It is intentional that we match the field names in the logger scope with the property names in the respective \"info\" objects. So the activity scope at https://github.com/temporalio/sdk-dotnet/blob/8e94382bc762f7b383c9ae17d82adc966d95f09f/src/Temporalio/Activities/ActivityInfo.cs#L63-L72 and the workflow scope at https://github.com/temporalio/sdk-dotnet/blob/8e94382bc762f7b383c9ae17d82adc966d95f09f/src/Temporalio/Workflows/WorkflowInfo.cs#L63-L71 do match those field names. Arguably we could have made `WorkflowInfo.RunId` be named `WorkflowInfo.WorkflowRunId` but we removed the `Wortkflow` prefix in cases where it made sense to there. Same thing with the `Namespace` field. But yes, arguably we could have had the logger scope deviate.\n\nUnfortunately, I am not sure it'd be worth changing now due to potential incompatibilities where people may be expecting the different scope field names (and not sure we want to add a second and have duplicate values nor have an entirely new worker option for changing this). However, you can make a workflow interceptor that surrounds the workflow execution inside a `BeginScope` with whatever additional scope values you'd like.","createdAt":"2025-07-10T21:59:15Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-dotnet/issues/496#issuecomment-3059233608","viewerDidAuthor":false}],"createdAt":"2025-07-10T21:21:53Z","labels":[],"milestone":null,"number":496,"reactionGroups":[],"state":"OPEN","title":"Inconsistent log property names for the workflow run identifier","updatedAt":"2025-07-10T22:00:25Z","url":"https://github.com/temporalio/sdk-dotnet/issues/496"}
