{"assignees":[{"id":"MDQ6VXNlcjQ0Njg3NDMz","login":"jmaeagle99","name":"Justin Anderson","databaseId":0}],"author":{"id":"MDQ6VXNlcjQ0Njg3NDMz","is_bot":false,"login":"jmaeagle99","name":"Justin Anderson"},"body":"There are several places in build pipelines that specify the SDK version and there is no clear documentation as to which version of the SDK should be used to build the .NET projects.\n\n## Proposed Solution\n\nAdd a [global.json](https://learn.microsoft.com/en-us/dotnet/core/tools/global-json) file to the repository that specifies the version of the .NET SDK to use. This has the benefit of:\n- Removing the need for build pipelines to know which version of the .NET SDK is necessary.\n- Having a central location that allow .NET tooling understands how to determine which version of the .NET SDK to use.\n- Allow Dependabot to potentially update the .NET SDK version if using the full triplet version.","closedAt":null,"comments":[{"id":"IC_kwDOInL6Hs7Ty4JR","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Also, if possible to include this anywhere other than the top-level, that'd be ideal. We already have too many top-level files for my liking (I would have liked not to have `omnisharp.json` there but I was disagreed with). It continues to move the README below the fold and make for a bit of an uglier view when arriving at the repo.","createdAt":"2025-11-19T15:26:18Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-dotnet/issues/563#issuecomment-3553329745","viewerDidAuthor":false},{"id":"IC_kwDOInL6Hs7T5ow6","author":{"login":"jmaeagle99"},"authorAssociation":"MEMBER","body":"> Also, if possible to include this anywhere other than the top-level, that'd be ideal.\n\nThere are two classes of implicit references to the global.json that I see that would be used in this repository:\n- The `setup-dotnet` GitHub action\n- The solution and project files\n\nThe GitHub action allows specifying a path to global.json file, so it can be located anywhere in the repository for these.\n\nFor the solution and project files, the global.json has to be at some common root of all of those. At this time, that would be the root of the repository. However, if the `tests` directory was moved under the `src` directory, then the global.json file (and likely all of the other .NET files like the editor config, omnisharp, props, etc) could be put under that directory; these are typically looked up recursively from the directory of the solution/project file up to the root of the filesystem.\n\nI'm not certain that's justification enough to shuffle around the source code in the repo though. The number of files that are currently at the root of the repository is not very large and feels less than a typical .NET repository.","createdAt":"2025-11-19T23:46:27Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-dotnet/issues/563#issuecomment-3555101754","viewerDidAuthor":false},{"id":"IC_kwDOInL6Hs7UF0to","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Yeah, we don't want to move around the entire source. But we've been operating without this file fine too, so one wonders if it is that required. I do recognize we have fewer top-level files than a typical .NET repo which is very much on purpose.","createdAt":"2025-11-20T14:16:11Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-dotnet/issues/563#issuecomment-3558296424","viewerDidAuthor":false},{"id":"IC_kwDOInL6Hs7Whv0a","author":{"login":"jmaeagle99"},"authorAssociation":"MEMBER","body":"**User Experience**\nIf a person works consistently in the code base, said person probably already knows the requirements for building this repository. As someone newer to this project, I had to search to determine what version of the .NET SDK was necessary before the move to the .NET 10 SDK. Using a global.json file makes it clear as to what version is necessary and provides a user experience when that requirement is not met:\n\n```\nRequested SDK version: 10.0.100\nglobal.json file: <path>/temporalio-sdk-dotnet/global.json\n\nInstalled SDKs:\n8.0.416 [/usr/local/share/dotnet/sdk]\n\nInstall the [10.0.100] .NET SDK or update [<path>/temporalio-sdk-dotnet/global.json] to match an installed SDK.\n\nLearn about SDK resolution:\nhttps://aka.ms/dotnet/sdk-not-found\n```\n\n**Version Consistency**\nEach aspect of the build process doesn't need to understand what is the .NET SDK version that is necessary to use to successfully build the repository. Currently, there are 5 separate `actions/setup-dotnet@v4` task invocations in 4 GitHub workflows that all need to agree on what is the correct version. Using a global.json file, specifying that version should not be necessary.\n\nAll of the \"native\" .NET tooling understands global.json and how to look it up.\n\n**Maintenance**\nNext time that .NET SDK needs a new major version bump, there will be fewer files and occurances that would need to be updated. After this type of change, I count two places: the global.json file and the container image specification of the Alpine images.\n\n**Pinning**\nIn the unlikely event that a new SDK patch breaks the ability to build, using a centralized version allows the repository to be pinned to a specific version to avoid build breaks.\n\n**Dependabot**\nWhile not used currently, dependabot understands the global.json file and can update the SDK version as necessary to make sure that it is not set to a vulnerable version.","createdAt":"2025-12-01T22:08:14Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-dotnet/issues/563#issuecomment-3599170842","viewerDidAuthor":false},{"id":"IC_kwDOInL6Hs7WtWLh","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Yeah, I think it's understood why a global.json file has value for _contributors_ and CI, just trying to reduce top-level files for _everyone_ that views this repo (which is a lot more than contributors). Having said that, it's not that big of a deal if you think it's important enough.","createdAt":"2025-12-02T13:58:22Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-dotnet/issues/563#issuecomment-3602211553","viewerDidAuthor":false}],"createdAt":"2025-11-19T00:31:30Z","labels":[],"milestone":null,"number":563,"reactionGroups":[],"state":"OPEN","title":"Use global.json file to centralize SDK version","updatedAt":"2025-12-30T20:53:21Z","url":"https://github.com/temporalio/sdk-dotnet/issues/563"}
