{
  "generatedAt": "2026-01-22T20:30:08.660Z",
  "totalCards": 180,
  "cards": [
    {
      "summary": "Fiber state corruption occurs on x86_64 Linux when `Workflow.timeout` expires and is immediately followed by `Workflow.execute_activity`, causing a NoMethodError where `Fiber.yield` returns true instead of a Resolution object. The issue does not occur on aarch64 architecture and can be worked around by calling `Workflow.sleep(0)` before the activity.",
      "category": "bug",
      "subcategory": "fiber-scheduler",
      "apis": [
        "Workflow.timeout",
        "Workflow.wait_condition",
        "Workflow.execute_activity",
        "Workflow.sleep"
      ],
      "components": [
        "fiber-scheduler",
        "workflow-instance",
        "outbound-implementation"
      ],
      "concepts": [
        "timeout-expiration",
        "fiber-state",
        "yield-resume-cycle",
        "architecture-specific",
        "state-corruption"
      ],
      "severity": "high",
      "userImpact": "Workflows on x86_64 Linux that use `Workflow.timeout` followed by `Workflow.execute_activity` crash when the timeout expires, blocking long-running patterns like opportunity nurturing workflows.",
      "rootCause": "When a timeout expires on x86_64, the wait condition fiber is not properly cleaned up when an exception is raised from yield. This leaves the wait condition fiber registered while the execute activity is currently yielded, causing the resolution to be sent to the wrong fiber context, resulting in true being returned instead of a Resolution object.",
      "proposedFix": null,
      "workaround": "Add `Workflow.sleep(0)` before `Workflow.execute_activity` to force a clean fiber yield/resume cycle after timeout expiration.",
      "resolution": "fixed",
      "resolutionDetails": "SDK maintainers identified the root cause as improper cleanup of wait condition fibers on timeout, leading to fiber resolution routing issues. The issue was architecture-specific due to timing/memory layout differences between x86_64 and aarch64.",
      "related": [],
      "keyQuote": "when the wait timeout occurs, that wait condition is left around... we are not properly removing the wait condition when an exception is raised from yield (which is what timeout does)",
      "number": 373,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:53:23.838Z"
    },
    {
      "summary": "Feature request to support executing activities outside of workflow context. Workers and clients need to be enhanced to start, manage, and retrieve activity results independently, leveraging new upcoming server APIs.",
      "category": "feature",
      "subcategory": "activities",
      "apis": [],
      "components": [
        "worker",
        "client",
        "activity-executor"
      ],
      "concepts": [
        "activities",
        "non-workflow-execution",
        "server-api",
        "activity-management",
        "asynchronous-execution"
      ],
      "severity": "medium",
      "userImpact": "Users will be able to execute and manage activities independently without requiring a workflow context, enabling new use cases for activity-based processing.",
      "rootCause": null,
      "proposedFix": "Implement support for new server APIs (referenced in temporalio/api#640) to allow clients to start activities and workers to execute activities outside workflow context.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Allow executing activities without a workflow. The clients must support the new (upcoming) server APIs for starting, managing and getting results of activities.",
      "number": 367,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:53:19.688Z"
    },
    {
      "summary": "Update Ruby SDK to confirm/assert compatibility with Ruby 4 and consider dropping support for Ruby 3.2 at end-of-life. Requires updates to CI, documentation, and compatibility testing.",
      "category": "feature",
      "subcategory": "ruby-version-support",
      "apis": [],
      "components": [
        "ci",
        "documentation",
        "ruby-runtime"
      ],
      "concepts": [
        "version-compatibility",
        "eol-support",
        "ruby-upgrade",
        "maintenance"
      ],
      "severity": "medium",
      "userImpact": "Users want confirmation and support for Ruby 4, and clarity on when Ruby 3.2 support will be dropped.",
      "rootCause": null,
      "proposedFix": "Update CI configuration, documentation, and conduct compatibility testing for Ruby 4. Drop Ruby 3.2 support after EOL.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was completed and closed, indicating Ruby 4 support was implemented and CI/docs were updated.",
      "related": [],
      "keyQuote": "Need to update CI, docs, etc to confirm/assert Ruby 4 compatibility. Also consider dropping 3.2 support if it goes EOL as expected.",
      "number": 364,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:53:23.331Z"
    },
    {
      "summary": "Users want to override the target deployment version when invoking a child workflow in the Ruby SDK, similar to how it works when creating workflows from a client. This feature would enable pre-deployment testing.",
      "category": "feature",
      "subcategory": "child-workflow-deployment",
      "apis": [
        "ExecuteChildWorkflow"
      ],
      "components": [
        "child-workflow",
        "deployment-versioning",
        "worker"
      ],
      "concepts": [
        "deployment-version",
        "versioning",
        "child-workflows",
        "pre-deployment-testing",
        "workflow-configuration"
      ],
      "severity": "medium",
      "userImpact": "Users cannot override deployment versions for child workflows, limiting pre-deployment testing capabilities that are available for parent workflows.",
      "rootCause": null,
      "proposedFix": "Add parameter to child workflow invocation to allow overriding the target deployment version, matching the functionality available in client-side workflow creation.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Users want to override the target version on a workflow, especially when doing pre-deployment testing. This should work the same as it does when creating a Workflow from a client.",
      "number": 361,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:53:01.532Z"
    },
    {
      "summary": "User cannot test Temporal Ruby workflows that use `wait_condition` with signals in the time-skipping test environment. The signal is received correctly (verified via query), but the workflow doesn't resume execution after the signal, causing timeouts when trying to get the result.",
      "category": "question",
      "subcategory": "test-framework",
      "apis": [
        "wait_condition",
        "signal",
        "query",
        "start_workflow",
        "execute_workflow",
        "WorkflowEnvironment.start_time_skipping"
      ],
      "components": [
        "testing",
        "time-skipping",
        "signals",
        "workflow-executor"
      ],
      "concepts": [
        "signal-handling",
        "wait-condition",
        "time-skipping-test",
        "workflow-continuation",
        "async-testing",
        "workflow-state"
      ],
      "severity": "high",
      "userImpact": "Developers cannot effectively test signal-driven workflows in the Ruby SDK's time-skipping environment, forcing them to use real Temporal servers or alternative testing approaches.",
      "rootCause": "Time-skipping doesn't automatically progress workflows until `workflow_handle.result` is called; manual `sleep` on the environment is required to advance time after signals, but this behavior may not be clearly documented or intuitive.",
      "proposedFix": "Clarify documentation on time-skipping behavior with signals, or improve automatic time progression when signals are processed in test environments.",
      "workaround": "Call `sleep` on the environment to manually advance time after sending a signal; run `execute_workflow` in a background thread for automatic progression.",
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "the automatic time-skipping doesn't kick in until you wait for the workflow result. So the workflow does not progress automatically until you wait for the result",
      "number": 360,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:53:07.617Z"
    },
    {
      "summary": "OpenTelemetry instrumentation in workflows can become non-deterministic when libraries monkey-patch Context.current, causing issues even though the durable scheduler is supposed to be disabled. The fix is to disable the durable scheduler for all OTel calls, not just the obvious non-deterministic ones.",
      "category": "feature",
      "subcategory": "opentelemetry-integration",
      "apis": [],
      "components": [
        "workflow-interceptor",
        "opentelemetry-integration",
        "durable-scheduler"
      ],
      "concepts": [
        "determinism",
        "instrumentation",
        "context-management",
        "monkey-patching",
        "scheduler-isolation"
      ],
      "severity": "high",
      "userImpact": "Workflows using OpenTelemetry instrumentation may become non-deterministic due to third-party library monkey-patching, causing workflow replay failures and unpredictable behavior.",
      "rootCause": "Some OpenTelemetry libraries (e.g., DataDog) monkey-patch Context.current, making it non-deterministic even though the durable scheduler is disabled for obvious OTel calls.",
      "proposedFix": "Disable the durable scheduler for every OpenTelemetry call in the workflow interceptor, not just the obvious non-deterministic ones.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The issue was resolved by ensuring all OTel calls in the workflow interceptor run with the durable scheduler disabled to prevent any monkey-patched Context.current calls from affecting workflow determinism.",
      "related": [],
      "keyQuote": "we just need to disable the durable scheduler for every OTel call, not just the obvious non-deterministic ones",
      "number": 359,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:53:03.657Z"
    },
    {
      "summary": "ActiveModel classes fail in workflows because they use ConcurrentMap internally, which relies on Thread::Mutex that is forbidden in workflows. The issue occurs when accessing attributes or using models with ActiveModel::Attributes, causing NondeterminismError.",
      "category": "bug",
      "subcategory": "workflow-constraints",
      "apis": [],
      "components": [
        "workflow-instance",
        "illegal-call-tracer",
        "activemodel-integration"
      ],
      "concepts": [
        "thread-safety",
        "workflow-execution",
        "synchronization-constructs",
        "determinism",
        "attribute-access",
        "concurrent-ruby",
        "durable-scheduler"
      ],
      "severity": "high",
      "userImpact": "Users cannot use ActiveModel classes (a common Rails library) in Temporal workflows, limiting framework compatibility and forcing workarounds or alternative data structures.",
      "rootCause": "ActiveModel uses concurrent-ruby's ConcurrentMap which employs Thread::Mutex for thread-safe operations. Workflows cannot use synchronization primitives because they need to be deterministic and replayed safely.",
      "proposedFix": "Implement a WorkflowSafeObject mixin that wraps calls with Workflow::Unsafe::durable_scheduler_disabled to allow safe execution of normally-forbidden constructs in workflows.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "ConcurrentMap use is so pervasive in ActiveModel, it is unreasonable for us to ask users not to use anything relying on it.",
      "number": 355,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:49.432Z"
    },
    {
      "summary": "Feature request to enable worker heartbeating in the Ruby SDK by allowing users to specify the worker heartbeat interval when initializing Core Runtime. Worker heartbeating is already implemented in Core and needs to be exposed through the Ruby SDK.",
      "category": "feature",
      "subcategory": "worker-heartbeat",
      "apis": [],
      "components": [
        "worker",
        "core-runtime",
        "worker-initialization"
      ],
      "concepts": [
        "heartbeating",
        "worker-lifecycle",
        "core-runtime-configuration",
        "connection-health",
        "resource-management"
      ],
      "severity": "medium",
      "userImpact": "Users cannot currently configure worker heartbeat intervals in the Ruby SDK, limiting their ability to tune worker connection stability.",
      "rootCause": null,
      "proposedFix": "Expose worker heartbeat interval configuration parameter when initializing Core Runtime",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to enable worker heartbeating configuration in the Ruby SDK",
      "related": [],
      "keyQuote": "Worker heartbeating is implemented in Core, need to enable worker heartbeating by allowing users to specify the worker heartbeat interval when initializing Core Runtime",
      "number": 354,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:49.322Z"
    },
    {
      "summary": "Implement a Plugin system for the Ruby SDK to allow users to self-serve create integrations with Temporal Workflows, following the pattern already established in the Python SDK.",
      "category": "feature",
      "subcategory": "plugin-system",
      "apis": [],
      "components": [
        "plugin-manager",
        "ruby-sdk",
        "integration-system"
      ],
      "concepts": [
        "extensibility",
        "plugin-architecture",
        "user-customization",
        "integration",
        "workflow-extension",
        "self-service"
      ],
      "severity": "medium",
      "userImpact": "Users can create custom integrations with Temporal Workflows without modifying SDK internals.",
      "rootCause": null,
      "proposedFix": "Copy the existing plugin implementation from the Python SDK to Ruby",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Plugin system implemented following Python SDK pattern",
      "related": [],
      "keyQuote": "Implement Plugins so that users can self-serve creating integrations with Temporal Workflows. This is done in Python and we can copy.",
      "number": 353,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:45.511Z"
    },
    {
      "summary": "Retry policy's non_retryable_error_types parameter doesn't match exceptions with module/namespace qualifiers (e.g., ActiveRecord::RecordNotFound). The SDK strips namespaces when converting errors to ApplicationError, causing activities to retry when they should fail instantly.",
      "category": "bug",
      "subcategory": "retry-policy",
      "apis": [
        "RetryPolicy"
      ],
      "components": [
        "retry-policy",
        "failure-converter",
        "activity-executor",
        "error-handling"
      ],
      "concepts": [
        "retry",
        "error-matching",
        "namespace",
        "error-conversion",
        "non-retryable-errors",
        "activity-failure"
      ],
      "severity": "medium",
      "userImpact": "Users cannot use fully-qualified error type names in non_retryable_error_types, forcing them to use unqualified names or implement custom workarounds, which causes unexpected retries during migration from other SDKs.",
      "rootCause": "By design, the SDK converts exceptions to ApplicationError with only the unqualified error type name (without namespace), so retry policy matching against qualified names fails.",
      "proposedFix": null,
      "workaround": "Implement a custom failure converter or activity interceptor to preserve the full error class name when creating ApplicationError, as demonstrated in the issue comments.",
      "resolution": "wontfix",
      "resolutionDetails": "Determined to be intentional design by SDK maintainer. The unqualified error type name is by-design and consistent across SDKs. Users should use custom failure converters or interceptors to preserve qualified names if needed.",
      "related": [
        293,
        294
      ],
      "keyQuote": "By default, exceptions raised from activity are converted to ApplicationError with the type as the unqualified error type name. This is the same in all SDKs.",
      "number": 338,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:34.517Z"
    },
    {
      "summary": "Ruby SDK needs to ensure fibers and workflow instances are properly garbage collected when workflows are evicted. Initial investigation suggested fibers held by threads need explicit cleanup, but recent analysis indicates suspended fibers can be GC'd naturally if all references are removed, though deterministic testing has proven difficult.",
      "category": "feature",
      "subcategory": "memory-management",
      "apis": [],
      "components": [
        "fiber-scheduler",
        "workflow-eviction",
        "garbage-collection"
      ],
      "concepts": [
        "garbage-collection",
        "memory-management",
        "workflow-eviction",
        "fiber-suspension",
        "thread-references",
        "deterministic-testing"
      ],
      "severity": "medium",
      "userImpact": "Potential memory leaks from uncollected fibers on workflow eviction could cause high memory usage in long-running Ruby Temporal applications.",
      "rootCause": "Initial assumption that threads hold strong references to suspended fibers preventing GC has been reconsidered; actual mechanism and test verification remains unclear.",
      "proposedFix": "Consider implementation approach similar to Python SDK PR #499 where exceptions are raised in suspended fibers to force completion without side effects, or develop deterministic GC verification tests.",
      "workaround": null,
      "related": [
        336,
        335
      ],
      "keyQuote": "We do not believe there is a memory leak, but we struggle to write a deterministic test for this.",
      "number": 334,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:31.911Z"
    },
    {
      "summary": "Users should be able to require the payload codec from the data converter file in the Ruby SDK. Currently, the payload codec is not exported when requiring 'temporalio/converters', making it unavailable despite being part of the data converter functionality.",
      "category": "feature",
      "subcategory": "payload-codec",
      "apis": [],
      "components": [
        "converters",
        "data-converter",
        "payload-codec"
      ],
      "concepts": [
        "module-exports",
        "require-path",
        "codec-availability",
        "data-conversion"
      ],
      "severity": "low",
      "userImpact": "Users cannot access the payload codec through the standard converters require path, requiring them to know about alternative import methods.",
      "rootCause": "The payload codec is not exported from the data converter file which is required from the top-level converters file.",
      "proposedFix": "Export the payload codec from the data converter file so it is available when requiring 'temporalio/converters'.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Users should be able to `require 'temporalio/converters'` and have payload codec, but it is not required from the data converter file",
      "number": 333,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:28.968Z"
    },
    {
      "summary": "After upgrading to v0.6.0, Ruby SDK workflows deadlock with a 2-second timeout error due to call tracing overhead. The illegal call tracer was causing excessive validation that made workflows slow enough to trigger the deadlock detector.",
      "category": "bug",
      "subcategory": "deadlock-detection",
      "apis": [
        "Future.new",
        "Future.all_of"
      ],
      "components": [
        "call-tracer",
        "deadlock-detector",
        "worker"
      ],
      "concepts": [
        "deadlock-detection",
        "performance-regression",
        "call-tracing",
        "validation-overhead",
        "cpu-bound-work"
      ],
      "severity": "high",
      "userImpact": "Users upgrading to v0.6.0 experience consistent workflow deadlocks with 2-second timeout errors, preventing benchmarks and other async workflows from completing.",
      "rootCause": "The illegal call tracer introduced in v0.6.0 added significant overhead to validation, causing workflows to exceed the 2-second deadlock detection threshold.",
      "proposedFix": "PR #332 reduces the scope of the illegal call tracer validation to minimize performance impact and prevent workflows from hitting the deadlock detector.",
      "workaround": "Set `debug_mode: true` when creating the worker to disable the deadlock detector, allowing CPU-bound work to take longer than 2 seconds.",
      "resolution": "fixed",
      "resolutionDetails": "Fixed by PR #332 which reduced call tracing scope to prevent performance degradation that triggered deadlock detection.",
      "related": [
        332
      ],
      "keyQuote": "This is a case where, with the illegal call tracer on, it actually does take over 2s to process things. There is also a bug preventing the disabling of the call tracer we will fix.",
      "number": 330,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:16.161Z"
    },
    {
      "summary": "Add support for gRPC binary metadata headers in the Ruby SDK by requiring ASCII-based string values for `-bin` keys and setting them as Tonic metadata binary values.",
      "category": "feature",
      "subcategory": "grpc-metadata",
      "apis": [],
      "components": [
        "grpc",
        "metadata",
        "tonic"
      ],
      "concepts": [
        "binary-metadata",
        "grpc-headers",
        "interoperability",
        "protocol-compliance"
      ],
      "severity": "medium",
      "userImpact": "Users need gRPC binary metadata header support to ensure compatibility with Temporal services and cross-language communication patterns.",
      "rootCause": null,
      "proposedFix": "Require ASCII-based string values for `-bin` keys and set those as Tonic metadata binary values",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Implemented gRPC binary metadata header support by handling ASCII-based string values for `-bin` keys as Tonic metadata binary values",
      "related": [
        671
      ],
      "keyQuote": "Probably just need to require ASCII-based string values for `-bin` keys and set those as Tonic metadata binary values",
      "number": 329,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:10.287Z"
    },
    {
      "summary": "Feature request to reclassify benign application errors in OpenTelemetry spans, following the same approach implemented in the Python SDK. This involves distinguishing between user code exceptions and system errors for better observability.",
      "category": "feature",
      "subcategory": "observability",
      "apis": [],
      "components": [
        "opentelemetry",
        "instrumentation",
        "error-handling"
      ],
      "concepts": [
        "observability",
        "error-classification",
        "spans",
        "telemetry",
        "user-errors",
        "system-errors"
      ],
      "severity": "medium",
      "userImpact": "Users gain better visibility into which errors are caused by their application code versus system issues, improving debugging and monitoring capabilities.",
      "rootCause": null,
      "proposedFix": "Implement the same error reclassification logic as was done in the Python SDK (issue #1041) to mark benign application errors appropriately in OpenTelemetry spans.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "This is a feature request that was tracked and likely implemented to align Ruby SDK observability with other SDKs.",
      "related": [
        1041
      ],
      "keyQuote": "See issue description here: https://github.com/temporalio/sdk-python/issues/1041",
      "number": 328,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:52:12.729Z"
    },
    {
      "summary": "Improve Ruby scheduler memory efficiency by replacing array-based ready fiber list with a proper queue data structure to avoid repeated shift/append operations.",
      "category": "feature",
      "subcategory": "scheduler-performance",
      "apis": [],
      "components": [
        "fiber-scheduler",
        "ready-queue",
        "memory-management"
      ],
      "concepts": [
        "memory-efficiency",
        "data-structure",
        "performance-optimization",
        "queue",
        "garbage-collection"
      ],
      "severity": "low",
      "userImpact": "Users may experience unnecessary memory pressure and garbage collection overhead due to inefficient array operations in the fiber scheduler.",
      "rootCause": "Using array with repeated shift and append operations creates unnecessary memory churn instead of using a proper queue data structure.",
      "proposedFix": "Replace array-based ready fiber list with a queue data structure using non-blocking pop operations.",
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "Author noted that while queue would be cleaner, the current implementation completely drains the array anyway, making the optimization not beneficial in practice.",
      "related": [],
      "keyQuote": "Note, queue is a bit blocked on how it is used with our fiber scheduler. The way we completely drain this array means it's actually not a big deal here.",
      "number": 320,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:51:57.271Z"
    },
    {
      "summary": "Implement client-side trimming of failure proto to reduce server-side truncation and wrapping. The server currently truncates oversized failures and wraps them in error responses; this feature explores doing size limiting on the client before sending to prevent this behavior, with opt-out support for custom server limits.",
      "category": "feature",
      "subcategory": "failure-handling",
      "apis": [],
      "components": [
        "client",
        "failure-serialization",
        "error-handling"
      ],
      "concepts": [
        "failure-size-limit",
        "proto-truncation",
        "data-optimization",
        "server-limits",
        "error-wrapping"
      ],
      "severity": "medium",
      "userImpact": "Users experiencing truncated failure information due to server-side size limits could preserve complete failure details through client-side trimming.",
      "rootCause": "Server-side failure proto size limits cause truncation and wrapping of failures in error responses.",
      "proposedFix": "Implement client-side trimming of failure proto before sending to server, with configurable opt-out for users with custom server-side limits.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        597
      ],
      "keyQuote": "if failure proto is too large server side, they truncate it _and_ wrap in server error. See if there's something we can do client side before the failure is sent",
      "number": 319,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:51:53.302Z"
    },
    {
      "summary": "Feature request to add plugin support to the Ruby SDK, referencing a cross-SDK features issue for implementation details.",
      "category": "feature",
      "subcategory": "plugins",
      "apis": [],
      "components": [
        "plugin-system",
        "sdk-core"
      ],
      "concepts": [
        "extensibility",
        "plugin-architecture",
        "sdk-integration",
        "customization"
      ],
      "severity": "medium",
      "userImpact": "Users would be able to extend the Ruby SDK with custom plugins for specialized functionality.",
      "rootCause": null,
      "proposedFix": "Implement plugin support mechanism consistent with cross-SDK approach (see features/652)",
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "Issue was closed, likely deprioritized in favor of other SDK development priorities",
      "related": [
        652
      ],
      "keyQuote": "See https://github.com/temporalio/features/issues/652",
      "number": 318,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:51:50.353Z"
    },
    {
      "summary": "ScopedLogger fails when comparing log levels against non-integer values like symbols. This occurs when using libraries like semantic_logger that return symbols for Logger#level instead of integers, causing a type comparison error during workflow execution.",
      "category": "bug",
      "subcategory": "logging",
      "apis": [],
      "components": [
        "scoped-logger",
        "replay-safe-logger",
        "semantic-logger-compatibility"
      ],
      "concepts": [
        "logging",
        "type-compatibility",
        "logger-abstraction",
        "rails-integration",
        "level-comparison"
      ],
      "severity": "high",
      "userImpact": "Workflows fail with type comparison errors when running in Rails applications using semantic_logger instead of the standard Logger.",
      "rootCause": "ScopedLogger performs integer comparison on Logger#level, but semantic_logger returns symbols instead of integers, causing 'comparison of Integer with :debug failed' error.",
      "proposedFix": "Update ScopedLogger to handle both integer and symbol log levels, converting symbols to their integer equivalents for comparison.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        316
      ],
      "keyQuote": "When I inspect those values, severity is 2, Logger::Unknown is undefined (should be Logger::UNKNOWN?), and level is :debug.",
      "number": 315,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:51:35.676Z"
    },
    {
      "summary": "Request to add the first execution run ID to workflow info in the Ruby SDK, as part of a cross-SDK feature initiative.",
      "category": "feature",
      "subcategory": "workflow-info",
      "apis": [
        "WorkflowInfo"
      ],
      "components": [
        "workflow-runtime",
        "sdk-api"
      ],
      "concepts": [
        "workflow-execution",
        "run-id",
        "workflow-metadata",
        "execution-tracking"
      ],
      "severity": "low",
      "userImpact": "Users will be able to access the original run ID from workflow execution information for tracking and debugging purposes.",
      "rootCause": null,
      "proposedFix": "Add first execution run ID field to workflow info structure, following the feature specification referenced in temporalio/features#29",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented as part of cross-SDK enhancement effort",
      "related": [
        29
      ],
      "keyQuote": "Add first execution run ID to workflow info",
      "number": 311,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:51:33.113Z"
    },
    {
      "summary": "Feature request to disallow Ruby stdlib synchronization constructs (sleep, Mutex, ConditionVariable, Queue) in workflows before GA. These constructs are fiber-aware and implicitly made durable, but can cause issues when third-party libraries use them unexpectedly, leading to hung workflows.",
      "category": "feature",
      "subcategory": "workflow-constraints",
      "apis": [],
      "components": [
        "fiber-scheduler",
        "illegal-call-tracing",
        "workflow-runtime"
      ],
      "concepts": [
        "durability",
        "synchronization",
        "fiber-awareness",
        "stdlib-constraints",
        "mutex",
        "workflow-safety"
      ],
      "severity": "high",
      "userImpact": "Users may inadvertently use stdlib synchronization constructs in workflows through third-party libraries, causing workflows to hang when durable locks are not properly released.",
      "rootCause": "Stdlib synchronization constructs are fiber-aware and implicitly made durable by the Ruby SDK, but third-party libraries (like loggers) may use mutexes expecting same-process semantics, creating durability mismatches.",
      "proposedFix": "Implement illegal call tracing to disallow Mutex, ConditionVariable, Queue, and SizedQueue in workflows, and provide workflow-safe equivalents similar to existing sleep and timeout replacements.",
      "workaround": "Wrap third-party library calls in blocks that disable the durable scheduler tracer.",
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        309
      ],
      "keyQuote": "Every Google Protobuf field access uses a mutex. It may not be reasonable for us to wrap every proto access in a disable-tracer block...",
      "number": 310,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:51:37.857Z"
    },
    {
      "summary": "User requests a built-in error notification mechanism for workflow failures to integrate with external error tracking services like Bugsnag. The SDK maintainer recommends using interceptors instead and points to existing samples.",
      "category": "feature",
      "subcategory": "error-handling",
      "apis": [],
      "components": [
        "worker",
        "interceptors",
        "workflow-execution"
      ],
      "concepts": [
        "error-notification",
        "external-integration",
        "error-tracking",
        "workflow-failure",
        "observability"
      ],
      "severity": "low",
      "userImpact": "Users cannot easily send workflow errors to external error tracking services without implementing custom solutions using interceptors.",
      "rootCause": null,
      "proposedFix": "Add an optional error_notifier parameter to Worker that accepts a class implementing a notify(exception) interface",
      "workaround": "Use interceptors to wrap workflow logic and send exceptions to external error tracking services",
      "resolution": "wontfix",
      "resolutionDetails": "Maintainer closed as not an SDK issue, recommending interceptors as the intended approach for this use case",
      "related": [
        43
      ],
      "keyQuote": "You should use interceptors for this which can wrap workflow logic... closing this issue since it's not an SDK issue",
      "number": 308,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:50:22.158Z"
    },
    {
      "summary": "The macOS Intel runner was removed from the build-gems workflow's smoke test because it cannot download the CLI due to outdated CA certificates. This feature request asks to update the workflow to support macOS Intel testing again.",
      "category": "feature",
      "subcategory": "ci-workflow",
      "apis": [],
      "components": [
        "build-gems",
        "github-workflow",
        "ci"
      ],
      "concepts": [
        "testing",
        "platform-support",
        "certificates",
        "macos",
        "smoke-test"
      ],
      "severity": "low",
      "userImpact": "macOS Intel platform is not tested in the build workflow, potentially missing platform-specific issues.",
      "rootCause": "macOS Intel runner lacks updated CA certificates required to download the CLI",
      "proposedFix": "Update CA certificates on the macOS Intel runner, potentially using Python's approach as reference",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "macos-intel (i.e. macos-13) runner had to be removed from build-gems run because it cannot download the CLI to do a smoke test presumably because it does not have latest CA certificates",
      "number": 306,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:51:18.513Z"
    },
    {
      "summary": "Ruby SDK does not allow multiple workflow handlers (signal, update, query) to share the same name, unlike other SDKs. This causes a RuntimeError when attempting to define handlers with identical names for different handler types.",
      "category": "bug",
      "subcategory": "workflow-handlers",
      "apis": [
        "workflow_signal",
        "workflow_update"
      ],
      "components": [
        "workflow-handler",
        "decorator",
        "signal-handler",
        "update-handler"
      ],
      "concepts": [
        "handler-naming",
        "handler-type",
        "workflow-signals",
        "workflow-updates",
        "api-consistency",
        "multi-language-parity"
      ],
      "severity": "medium",
      "userImpact": "Ruby developers cannot implement the same handler logic for different handler types with a shared name, forcing workarounds and reducing code reusability compared to other SDKs.",
      "rootCause": "The Ruby SDK's handler decorator implementation does not allow multiple handler types to share the same name, enforcing a one-name-per-handler-type constraint that other SDKs do not have.",
      "proposedFix": "Modify the Ruby SDK handler registration mechanism to allow multiple handlers of different types to share the same name, matching the behavior of Python and other SDKs.",
      "workaround": "Use different names for each handler type (signal, update, query) even if they implement the same business logic.",
      "resolution": "fixed",
      "resolutionDetails": "The Ruby SDK was updated to allow multiple workflow handlers of different types to share the same name, bringing it into parity with other Temporal SDKs.",
      "related": [],
      "keyQuote": "Workflow signal UpdateOrder already defined as a different handler type (RuntimeError)",
      "number": 299,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:50:20.194Z"
    },
    {
      "summary": "Feature request to add a Summary field to LocalActivityOptions in the Ruby SDK, as referenced in the features repository issue.",
      "category": "feature",
      "subcategory": "local-activity-options",
      "apis": [
        "LocalActivityOptions"
      ],
      "components": [
        "local-activity",
        "options"
      ],
      "concepts": [
        "activity-options",
        "feature-parity",
        "sdk-enhancement"
      ],
      "severity": "low",
      "userImpact": "Adds optional summary metadata capability to local activity options, improving feature consistency across SDKs.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "unknown",
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "See `features` repo issue",
      "number": 298,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:50:01.712Z"
    },
    {
      "summary": "Users need access to raw heartbeat details on Activity::Info, potentially as a collection of RawValue objects, to support use cases like providing hints. The feature also requires making heartbeat_details lazy to avoid eager deserialization for users working with raw values.",
      "category": "feature",
      "subcategory": "activity-heartbeat",
      "apis": [
        "Activity::Info",
        "Converters::RawValue"
      ],
      "components": [
        "activity-executor",
        "heartbeat-handler",
        "type-converter"
      ],
      "concepts": [
        "heartbeat",
        "raw-value",
        "lazy-deserialization",
        "activity-context",
        "type-conversion"
      ],
      "severity": "medium",
      "userImpact": "Users working with raw heartbeat details for custom hint provisioning currently lack access to the underlying raw form, requiring eager deserialization.",
      "rootCause": null,
      "proposedFix": "Expose raw heartbeat details as a collection of Temporalio::Converters::RawValue on Temporalio::Activity::Info and implement lazy deserialization for heartbeat_details.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented to expose raw heartbeat details and support lazy deserialization",
      "related": [
        271
      ],
      "keyQuote": "Users may need access to the raw form of the last heartbeat details (e.g. if they want to provide hints)",
      "number": 297,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:50:04.551Z"
    },
    {
      "summary": "The failure converter in the Ruby SDK is not properly defaulting the error type to an unqualified class name. The issue points to a specific line in the code that needs to extract only the class name without the module namespace.",
      "category": "bug",
      "subcategory": "error-conversion",
      "apis": [],
      "components": [
        "failure-converter",
        "error-handling"
      ],
      "concepts": [
        "error-type",
        "class-name",
        "namespace",
        "type-conversion",
        "serialization"
      ],
      "severity": "medium",
      "userImpact": "Application errors may not be properly converted and serialized when being passed through the Temporal workflow system, potentially causing errors to lose their type information.",
      "rootCause": "The failure converter is not extracting the unqualified class name from the error object, likely including the full module namespace instead.",
      "proposedFix": "Change the error type extraction to use `error.class.name.to_s.split('::').last` to get only the unqualified class name.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The code was updated to properly extract the unqualified class name by splitting on '::' and taking the last element.",
      "related": [],
      "keyQuote": "error.class.name.to_s.split('::').last",
      "number": 294,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:50:07.724Z"
    },
    {
      "summary": "Ruby SDK drops namespace from activity and workflow class names by default, causing potential naming collisions when the same class name is used in different namespaces. The issue was resolved by design decision to maintain compatibility with other SDKs and CLI/UI clarity.",
      "category": "bug",
      "subcategory": "naming-convention",
      "apis": [],
      "components": [
        "workflow-definition",
        "activity-definition"
      ],
      "concepts": [
        "namespace",
        "naming-collision",
        "class-naming",
        "disambiguation",
        "SDK-compatibility"
      ],
      "severity": "medium",
      "userImpact": "Users with identically-named workflow or activity classes in different namespaces may experience unexpected name collisions unless they explicitly specify custom names.",
      "rootCause": "By design, the SDK strips namespace from class names when generating workflow and activity names for SDK/CLI/UI compatibility with other language SDKs, which typically use unqualified names.",
      "proposedFix": null,
      "workaround": "Explicitly set workflow_name or activity_name using `workflow_name` or `activity_name` methods, or create base classes that automatically set the name to the fully qualified class name using the `inherited` hook.",
      "resolution": "wontfix",
      "resolutionDetails": "Maintainers clarified this is by design for SDK/CLI/UI compatibility. Users should use explicit workflow_name/activity_name if they need the fully qualified name.",
      "related": [],
      "keyQuote": "Using the unqualified class name by default is by design here and in other SDKs... this default is chosen for SDK/CLI/UI compatibility/clarity.",
      "number": 293,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:47.932Z"
    },
    {
      "summary": "Sorbet type checker is creating duplicate singleton methods on Temporal workflow definition classes, causing a RuntimeError. The issue occurs when using Sorbet runtime decorators on handler methods, and has been resolved in recent Sorbet releases.",
      "category": "bug",
      "subcategory": "type-checking-compatibility",
      "apis": [
        "workflow_signal"
      ],
      "components": [
        "workflow",
        "definition",
        "signal-handlers"
      ],
      "concepts": [
        "singleton-methods",
        "type-checking",
        "sorbet-runtime",
        "decorators",
        "method-override"
      ],
      "severity": "medium",
      "userImpact": "Users employing Sorbet for type checking encounter runtime errors that prevent workflow definitions with signal handlers from loading.",
      "rootCause": "Sorbet runtime adds singleton methods when decorating instance methods, conflicting with Temporal's own singleton method handling in the Definition class.",
      "proposedFix": "Detect when Sorbet is adding a method and ignore it, or await fixes in Sorbet that prevent duplicate singleton method creation.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Resolved in recent Sorbet releases (sorbet/sorbet#8592 and sorbet/sorbet#9084 were fixed upstream)",
      "related": [
        8592,
        9084
      ],
      "keyQuote": "Attempting to override Temporal-defined class definition method (RuntimeError)",
      "number": 292,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:50.348Z"
    },
    {
      "summary": "Child workflows invoked via execute_child_workflow don't display as relationships in the parent workflow or dashboard UI, despite running and completing. They only appear in the parent's execution history.",
      "category": "bug",
      "subcategory": "child-workflows",
      "apis": [
        "execute_child_workflow",
        "start_child_workflow"
      ],
      "components": [
        "workflow-execution",
        "child-workflow-tracking",
        "dashboard-ui",
        "parent-close-policy"
      ],
      "concepts": [
        "parent-child-relationships",
        "workflow-visibility",
        "concurrent-execution",
        "abandon-policy",
        "workflow-completion-timing",
        "future-handling"
      ],
      "severity": "high",
      "userImpact": "Users cannot track or monitor child workflow relationships when using execute_child_workflow with abandon parent_close_policy, breaking observability of hierarchical workflows.",
      "rootCause": "Child workflows started but not fully accepted by server before parent workflow completes, causing them to become no-ops or not register as relationships.",
      "proposedFix": "Wait for child workflow start requests to be accepted by server before parent completes using Future.all_of().wait() to ensure all child starts are properly registered.",
      "workaround": "Add a sleep delay after invoking child workflows and before parent returns, allowing sufficient time for child workflow starts to be accepted.",
      "resolution": "fixed",
      "resolutionDetails": "Solution provided in comments: use Future.all_of to wait for all child workflow start requests to complete before parent workflow finishes.",
      "related": [],
      "keyQuote": "Future doesn't have a 'started', you'd wait until the future completes which represents start completing",
      "number": 290,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:49.922Z"
    },
    {
      "summary": "The temporalio Ruby gem fails to install from source in Docker on aarch64-linux due to Cargo manifest issues with the temporalio_bridge library. The issue occurs despite the correct platform being available, suggesting a dependency resolution problem.",
      "category": "bug",
      "subcategory": "gem-installation",
      "apis": [],
      "components": [
        "gem-build",
        "native-extension",
        "cargo-builder"
      ],
      "concepts": [
        "gem-installation",
        "docker",
        "aarch64-linux",
        "native-extension",
        "cargo-manifest",
        "platform-resolution"
      ],
      "severity": "high",
      "userImpact": "Users trying to install the temporalio gem in Docker containers on aarch64-linux are blocked from using the SDK due to build failures.",
      "rootCause": "Bundler is selecting the source gem instead of the aarch64-linux prebuilt gem, causing Cargo to fail when parsing the manifest because the temporalio_bridge library cannot be found in the source build.",
      "proposedFix": null,
      "workaround": "Add aarch64-linux to the PLATFORMS section in Gemfile.lock to force selection of the prebuilt gem.",
      "resolution": "wontfix",
      "resolutionDetails": "The gem maintainers clarified that building from source is not supported and prebuilt gems are available; the workaround of adding the platform to Gemfile.lock solved the user's issue.",
      "related": [],
      "keyQuote": "This gem does not support building from a source gem at this time... I wonder why it is getting the source gem instead of the aarch64-linux one.",
      "number": 289,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:32.467Z"
    },
    {
      "summary": "Add support for single-page fetching in list workflows API. Currently the enumerable doesn't allow providing a next page token to fetch subsequent pages on demand; the request is to add a dedicated single-page method to enable manual pagination control.",
      "category": "feature",
      "subcategory": "workflow-listing",
      "apis": [
        "list_workflows"
      ],
      "components": [
        "client",
        "enumerable",
        "pagination"
      ],
      "concepts": [
        "pagination",
        "next_page_token",
        "single-page",
        "manual_traversal",
        "lazy_loading",
        "api_design"
      ],
      "severity": "medium",
      "userImpact": "Users cannot manually control pagination when listing workflows; they must either fetch all at once or use automatic enumerable traversal.",
      "rootCause": "Current enumerable design doesn't expose page token handling for manual pagination control.",
      "proposedFix": "Create a dedicated `list_workflow_page` method with optional page_size and next_page_token parameters, returning a ListWorkflowPage object containing items and next page token, while refactoring `list_workflows` to use this internally.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Resolved by implementing a separate paginated method approach (#285) rather than dual return types.",
      "related": [
        285
      ],
      "keyQuote": "Have two possible return types for `#list_workflows`, depending on whether `page_size` is `nil` or not... Define a separate method for the paginated version",
      "number": 288,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:35.122Z"
    },
    {
      "summary": "Feature request to implement environment configuration for the Ruby SDK, following the pattern established in the features repository and the external client configuration proposal.",
      "category": "feature",
      "subcategory": "configuration",
      "apis": [],
      "components": [
        "client",
        "configuration",
        "environment"
      ],
      "concepts": [
        "environment-configuration",
        "external-client",
        "sdk-configuration",
        "standardization"
      ],
      "severity": "medium",
      "userImpact": "Users need a standardized way to configure the Ruby SDK through environment variables, improving consistency across Temporal SDKs.",
      "rootCause": null,
      "proposedFix": "Implement environment configuration support as outlined in the external client configuration proposal",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature request closed, likely completed based on the proposal reference",
      "related": [
        441
      ],
      "keyQuote": "See https://github.com/temporalio/features/issues/441 and https://github.com/temporalio/proposals/blob/master/all-sdk/external-client-configuration.md",
      "number": 287,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:32.423Z"
    },
    {
      "summary": "Feature request to provide access to the last result and last failure information in workflows, allowing workflows to retrieve historical execution outcomes from previous runs.",
      "category": "feature",
      "subcategory": "workflow-execution",
      "apis": [],
      "components": [
        "workflow-engine",
        "workflow-context"
      ],
      "concepts": [
        "workflow-state",
        "execution-history",
        "error-handling",
        "retry-logic",
        "persistence"
      ],
      "severity": "medium",
      "userImpact": "Workflows would be able to access and act upon the results and failures from previous executions, enabling more sophisticated retry and recovery patterns.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented; references feature request #635 in temporalio/features repository",
      "related": [
        635
      ],
      "keyQuote": "Provide last result and last failure to workflows",
      "number": 281,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:15.103Z"
    },
    {
      "summary": "Activity outbound heartbeat implementation incorrectly accesses the current activity context to get task token and activity info. This is problematic because heartbeat may be happening in a different thread/fiber, leading to potential race conditions or incorrect context access.",
      "category": "bug",
      "subcategory": "activity-heartbeat",
      "apis": [],
      "components": [
        "activity-executor",
        "heartbeat",
        "context-management"
      ],
      "concepts": [
        "threading",
        "concurrency",
        "context-isolation",
        "async-execution",
        "task-token"
      ],
      "severity": "high",
      "userImpact": "Users cannot properly implement heartbeating in activities that run on different threads/fibers, blocking production deployments.",
      "rootCause": "The heartbeat implementation uses `current` to access activity context, but this is unsafe when heartbeat executes on a different thread/fiber than the activity itself.",
      "proposedFix": "Task token should be provided through a different mechanism rather than accessing the current context during heartbeat.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was fixed and gem artifacts were prepared for release; users could build from source or wait for official release.",
      "related": [
        271
      ],
      "keyQuote": "heartbeat may be happening in a different thread/fiber",
      "number": 279,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:19.508Z"
    },
    {
      "summary": "Ruby SDK incorrectly compares workflow update stage enum as integer instead of symbol, causing ArgumentError. The comparison needs to resolve the protobuf enum value before comparison.",
      "category": "bug",
      "subcategory": "workflow-update",
      "apis": [
        "StartWorkflowUpdate",
        "ExecuteUpdate"
      ],
      "components": [
        "client-implementation",
        "workflow-handle",
        "protobuf-enum-handling"
      ],
      "concepts": [
        "enum-comparison",
        "type-mismatch",
        "protobuf-integration",
        "workflow-lifecycle",
        "symbol-handling"
      ],
      "severity": "high",
      "userImpact": "Users cannot start or execute workflow updates because the SDK crashes with an ArgumentError when comparing enum values.",
      "rootCause": "Protobuf enums in Ruby are symbols, not integers, but the code compares them as integers using the >= operator against a numeric value.",
      "proposedFix": "Use Api::Enums::V1::UpdateWorkflowExecutionLifecycleStage.resolve(resp.stage) to properly convert the enum before comparison.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The enum comparison logic was updated to properly resolve protobuf enum values before numeric comparison.",
      "related": [],
      "keyQuote": "enums inside protos may be symbols instead of integers, so we were improperly comparing as if it was an integer",
      "number": 278,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:17.545Z"
    },
    {
      "summary": "Test environment returns nil for workflow results when child workflows are executed within futures, with suspected race condition causing intermittent failures.",
      "category": "bug",
      "subcategory": "test-framework",
      "apis": [
        "execute_workflow"
      ],
      "components": [
        "test-environment",
        "worker",
        "child-workflow-executor"
      ],
      "concepts": [
        "race-condition",
        "workflow-result",
        "child-workflows",
        "future-execution",
        "test-isolation"
      ],
      "severity": "medium",
      "userImpact": "Users cannot reliably test workflows that spawn child workflows in the Ruby SDK test environment, breaking test reliability.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "Reporter was unable to reproduce with a minimal example and closed the issue.",
      "related": [],
      "keyQuote": "With a child workflow, the following code has `result` nil, even if you try to wait for workflow handle. This happens often, but not all the time, implying a race condition?",
      "number": 276,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:04.413Z"
    },
    {
      "summary": "Feature request to investigate and validate fork behavior in Ruby SDK. Core-based SDK objects cannot be used across forks, requiring documentation and validation that Temporal objects and clients are not reused post-fork, with consideration for eager runtime/client PID validation.",
      "category": "feature",
      "subcategory": "fork-behavior",
      "apis": [],
      "components": [
        "runtime",
        "client",
        "worker",
        "core-bindings"
      ],
      "concepts": [
        "fork",
        "process-isolation",
        "runtime-lifecycle",
        "client-creation",
        "post-fork-validation",
        "process-id"
      ],
      "severity": "medium",
      "userImpact": "Users working with fork-based servers (Rails, Puma) need clear guidance on whether Temporal objects are safe to use across forks and what patterns are supported.",
      "rootCause": "Core-based SDKs maintain internal state tied to specific processes, making them unsafe for cross-fork reuse without explicit process ID tracking and validation.",
      "proposedFix": "Store process ID on runtime and validate on every client and worker call that they execute on the same PID as the runtime that created them, raising clear exceptions if violated.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Runtime PID validation implemented to detect and prevent cross-fork usage with clear error messages.",
      "related": [],
      "keyQuote": "it is best that we store the process ID on the runtime and make sure every client call and every worker call are on the same PID as the runtime.",
      "number": 273,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:01.641Z"
    },
    {
      "summary": "Time#iso8601 method is incorrectly flagged as an illegal call in workflows due to internal calls that access current time. The SDK needs a more sophisticated illegal call detection system that can skip checking based on call stack context, and also support Time#initialize with deterministic parameters.",
      "category": "bug",
      "subcategory": "workflow-determinism",
      "apis": [],
      "components": [
        "illegal_call_tracer",
        "workflow_instance",
        "time_handling"
      ],
      "concepts": [
        "determinism",
        "illegal_calls",
        "stack_trace_filtering",
        "time_methods",
        "workflow_constraints"
      ],
      "severity": "medium",
      "userImpact": "Users cannot use Time#iso8601 or Time#initialize with parameters in workflows, breaking datetime serialization and deserialization workflows.",
      "rootCause": "The illegal call tracer cannot distinguish between user-initiated Time method calls and internal time access within those methods, causing false positives when Ruby's stdlib accesses current time internally.",
      "proposedFix": "Implement an abstract 'check illegal' class that allows workflow-stateful stack-aware checking to skip validation further down the call stack. Support Time#initialize detection with parameter inspection via TracePoint binding.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Enhanced illegal call detection with stack-aware skipping and parameter inspection for deterministic Time method calls.",
      "related": [],
      "keyQuote": "We need to find some way to exclude this... Put it behind a very generic 'check illegal' abstract class so others can have implementations.",
      "number": 272,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:49:04.438Z"
    },
    {
      "summary": "Add support for payload conversion hints in the Ruby SDK, allowing developers to specify type information for deserialization of activity/workflow inputs and outputs, signals, queries, and updates.",
      "category": "feature",
      "subcategory": "payload-conversion",
      "apis": [
        "from_payload",
        "from_payloads"
      ],
      "components": [
        "payload-converter",
        "data-converter",
        "activity-definition",
        "workflow-definition"
      ],
      "concepts": [
        "type-hints",
        "deserialization",
        "payload-conversion",
        "type-information",
        "serialization"
      ],
      "severity": "medium",
      "userImpact": "Developers can provide type hints to improve payload deserialization accuracy for activities, workflows, signals, queries, and updates.",
      "rootCause": null,
      "proposedFix": "Add hint methods to activities/workflows, add input_hints/output_hint to signals/queries/updates, add hint/hints parameters to PayloadConverter and DataConverter methods, and explore other deserialization contexts like memo and heartbeat details.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented with support for payload conversion hints via hint parameters and definition methods, with decision to defer native Struct/Data type support to future work.",
      "related": [],
      "keyQuote": "Add `activity_input_hint`, `activity_output_hint`, `workflow_input_hint`, and `workflow_output_hint` definition methods to activities/workflows",
      "number": 271,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:49.507Z"
    },
    {
      "summary": "Create a high-level client for Ruby SDK to manage worker deployments and control plane operations, following patterns established in the Go SDK implementation.",
      "category": "feature",
      "subcategory": "worker-versioning",
      "apis": [],
      "components": [
        "worker",
        "control-plane",
        "deployment"
      ],
      "concepts": [
        "worker-versioning",
        "deployment-management",
        "high-level-client",
        "control-plane"
      ],
      "severity": "medium",
      "userImpact": "Ruby SDK users need a high-level client API to manage worker deployments and versioning, currently unavailable in the Ruby implementation.",
      "rootCause": null,
      "proposedFix": "Implement worker versioning high-level client for Ruby SDK, modeling it after the Go SDK implementation.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Create the high-level client for control plane operations concerning worker deployments. See the Go one as an example",
      "number": 270,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:49.694Z"
    },
    {
      "summary": "Intermittent test failure in test_metric_basics where expected metric count of 1 was receiving 2 instead. Root cause identified as OpenTelemetry metrics issue with incorrect attributes in Prometheus output.",
      "category": "bug",
      "subcategory": "testing",
      "apis": [],
      "components": [
        "metrics",
        "opentelemetry",
        "runtime",
        "test-framework"
      ],
      "concepts": [
        "flake",
        "test-stability",
        "metrics-collection",
        "prometheus",
        "attributes",
        "otel"
      ],
      "severity": "low",
      "userImpact": "Tests occasionally fail intermittently in CI, reducing confidence in test suite reliability and blocking deployments.",
      "rootCause": "OpenTelemetry was putting strange metrics in Prometheus with incorrect attributes compared to what was recorded",
      "proposedFix": null,
      "workaround": "Commenting out the problematic metric validation temporarily until OpenTelemetry upgrade",
      "resolution": "fixed",
      "resolutionDetails": "Issue resolved after Core upgrade; has not recurred since the upgrade",
      "related": [
        862
      ],
      "keyQuote": "There is something strange with OTel where it is putting some strange metrics up in Prometheus that don't have the attributes right as we recorded.",
      "number": 268,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:47.532Z"
    },
    {
      "summary": "Rails lazy loading during development and testing causes IO errors in workflows because activity classes are lazily loaded, violating Temporal's no-IO-in-workflow constraint. Documentation is needed to clarify how to configure Rails to handle this safely, similar to existing Single-Table Inheritance guidance.",
      "category": "docs",
      "subcategory": "rails-integration",
      "apis": [],
      "components": [
        "rails-integration",
        "activity-loader",
        "workflow-execution"
      ],
      "concepts": [
        "lazy-loading",
        "rails-autoloading",
        "io-restrictions",
        "workflow-constraints",
        "bootsnap",
        "zeitwerk"
      ],
      "severity": "medium",
      "userImpact": "Rails developers cannot easily test workflows during development/testing due to IO errors from lazy-loaded activity classes.",
      "rootCause": "Rails lazy loading by default during dev/test triggers activity class loading via bootsnap/zeitwerk, which performs file IO that violates Temporal's no-IO-in-workflow constraint.",
      "proposedFix": "Add documentation similar to Rails STI guide explaining how to configure eager loading or use Unsafe.illegal_call_tracing_disabled for Rails activity loading.",
      "workaround": "Can wrap lazy-loaded code in Temporalio::Workflow::Unsafe.illegal_call_tracing_disabled block to suppress IO restrictions.",
      "resolution": "fixed",
      "resolutionDetails": "Documentation added to clarify Rails lazy loading configuration for workflow testing.",
      "related": [],
      "keyQuote": "Cannot access File path from inside a workflow. If this is known to be safe, the code can be run in a Temporalio::Workflow::Unsafe.illegal_call_tracing_disabled block.",
      "number": 267,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:33.962Z"
    },
    {
      "summary": "Test flake in test_queue where first workflow can complete before the second starts, causing assertion failures on workflow IDs. Issue appears resolved after Core upgrade but may recur.",
      "category": "bug",
      "subcategory": "test-framework",
      "apis": [],
      "components": [
        "worker",
        "task-queue",
        "multi-runner"
      ],
      "concepts": [
        "test-flake",
        "workflow-execution",
        "task-queue-routing",
        "race-condition",
        "sticky-worker"
      ],
      "severity": "medium",
      "userImpact": "Causes intermittent CI test failures that block development workflows.",
      "rootCause": "Sticky worker unavailability causing race condition where first workflow completes before second workflow starts, leading to unexpected workflow ID reuse.",
      "proposedFix": "Add failed-only ID reuse policy to the last execute_workflow call in the test.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue not reproduced after Temporal Core upgrade; closed pending reoccurrence.",
      "related": [
        263
      ],
      "keyQuote": "sticky worker unavailable, please use original task queue.",
      "number": 264,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:36.028Z"
    },
    {
      "summary": "Feature request to use exception full messages (including stack traces) in workflow and activity task failure logs instead of just logging the exception object. This would improve debugging visibility.",
      "category": "feature",
      "subcategory": "logging",
      "apis": [],
      "components": [
        "activity-executor",
        "workflow-task-executor",
        "logging"
      ],
      "concepts": [
        "exception-handling",
        "logging",
        "debugging",
        "stack-traces",
        "error-reporting"
      ],
      "severity": "low",
      "userImpact": "Users would have better visibility into workflow and activity failures through more detailed log messages including stack traces.",
      "rootCause": null,
      "proposedFix": "Use the full_message field when logging exceptions for activities and workflow task failures to include stack trace information.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "After review, determined that the SDK is already logging the full activity and workflow task failure by sending the exception as a separate log statement which shows the stack trace.",
      "related": [],
      "keyQuote": "After review, it looks like we are logging the full activity and workflow task failure by sending the exception as a separate log statement which seems to show the stack trace.",
      "number": 261,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:33.653Z"
    },
    {
      "summary": "The `auto_time_skipping_disabled` method in the Ruby SDK test framework incorrectly disables auto time skipping after exiting the block, causing tests to timeout when attempting to resume normal time progression after the block completes.",
      "category": "bug",
      "subcategory": "test-framework",
      "apis": [
        "start_workflow",
        "query",
        "update"
      ],
      "components": [
        "testing",
        "workflow-environment",
        "time-skipping"
      ],
      "concepts": [
        "time-skipping",
        "testing",
        "block-management",
        "state-restoration",
        "test-isolation"
      ],
      "severity": "high",
      "userImpact": "Tests that need to temporarily disable auto time skipping timeout and fail, blocking users from writing comprehensive workflow tests.",
      "rootCause": "The `already_disabled` variable initialization in `auto_time_skipping_disabled` is not properly negated, causing the time skipping state to not be correctly restored after the block exits.",
      "proposedFix": "Negate the `already_disabled` variable initialization in the `auto_time_skipping_disabled` method.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "PR was accepted and merged with the fix to properly handle the already_disabled flag negation.",
      "related": [],
      "keyQuote": "I believe the initialization of `already_disabled` in `auto_time_skipping_disabled` is the problem. Just need to negate it.",
      "number": 259,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:20.255Z"
    },
    {
      "summary": "Workflow info start time in Ruby SDK should reflect the workflow's actual start time, not the first task's start time. This is a breaking change opportunity for Ruby since it hasn't reached GA yet.",
      "category": "bug",
      "subcategory": "workflow-info",
      "apis": [
        "WorkflowInfo"
      ],
      "components": [
        "workflow-info",
        "runtime"
      ],
      "concepts": [
        "workflow-lifecycle",
        "timing",
        "backwards-compatibility",
        "sdk-consistency"
      ],
      "severity": "medium",
      "userImpact": "Users get incorrect workflow start time information, which could cause logic errors in time-based decisions or monitoring.",
      "rootCause": "Workflow info start time is incorrectly set to first task start time instead of workflow start time",
      "proposedFix": "Change workflow info start time to use the workflow's actual start time",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Fixed by updating workflow info start time to reflect workflow start time instead of first task start time",
      "related": [
        849,
        462
      ],
      "keyQuote": "Change the workflow info start time to be the workflow's start time. In Python and .NET we have backwards compatibility constraints",
      "number": 255,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:17.838Z"
    },
    {
      "summary": "Ruby SDK needs support for activity reset functionality, similar to what's available in other Temporal SDKs. This feature is partially implemented in PR #283 but requires a released dev server and test confirmation before being marked complete.",
      "category": "feature",
      "subcategory": "activity-reset",
      "apis": [],
      "components": [
        "activity-executor",
        "ruby-sdk",
        "test-framework"
      ],
      "concepts": [
        "activity-reset",
        "activity-state",
        "testing",
        "feature-parity",
        "dev-server"
      ],
      "severity": "medium",
      "userImpact": "Ruby SDK users cannot reset activities during testing and development, limiting testing capabilities compared to other Temporal SDKs.",
      "rootCause": null,
      "proposedFix": "Implement activity reset functionality in the Ruby SDK, with implementation partially done in PR #283",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Partially implemented in PR #283; awaiting released dev server with functionality and test confirmation",
      "related": [
        283,
        620
      ],
      "keyQuote": "Half of this is done in #283, but not marking this complete until we can have a test confirming behavior",
      "number": 254,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:16.566Z"
    },
    {
      "summary": "Unregistered local activities should cause workflow task failure in Ruby SDK. This is a bug where the SDK is not properly validating and failing when an unregistered local activity is invoked.",
      "category": "bug",
      "subcategory": "local-activities",
      "apis": [
        "ExecuteLocalActivity"
      ],
      "components": [
        "worker",
        "activity-executor",
        "workflow-task"
      ],
      "concepts": [
        "activity-registration",
        "validation",
        "workflow-execution",
        "error-handling",
        "task-failure"
      ],
      "severity": "high",
      "userImpact": "Users can unknowingly execute unregistered local activities without getting proper failure feedback, leading to silent errors and incorrect workflow behavior.",
      "rootCause": "Ruby SDK is not validating that local activities are registered before execution and failing the workflow task when they are not.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Workflow task now properly fails when attempting to execute an unregistered local activity.",
      "related": [
        221
      ],
      "keyQuote": "Unregistered Local Activity should fail Workflow Task",
      "number": 253,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:02.079Z"
    },
    {
      "summary": "OpenTelemetry integration is using incorrect timestamp conversion to nanoseconds, causing failures with OTLP. The fix requires using Time objects directly from Temporalio::Workflow.now instead of converting to nanos.",
      "category": "bug",
      "subcategory": "observability",
      "apis": [],
      "components": [
        "open-telemetry",
        "contrib"
      ],
      "concepts": [
        "timestamps",
        "observability",
        "telemetry",
        "OTLP",
        "instrumentation"
      ],
      "severity": "high",
      "userImpact": "OpenTelemetry integration fails when exporting traces via OTLP due to incorrect timestamp handling.",
      "rootCause": "Timestamp values are being converted to nanoseconds when they should remain as Time objects from Temporalio::Workflow.now",
      "proposedFix": "Change lines 458-464 in temporalio/lib/temporalio/contrib/open_telemetry.rb to use Time objects directly without nanos conversion",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was resolved by updating the OpenTelemetry timestamp handling to use Time objects directly instead of converting to nanoseconds",
      "related": [
        1841
      ],
      "keyQuote": "need to change to just use the `Time` from `Temporalio::Workflow.now` as the timestamp, do not convert to nanos",
      "number": 252,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:05.404Z"
    },
    {
      "summary": "Add a way to disable implicit durable timers in Ruby SDK workflows, particularly for use with OpenTelemetry simple span processors that need non-durable timeouts. Implementation requires `Temporalio::Workflow::Unsafe.implicit_durable_timers_disabled` helper and integration with OTel span creation.",
      "category": "feature",
      "subcategory": "durable-timers",
      "apis": [],
      "components": [
        "workflow",
        "timeout",
        "opentelemetry",
        "span-processor"
      ],
      "concepts": [
        "durable-timers",
        "opentelemetry",
        "span-processing",
        "timeout-behavior",
        "workflow-execution",
        "telemetry-integration"
      ],
      "severity": "medium",
      "userImpact": "Users cannot currently use OpenTelemetry simple span processors in workflows because the implicit durable timeouts conflict with non-durable timeout requirements.",
      "rootCause": "Implicit durable timers are always enabled by default, but some telemetry use cases (simple span processors) require non-durable timeouts which are incompatible.",
      "proposedFix": "Create `Temporalio::Workflow::Unsafe.implicit_durable_timers_disabled` helper to allow disabling implicit durable timers, and integrate with OTel span creation/recording.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented to allow disabling implicit durable timers for compatibility with OpenTelemetry simple span processors.",
      "related": [],
      "keyQuote": "we need `Temporalio::Workflow::Unsafe.implicit_durable_timers_disabled` helper",
      "number": 251,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:48:01.004Z"
    },
    {
      "summary": "Feature request to warn when the server-provided task start time differs significantly from when the SDK begins processing the task. Request was declined as too niche.",
      "category": "feature",
      "subcategory": "task-processing",
      "apis": [],
      "components": [
        "task-processor",
        "server-communication",
        "timing"
      ],
      "concepts": [
        "task-timing",
        "time-synchronization",
        "server-client-sync",
        "task-start-detection",
        "debugging",
        "diagnostics"
      ],
      "severity": "low",
      "userImpact": "Users would receive warnings when task timing discrepancies occur, helping identify timing-related issues during task execution.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "Declined by maintainers as the feature was deemed too niche for the use cases it would serve.",
      "related": [
        616
      ],
      "keyQuote": "We're not gonna do this. Too niche.",
      "number": 250,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:48.429Z"
    },
    {
      "summary": "Feature request to display the retry policy on activity information in the Ruby SDK, referenced from a cross-SDK features issue.",
      "category": "feature",
      "subcategory": "activity-info",
      "apis": [
        "ActivityInfo"
      ],
      "components": [
        "activity-executor",
        "activity-info",
        "retry-policy"
      ],
      "concepts": [
        "retry-policy",
        "activity-metadata",
        "configuration-visibility",
        "developer-experience"
      ],
      "severity": "low",
      "userImpact": "Users cannot easily inspect the retry policy configuration for activities at runtime, requiring them to reference code or configuration files.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Implemented to show retry policy on activity info, consistent with cross-SDK feature request",
      "related": [
        615
      ],
      "keyQuote": "Show retry policy on activity info",
      "number": 248,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:48.994Z"
    },
    {
      "summary": "Feature request to evaluate explicit Rails integration/gem for the Ruby SDK, including Rails config/DI, code generation, ActiveJob integration, and ActiveModel/ActiveRecord support. After research and sample development, the team concluded there isn't enough substantial Rails-specific integration needed to justify an explicit gem beyond documentation and samples.",
      "category": "feature",
      "subcategory": "rails-integration",
      "apis": [],
      "components": [
        "rails-integration",
        "code-generation",
        "active-model-support",
        "active-record-support",
        "dependency-injection"
      ],
      "concepts": [
        "framework-integration",
        "dependency-injection",
        "orm-support",
        "code-generation",
        "active-job",
        "rails-context",
        "data-conversion"
      ],
      "severity": "low",
      "userImpact": "Ruby developers using Rails can follow the sample implementation and documentation for Temporal integration without requiring an explicit SDK gem.",
      "rootCause": null,
      "proposedFix": "Provide sample Rails application and documentation on using Temporal with Rails, focusing on ActiveModel/ActiveRecord conversion support.",
      "workaround": "Use plain Ruby SDK without Rails-specific integration; manual client initialization and setup.",
      "resolution": "wontfix",
      "resolutionDetails": "Team determined that insufficient Rails-specific integration points exist to justify an explicit gem. A sample implementation at https://github.com/temporalio/samples-ruby/tree/main/rails_app was created to demonstrate integration without requiring SDK-level support.",
      "related": [
        4
      ],
      "keyQuote": "Rails integration has been demonstrated in a sample at https://github.com/temporalio/samples-ruby/tree/main/rails_app, but there is nothing substantial enough over plain Ruby use to justify an explicit integration",
      "number": 246,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:47.179Z"
    },
    {
      "summary": "Ruby SDK needs to implement application failure logging and metrics behavior according to ApplicationErrorCategory. This requires waiting for core SDK implementation to provide the necessary foundation.",
      "category": "feature",
      "subcategory": "error-handling",
      "apis": [],
      "components": [
        "error-handler",
        "logging",
        "metrics"
      ],
      "concepts": [
        "application-errors",
        "error-category",
        "logging",
        "metrics",
        "failure-handling"
      ],
      "severity": "medium",
      "userImpact": "Users will have standardized logging and metrics behavior for application failures consistent with the ApplicationErrorCategory specification.",
      "rootCause": null,
      "proposedFix": "Apply corresponding logging behavior for ApplicationErrorCategory once core SDK provides the foundation.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Implementation completed following core SDK foundation work.",
      "related": [
        614,
        897
      ],
      "keyQuote": "Core-based SDKs only need to apply corresponding logging behaviour, core handles metrics.",
      "number": 242,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:29.828Z"
    },
    {
      "summary": "Activities that are paused should have their heartbeating interrupted to prevent unnecessary heartbeat signals while activities are suspended.",
      "category": "bug",
      "subcategory": "activity-heartbeat",
      "apis": [],
      "components": [
        "activity-executor",
        "heartbeat-manager",
        "pause-handler"
      ],
      "concepts": [
        "heartbeat",
        "activity-pause",
        "interruption",
        "activity-lifecycle",
        "resource-management"
      ],
      "severity": "medium",
      "userImpact": "Users experience unnecessary heartbeat signals being sent for paused activities, wasting resources and potentially causing confusion in activity monitoring.",
      "rootCause": "The heartbeating mechanism does not check or respect the pause state of activities before sending heartbeats.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Heartbeating activities are now properly interrupted when activities are paused.",
      "related": [
        602
      ],
      "keyQuote": "Heartbeating activities should be interrupted when the activities are paused.",
      "number": 241,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:33.105Z"
    },
    {
      "summary": "Allow io_wait-based fiber calls within a special unsafe context in the Ruby SDK. Currently blocked by a TODO, this feature would enable controlled I/O operations in workflows similar to the existing illegal_call_tracing_disabled helper.",
      "category": "feature",
      "subcategory": "fiber-scheduler",
      "apis": [],
      "components": [
        "scheduler",
        "fiber",
        "workflow-instance"
      ],
      "concepts": [
        "io-operations",
        "fiber-scheduling",
        "unsafe-context",
        "workflow-constraints",
        "async-io"
      ],
      "severity": "low",
      "userImpact": "Users who need to perform I/O operations within workflows would have a documented, controlled way to do so through an explicit unsafe context.",
      "rootCause": null,
      "proposedFix": "Implement Temporalio::Workflow::Unsafe.io_enabled helper that allows io_wait fiber scheduler calls to pass through when enabled, with clear errors when used outside the context.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to allow io_wait fiber calls within an unsafe context similar to illegal_call_tracing_disabled.",
      "related": [],
      "keyQuote": "Make a new `Temporalio::Workflow::Unsafe.io_enabled` helper (akin to `illegal_call_tracing_disabled`) and if in that context, allow `io_wait` fiber scheduler calls to go through",
      "number": 239,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:33.083Z"
    },
    {
      "summary": "Feature request to add serialization context support for codecs and converters in the Ruby SDK, aligned with cross-SDK effort to standardize this capability including Nexus support.",
      "category": "feature",
      "subcategory": "serialization",
      "apis": [],
      "components": [
        "codec",
        "converter",
        "serialization"
      ],
      "concepts": [
        "serialization-context",
        "codec-configuration",
        "data-conversion",
        "nexus-integration",
        "cross-sdk-feature"
      ],
      "severity": "medium",
      "userImpact": "Users will be able to pass context information to custom codecs and converters, enabling more sophisticated serialization strategies.",
      "rootCause": null,
      "proposedFix": "Implement serialization context support as specified in the cross-SDK features issue #434, including Nexus support per issue #678.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        434,
        678
      ],
      "keyQuote": "Make sure to include nexus per https://github.com/temporalio/features/issues/678",
      "number": 238,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:15.180Z"
    },
    {
      "summary": "Add support for the new Worker Versioning API in the Ruby SDK through workflow annotations. This involves implementing design specifications documented in a cross-SDK design document, with Go SDK as the reference implementation.",
      "category": "feature",
      "subcategory": "worker-versioning",
      "apis": [
        "Worker",
        "Workflow"
      ],
      "components": [
        "worker",
        "workflow-decorator",
        "versioning-api"
      ],
      "concepts": [
        "versioning",
        "compatibility",
        "sdk-parity",
        "annotations",
        "api-support"
      ],
      "severity": "medium",
      "userImpact": "Users can adopt the new Worker Versioning API in Ruby, enabling safe deployment strategies and maintaining compatibility across workflow versions.",
      "rootCause": null,
      "proposedFix": "Implement workflow annotations following the cross-SDK design specification referenced in the feature document, aligned with Go SDK implementation.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to support the new Worker Versioning API with appropriate annotations for the Ruby SDK.",
      "related": [
        548
      ],
      "keyQuote": "We need to add annotations to workflows to support the new versioning APIs. Refer to temporalio/features#548 for the Go equivalents.",
      "number": 237,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:18.734Z"
    },
    {
      "summary": "Feature request to add saga pattern implementation to the Ruby SDK, similar to other Temporal SDKs. The maintainers declined, explaining that sagas are a pattern rather than a utility, and different use cases require different approaches.",
      "category": "feature",
      "subcategory": "saga-pattern",
      "apis": [
        "ExecuteActivity"
      ],
      "components": [
        "workflow",
        "activity-executor",
        "error-handling"
      ],
      "concepts": [
        "saga-pattern",
        "compensation",
        "error-recovery",
        "workflow-orchestration",
        "activity-sequencing"
      ],
      "severity": "low",
      "userImpact": "Users can implement saga patterns directly in their workflows using standard Temporal APIs rather than relying on a built-in utility.",
      "rootCause": "Saga is a pattern rather than a universal utility - different users need different compensation strategies (concurrent vs sequential, different error handling approaches).",
      "proposedFix": "Implement saga pattern manually in workflow code using activity sequencing and exception handling, as shown in the maintainer's example.",
      "workaround": "Use manual compensation activity sequencing with try-rescue blocks, as demonstrated in the maintainer's code example.",
      "resolution": "wontfix",
      "resolutionDetails": "Not planned as a built-in utility because the pattern is already supported through standard SDK capabilities. Pattern will instead be demonstrated in samples.",
      "related": [
        14
      ],
      "keyQuote": "saga is a pattern more than a utility...different people need different approaches (e.g. some want compensations concurrently, some want to collect compensation errors in different ways)",
      "number": 236,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:18.103Z"
    },
    {
      "summary": "Add a nightly smoke benchmark test for the Ruby SDK to ensure high performance remains stable, similar to existing benchmarks in the Python and .NET SDKs.",
      "category": "feature",
      "subcategory": "testing",
      "apis": [],
      "components": [
        "benchmark",
        "test-framework",
        "ci-pipeline"
      ],
      "concepts": [
        "performance",
        "regression-testing",
        "nightly-automation",
        "sanity-check",
        "code-quality"
      ],
      "severity": "low",
      "userImpact": "Ensures the Ruby SDK maintains performance standards through automated nightly testing.",
      "rootCause": null,
      "proposedFix": "Implement a nightly benchmark workflow similar to Python and .NET SDK workflows",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented and completed",
      "related": [],
      "keyQuote": "This is mostly a sanity check that high-performing Ruby works as expected.",
      "number": 233,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:00.256Z"
    },
    {
      "summary": "Implement Nexus support in the Temporal Ruby SDK following the feature specification defined in the cross-repository Nexus initiative.",
      "category": "feature",
      "subcategory": "nexus",
      "apis": [],
      "components": [
        "nexus",
        "ruby-sdk",
        "service-framework"
      ],
      "concepts": [
        "nexus",
        "interoperability",
        "service-mesh",
        "rpc",
        "temporal-integration"
      ],
      "severity": "medium",
      "userImpact": "Ruby SDK users will be able to use Nexus for service-to-service workflow communication once this implementation is complete.",
      "rootCause": null,
      "proposedFix": "Implement Nexus support in the Ruby SDK aligned with the specification in temporalio/features#609",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        609
      ],
      "keyQuote": "Alongside Nexus Ruby SDK, need Temporal-specific implementation in this SDK.",
      "number": 232,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:58.517Z"
    },
    {
      "summary": "User requests a point release of the Ruby SDK with relaxed protobuf version constraints that were merged weeks ago but not yet published to RubyGems. The published version is missing this fix, forcing users to build from source.",
      "category": "feature",
      "subcategory": "release-management",
      "apis": [],
      "components": [
        "rubygems-publishing",
        "dependency-management",
        "protobuf"
      ],
      "concepts": [
        "version-constraint",
        "dependency-resolution",
        "release-cycle",
        "backwards-compatibility"
      ],
      "severity": "medium",
      "userImpact": "Users cannot adopt the latest Ruby SDK on RubyGems due to strict protobuf version constraints, requiring workarounds like source builds.",
      "rootCause": "Merged protobuf version relaxation has not been released to RubyGems; pending features (OTel, metric buffer) delayed the point release.",
      "proposedFix": "Cut a new point release with the protobuf version relaxation and any pending features (OTel support, metric buffer).",
      "workaround": "Build Ruby SDK from source to get the relaxed protobuf constraints.",
      "resolution": "fixed",
      "resolutionDetails": "Point release was eventually published with the protobuf version relaxation and additional features (OTel, metric buffer).",
      "related": [],
      "keyQuote": "I can't switch to this because the version you've published to RubyGems doesn't have the relaxing on the protobuf version that you merged a few weeks ago.",
      "number": 229,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:47:03.395Z"
    },
    {
      "summary": "Add support for custom metric bucket sizes in the Ruby SDK by exposing histogram bucket overrides that were made available in sdk-core.",
      "category": "feature",
      "subcategory": "metrics",
      "apis": [],
      "components": [
        "metrics",
        "histogram",
        "instrumentation"
      ],
      "concepts": [
        "metrics",
        "observability",
        "histogram-buckets",
        "configuration",
        "customization"
      ],
      "severity": "low",
      "userImpact": "Users can customize histogram bucket sizes for metrics collection to better suit their monitoring requirements.",
      "rootCause": null,
      "proposedFix": "Expose histogram bucket overrides from sdk-core (as implemented in sdk-core PR #844) in the Ruby SDK.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented and the issue was closed.",
      "related": [
        606
      ],
      "keyQuote": "Need to expose histogram bucket overrides made available in https://github.com/temporalio/sdk-core/pull/844.",
      "number": 228,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:44.650Z"
    },
    {
      "summary": "Feature request to expose root workflow execution in the Ruby SDK, pending implementation of core SDK functionality and features specification.",
      "category": "feature",
      "subcategory": "workflow-execution",
      "apis": [],
      "components": [
        "workflow-execution",
        "ruby-sdk"
      ],
      "concepts": [
        "workflow-execution",
        "root-workflow",
        "execution-context",
        "sdk-api"
      ],
      "severity": "medium",
      "userImpact": "Users need access to root workflow execution information for advanced workflow patterns and debugging.",
      "rootCause": null,
      "proposedFix": "Implement root workflow execution exposure as specified in features/605 and sdk-core/881",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented after dependencies were resolved in core SDK and features specification",
      "related": [
        605,
        881
      ],
      "keyQuote": "Expose root workflow execution",
      "number": 227,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:47.154Z"
    },
    {
      "summary": "Add documentation and validation to disallow keyword arguments in activities, workflows, signals, queries, and updates, ensuring consistency with Temporal's positional-only parameter model across all SDKs.",
      "category": "feature",
      "subcategory": "validation-documentation",
      "apis": [
        "StartWorkflow",
        "ExecuteActivity"
      ],
      "components": [
        "workflow-definition",
        "activity-definition",
        "parameter-validation",
        "serialization"
      ],
      "concepts": [
        "keyword-arguments",
        "positional-parameters",
        "parameter-validation",
        "documentation",
        "api-consistency",
        "sdk-design"
      ],
      "severity": "medium",
      "userImpact": "Users may attempt to use keyword arguments in workflows/activities not realizing they are unsupported, leading to runtime failures or confusion.",
      "rootCause": "Temporal only supports positional parameters in its serialized form, and keyword arguments create ambiguity in parameter arity across different SDKs.",
      "proposedFix": "Add validation at workflow/activity/signal/query/update definition time with clear error messages, and document this restriction prominently in README.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was closed indicating the feature request was addressed with documentation and validation rules implemented.",
      "related": [
        255
      ],
      "keyQuote": "All Temporal SDKs only support positional parameters, and all Temporal SDKs strongly encourage a single parameter that is an object/dict that can have fields added.",
      "number": 226,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:47.954Z"
    },
    {
      "summary": "Request to implement custom slot suppliers in the Ruby SDK, similar to the existing Python implementation. This feature would allow users to provide custom logic for managing worker slot allocation.",
      "category": "feature",
      "subcategory": "worker-slots",
      "apis": [],
      "components": [
        "worker",
        "slot-management"
      ],
      "concepts": [
        "slot-supplier",
        "worker-configuration",
        "resource-allocation",
        "customization",
        "pool-management"
      ],
      "severity": "medium",
      "userImpact": "Users can customize slot supplier behavior to implement specialized resource allocation strategies for their workers.",
      "rootCause": null,
      "proposedFix": "Implement custom slot suppliers following the pattern established in the Python SDK (PR #690)",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented with comprehensive tests to verify slot info fields",
      "related": [
        672
      ],
      "keyQuote": "Support custom slot suppliers, e.g. like Python did",
      "number": 225,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:32.016Z"
    },
    {
      "summary": "Feature request to ensure built-in query responses in the Ruby SDK use \"RawValue\" format, aligning with the cross-SDK features specification.",
      "category": "feature",
      "subcategory": "queries",
      "apis": [
        "QueryHandler"
      ],
      "components": [
        "query-handler",
        "response-serialization"
      ],
      "concepts": [
        "queries",
        "raw-value",
        "response-format",
        "built-in-queries",
        "sdk-consistency"
      ],
      "severity": "low",
      "userImpact": "Users relying on built-in query responses will get consistent RawValue formatting across all Temporal SDKs.",
      "rootCause": null,
      "proposedFix": "Implement RawValue format for built-in query responses as specified in temporalio/features#604",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue closed after implementation of RawValue format for built-in queries",
      "related": [
        604
      ],
      "keyQuote": "Make sure built-in queries return a raw value",
      "number": 224,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:33.177Z"
    },
    {
      "summary": "Add a test to verify that workflows using randomness produce different values after reset-point resets. The test should run a workflow with random inputs to activities, reset at a midpoint, and confirm that pre-reset values remain the same while post-reset values differ.",
      "category": "feature",
      "subcategory": "test-framework",
      "apis": [],
      "components": [
        "workflow-replay",
        "test-utilities",
        "randomness-seed"
      ],
      "concepts": [
        "workflow-reset",
        "randomness",
        "determinism",
        "history-replay",
        "testing",
        "seed-management"
      ],
      "severity": "low",
      "userImpact": "Users need test coverage to ensure workflow resets properly update randomness seeds and produce different results after reset points.",
      "rootCause": null,
      "proposedFix": "Create a test workflow that executes activities with random-generated inputs, record the history, reset the workflow between two activities, re-execute, and assert that pre-reset values match but post-reset values differ.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Add a test that will confirm post-reset-point workflows have a different update seed.",
      "number": 222,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:31.403Z"
    },
    {
      "summary": "Add support for building the Ruby SDK from source during gem installation. Currently the source gem doesn't work, but the SDK could include necessary sdk-core components to enable building on `gem install --platform ruby` for users in obscure environments where pre-built gems aren't available.",
      "category": "feature",
      "subcategory": "gem-packaging",
      "apis": [],
      "components": [
        "gem-builder",
        "sdk-core-bindings",
        "installation-system"
      ],
      "concepts": [
        "source-distribution",
        "compilation",
        "platform-support",
        "dependency-management",
        "environment-compatibility"
      ],
      "severity": "low",
      "userImpact": "Users in environments without pre-built gem support can now build and install the SDK from source if Rust is available.",
      "rootCause": null,
      "proposedFix": "Include all necessary sdk-core components in the gem and add a smoke test that validates `gem install --platform ruby` can build successfully when Rust is available.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "we very well could include all the sdk-core stuff needed to build the entire SDK on gem install",
      "number": 218,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:17.727Z"
    },
    {
      "summary": "Add support for user metadata on workflows, activities, and timers in the Ruby SDK. This includes accepting optional static summary and details parameters when starting workflows, creating activities and timers, and implementing the __temporal_workflow_metadata query handler.",
      "category": "feature",
      "subcategory": "user-metadata",
      "apis": [
        "StartWorkflow",
        "SignalWithStart",
        "Schedule",
        "CreateChildWorkflow",
        "CreateTimer",
        "CreateActivity",
        "Query"
      ],
      "components": [
        "workflow-starter",
        "activity-creator",
        "timer-creator",
        "metadata-handler",
        "query-handler"
      ],
      "concepts": [
        "user-metadata",
        "workflow-visibility",
        "metadata-query",
        "static-summary",
        "static-details",
        "experimental-api"
      ],
      "severity": "medium",
      "userImpact": "Users can now attach descriptive metadata to workflows, activities, and timers to improve visibility and debugging of their temporal applications.",
      "rootCause": null,
      "proposedFix": "Implement metadata parameters across workflow creation APIs, activity/timer creation, and add __temporal_workflow_metadata query handler based on Go SDK reference implementation.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to match the Temporal features specification for user metadata support across all workflow creation patterns and activity/timer creation.",
      "related": [
        486
      ],
      "keyQuote": "Accept optional 'static summary' and 'static details' on all ways to start a workflow and populate user metadata with them",
      "number": 217,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:20.170Z"
    },
    {
      "summary": "Request to build and distribute musl-compatible gem for Ruby SDK to support Alpine Linux and other musl-based distributions.",
      "category": "feature",
      "subcategory": "packaging-distribution",
      "apis": [],
      "components": [
        "gem-packaging",
        "build-system",
        "platform-support"
      ],
      "concepts": [
        "musl-libc",
        "alpine-linux",
        "gem-distribution",
        "cross-platform-support",
        "binary-compatibility"
      ],
      "severity": "medium",
      "userImpact": "Users running on musl-based systems (Alpine Linux, etc.) cannot easily use pre-built gems and must compile from source.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue closed, likely implemented as part of gem packaging improvements",
      "related": [
        594
      ],
      "keyQuote": "See https://github.com/temporalio/features/issues/594",
      "number": 215,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:15.945Z"
    },
    {
      "summary": "Publish Ruby SDK documentation to ruby.temporal.io instead of relying on rubydoc.info, which is experiencing issues. This aligns Ruby docs hosting with other Temporal SDKs (dotnet, python, typescript) and clarifies the canonical documentation location.",
      "category": "docs",
      "subcategory": "documentation-hosting",
      "apis": [],
      "components": [
        "documentation",
        "website",
        "readme"
      ],
      "concepts": [
        "documentation-site",
        "hosting",
        "canonical-location",
        "user-experience",
        "discoverability",
        "reliability"
      ],
      "severity": "medium",
      "userImpact": "Users will have a more reliable and consistent documentation experience with a dedicated, well-maintained docs site integrated with other Temporal SDK documentation.",
      "rootCause": "rubydoc.info is experiencing issues and not ideal for hosting canonical documentation",
      "proposedFix": "Publish yard docs to ruby.temporal.io and update README to mark it as the canonical documentation location",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Implemented hosting of Ruby SDK documentation at ruby.temporal.io with updated README to reflect canonical location",
      "related": [],
      "keyQuote": "publish yard docs to ruby.temporal.io as we do with dotnet.temporal.io, python.temporal.io, and typescript.temporal.io",
      "number": 211,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:05.474Z"
    },
    {
      "summary": "Feature request to add support for attaching priority to workflows and activities in the Ruby SDK, similar to capabilities being implemented across Temporal SDKs.",
      "category": "feature",
      "subcategory": "priority-configuration",
      "apis": [],
      "components": [
        "workflow",
        "activity",
        "configuration"
      ],
      "concepts": [
        "priority",
        "workflow-configuration",
        "activity-configuration",
        "task-prioritization"
      ],
      "severity": "medium",
      "userImpact": "Users cannot currently assign priority levels to workflows and activities in the Ruby SDK, limiting task scheduling flexibility.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented to support priority annotations for workflows and activities",
      "related": [
        593
      ],
      "keyQuote": "Add support for attaching priority to workflows/activities",
      "number": 210,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:01.795Z"
    },
    {
      "summary": "Add explicit memoization support to the patched() API by introducing a `memoized` argument and delegating handling to Core for improved workflow behavior.",
      "category": "feature",
      "subcategory": "patching-api",
      "apis": [
        "patched",
        "deprecatePatch"
      ],
      "components": [
        "patching-system",
        "core-delegation",
        "api-design"
      ],
      "concepts": [
        "memoization",
        "patching",
        "backward-compatibility",
        "core-integration",
        "workflow-behavior",
        "api-enhancement"
      ],
      "severity": "low",
      "userImpact": "Users will have explicit memoization control through the patched() API, improving workflow consistency and flexibility.",
      "rootCause": null,
      "proposedFix": "Add a `memoized` argument to the `patched` and `deprecatePatch` APIs and delegate handling logic to Core.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        591
      ],
      "keyQuote": "Add a `memoized` argument to the `patched` and `deprecatePatch` APIs. Delegate handling of the `patched` logic to Core.",
      "number": 209,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:46:04.148Z"
    },
    {
      "summary": "Feature request to add Ruby version requirement (>= 3.2.0) back to the gemspec now that rake-compiler-dock dependency issue is resolved.",
      "category": "feature",
      "subcategory": "gem-configuration",
      "apis": [],
      "components": [
        "gemspec",
        "gem-build",
        "ruby-version-constraint"
      ],
      "concepts": [
        "version-requirement",
        "dependency-constraint",
        "gem-metadata",
        "ruby-compatibility",
        "build-compatibility"
      ],
      "severity": "low",
      "userImpact": "Ensures users install the SDK on compatible Ruby versions, preventing runtime errors from version mismatches.",
      "rootCause": null,
      "proposedFix": "Add required_ruby_version >= 3.2.0 to gemspec after rake-compiler-dock issue #145 is complete and released",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Likely implemented after rake-compiler-dock dependency was resolved",
      "related": [],
      "keyQuote": "With rake-compiler-dock/issues/145 complete and released, can put this limitation into the gemspec",
      "number": 208,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:48.229Z"
    },
    {
      "summary": "Allow setting search attributes in dev server startup options for the Ruby SDK, translating them to --search-attribute CLI calls to align with recent CLI improvements.",
      "category": "feature",
      "subcategory": "dev-server",
      "apis": [],
      "components": [
        "dev-server",
        "cli-integration",
        "search-attributes"
      ],
      "concepts": [
        "dev-server-configuration",
        "search-attributes",
        "cli-compatibility",
        "sdk-startup",
        "developer-experience"
      ],
      "severity": "low",
      "userImpact": "Users can now configure search attributes directly in dev server startup options instead of managing them separately through CLI calls.",
      "rootCause": null,
      "proposedFix": "Add support for accepting search attributes in dev server startup options that translate to --search-attribute CLI parameters.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to accept search attributes in dev server startup options.",
      "related": [
        494
      ],
      "keyQuote": "users should be allowed to set search attributes in dev server option that translate to `--search-attribute` calls",
      "number": 206,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:51.307Z"
    },
    {
      "summary": "Feature request to allow customization of the development server UI port in the Ruby SDK, with reference to a cross-SDK features discussion.",
      "category": "feature",
      "subcategory": "dev-server-configuration",
      "apis": [],
      "components": [
        "dev-server",
        "ui",
        "configuration"
      ],
      "concepts": [
        "port-customization",
        "development-server",
        "configuration",
        "ui-hosting"
      ],
      "severity": "low",
      "userImpact": "Users cannot customize the port where the development server UI runs, limiting flexibility in local development environments.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was closed, indicating the feature request was addressed or resolved",
      "related": [
        588
      ],
      "keyQuote": "Allow customization of dev server UI port",
      "number": 205,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:49.740Z"
    },
    {
      "summary": "Contributor requests a contributing guide for the Ruby SDK to understand how to build and contribute to the project. The maintainer indicates that development instructions exist in the README but suggests joining Slack for further guidance and points to the samples-ruby repository for contribution opportunities.",
      "category": "docs",
      "subcategory": "contributing-guide",
      "apis": [],
      "components": [
        "documentation",
        "development-setup"
      ],
      "concepts": [
        "contribution",
        "development",
        "onboarding",
        "building",
        "maintenance"
      ],
      "severity": "low",
      "userImpact": "New contributors cannot easily understand how to set up and contribute to the Ruby SDK without external guidance.",
      "rootCause": null,
      "proposedFix": "Create a contributing.md file or update the README development section with current Ruby version requirements and contribution guidelines.",
      "workaround": "Refer to README development section, check CI runs, or join Slack #ruby-sdk channel for guidance.",
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "In the absence of a full contribution guide during the alpha period of the SDK, we have the \"Development\" section of the README",
      "number": 203,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:36.453Z"
    },
    {
      "summary": "Feature request to expose the ability to configure OTel metrics to use HTTP instead of the default gRPC protocol in the Ruby SDK. This aligns with a similar enhancement being considered for the Core library.",
      "category": "feature",
      "subcategory": "observability-otel",
      "apis": [],
      "components": [
        "otel-metrics",
        "core-integration"
      ],
      "concepts": [
        "observability",
        "metrics",
        "http-protocol",
        "otel-configuration",
        "sdk-core"
      ],
      "severity": "low",
      "userImpact": "Users will have the option to export OTel metrics over HTTP instead of being limited to gRPC, providing more flexibility in observability setup.",
      "rootCause": null,
      "proposedFix": "Add a simple boolean configuration option (default false) to enable HTTP protocol for OTel metrics.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        820
      ],
      "keyQuote": "Expose ability to have Core OTel metrics use HTTP instead of default gRPC protocol.",
      "number": 196,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:34.006Z"
    },
    {
      "summary": "Feature request to implement special behavior for Temporal built-in prefixes in the Ruby SDK, aligning with cross-SDK standards defined in the features repository.",
      "category": "feature",
      "subcategory": "naming-conventions",
      "apis": [],
      "components": [
        "sdk-core",
        "naming-system"
      ],
      "concepts": [
        "prefix-handling",
        "naming-conventions",
        "cross-sdk-consistency",
        "built-in-types",
        "standardization"
      ],
      "severity": "low",
      "userImpact": "Users will have consistent handling of built-in prefixes across all Temporal SDKs.",
      "rootCause": null,
      "proposedFix": "Implement special behavior for Temporal built-in prefixes as defined in temporalio/features#576",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented to align Ruby SDK with cross-SDK standards",
      "related": [
        576
      ],
      "keyQuote": null,
      "number": 195,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:37.136Z"
    },
    {
      "summary": "Remove Go dependency from Ruby SDK's test pipeline. The Ruby SDK can now write the 'kitchen sink' workflow entirely in Ruby, eliminating the need for Go.",
      "category": "feature",
      "subcategory": "test-pipeline",
      "apis": [],
      "components": [
        "test-pipeline",
        "kitchen-sink-workflow",
        "ci-cd"
      ],
      "concepts": [
        "test-infrastructure",
        "dependency-removal",
        "language-purity",
        "build-optimization"
      ],
      "severity": "low",
      "userImpact": "Simplifies the Ruby SDK build and test process by removing an external language dependency.",
      "rootCause": null,
      "proposedFix": "Replace Go-based kitchen sink workflow with pure Ruby implementation",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Go is currently needed for the \"kitchen sink\" workflow, but we now have the ability to write that workflow in pure Ruby",
      "number": 192,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:20.075Z"
    },
    {
      "summary": "Improve deadlock detection by interrupting deadlocked workflows post-eviction and providing the deadlocked thread's stack trace instead of the raise point stack trace.",
      "category": "feature",
      "subcategory": "deadlock-detection",
      "apis": [],
      "components": [
        "workflow-executor",
        "deadlock-detection",
        "error-handling"
      ],
      "concepts": [
        "deadlock",
        "interruption",
        "stack-trace",
        "thread-management",
        "workflow-eviction",
        "error-reporting"
      ],
      "severity": "medium",
      "userImpact": "Users will get better diagnostics when workflows deadlock, making it easier to debug and resolve deadlock issues.",
      "rootCause": null,
      "proposedFix": "Interrupt the workflow if evicted post-deadlock and include the deadlocked thread's stack trace in the deadlock error.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Try to interrupt the workflow if it is evicted post-deadlock and try to put the stack trace of the deadlocked thread as the deadlock error's stack trace.",
      "number": 191,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:23.307Z"
    },
    {
      "summary": "Ensure the signal buffer is properly drained when a dynamic signal is added to a workflow. This addresses a TODO item from issue #183 related to signal handling.",
      "category": "feature",
      "subcategory": "signal-handling",
      "apis": [],
      "components": [
        "signal-buffer",
        "dynamic-signals",
        "workflow-runtime"
      ],
      "concepts": [
        "buffer-management",
        "signal-handling",
        "workflow-lifecycle",
        "concurrency",
        "state-management"
      ],
      "severity": "medium",
      "userImpact": "Users may experience signal processing issues when dynamically adding signals to workflows if the buffer is not properly managed.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Resolved as part of workflow improvements in issue #183",
      "related": [
        183
      ],
      "keyQuote": "Ensure signal buffer properly drained when dynamic signal added. There is a TODO in #183 for this.",
      "number": 190,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:21.469Z"
    },
    {
      "summary": "Ruby SDK needs full OpenTelemetry tracing support to match capabilities available in other Temporal SDKs. This is a feature request to implement comprehensive OTel integration for distributed tracing.",
      "category": "feature",
      "subcategory": "observability",
      "apis": [],
      "components": [
        "tracing",
        "otel-instrumentation",
        "sdk-runtime"
      ],
      "concepts": [
        "observability",
        "tracing",
        "distributed-tracing",
        "otel",
        "instrumentation",
        "monitoring"
      ],
      "severity": "medium",
      "userImpact": "Ruby SDK users cannot use OpenTelemetry for distributed tracing and observability like users of other Temporal SDKs.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Need full OTel tracing like other SDKs",
      "number": 189,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:05.195Z"
    },
    {
      "summary": "Add three new client methods for signal-with-start and update-with-start workflows in Ruby SDK, aligning with the design pattern used in Python and .NET SDKs. This includes signal_with_start_workflow, start_update_with_start_workflow, and execute_update_with_start_workflow methods.",
      "category": "feature",
      "subcategory": "workflow-client",
      "apis": [
        "signal_with_start_workflow",
        "start_update_with_start_workflow",
        "execute_update_with_start_workflow",
        "StartWorkflow"
      ],
      "components": [
        "client",
        "workflow-handle",
        "update-handle"
      ],
      "concepts": [
        "signal-with-start",
        "update-with-start",
        "workflow-operations",
        "client-methods",
        "api-parity"
      ],
      "severity": "medium",
      "userImpact": "Users can now signal or update workflows at the time of starting them, providing feature parity with Python and .NET SDKs.",
      "rootCause": null,
      "proposedFix": "Implement three new methods on the client: signal_with_start_workflow, start_update_with_start_workflow, and execute_update_with_start_workflow, all accepting WithStartWorkflowOperation parameter.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to achieve API parity with Python and .NET SDKs for signal-with-start and update-with-start operations.",
      "related": [],
      "keyQuote": "We need the following methods on client: signal_with_start_workflow, start_update_with_start_workflow, execute_update_with_start_workflow",
      "number": 188,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:09.156Z"
    },
    {
      "summary": "Request to implement a workflow replayer for the Ruby SDK with capabilities to stream histories, similar to existing implementations in Python and .NET SDKs.",
      "category": "feature",
      "subcategory": "workflow-replay",
      "apis": [],
      "components": [
        "workflow-replayer",
        "history-streaming",
        "sdk-core"
      ],
      "concepts": [
        "workflow-replay",
        "history-streaming",
        "deterministic-replay",
        "testing",
        "debugging"
      ],
      "severity": "medium",
      "userImpact": "Users can test and debug workflows by replaying them with recorded histories, improving workflow reliability and troubleshooting capabilities.",
      "rootCause": null,
      "proposedFix": "Implement workflow replayer with history streaming capabilities, following patterns from Python and .NET SDK implementations.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented in the Ruby SDK with workflow replayer and history streaming capabilities.",
      "related": [],
      "keyQuote": "Implement workflow replayer, including capabilities commonly seen in Python and .NET to stream histories",
      "number": 187,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:45:03.979Z"
    },
    {
      "summary": "Request to expose a replay-safe metric meter from Ruby workflows, similar to Python and .NET SDKs, to allow recording metrics inside workflow code.",
      "category": "feature",
      "subcategory": "metrics",
      "apis": [
        "Temporalio::Workflow.metric_meter"
      ],
      "components": [
        "workflow",
        "metrics",
        "ruby-sdk"
      ],
      "concepts": [
        "metrics",
        "replay-safety",
        "workflow-context",
        "observability",
        "feature-parity"
      ],
      "severity": "medium",
      "userImpact": "Ruby developers cannot record metrics from within workflows, limiting observability compared to other Temporal SDKs.",
      "rootCause": null,
      "proposedFix": "Expose replay-safe metric_meter similar to Python and .NET implementations",
      "workaround": null,
      "resolution": "duplicate",
      "resolutionDetails": "Consolidated into #183 for broader workflow support implementation",
      "related": [
        183
      ],
      "keyQuote": "expose replay-safe `Temporalio::Workflow.metric_meter` for recording metrics inside workflows",
      "number": 186,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:50.094Z"
    },
    {
      "summary": "Feature request to warn Ruby developers when workflow futures that have failed are never awaited, similar to existing Java SDK behavior. Could also warn on any unawaited futures regardless of failure status.",
      "category": "feature",
      "subcategory": "workflow-futures",
      "apis": [],
      "components": [
        "workflow-executor",
        "futures-handling",
        "error-detection"
      ],
      "concepts": [
        "unawaited-futures",
        "failure-detection",
        "workflow-completion",
        "warning-system",
        "async-safety"
      ],
      "severity": "medium",
      "userImpact": "Developers will be alerted to potential bugs where failed workflow futures are silently ignored, preventing hard-to-debug issues.",
      "rootCause": null,
      "proposedFix": "Implement warning on workflow completion when unawaited futures with failures are detected, following the Java SDK pattern already established.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "In Java workflows today, if a future that fails is never waited on, we warn on workflow completion. We should do the same in Ruby.",
      "number": 185,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:53.644Z"
    },
    {
      "summary": "Evaluate and potentially implement Ractor-based sandboxing for Ruby SDK workflows. The main blocker is Google::Protobuf incompatibility with Ractors, which would require implementing a custom Protobuf solution.",
      "category": "feature",
      "subcategory": "workflow-sandboxing",
      "apis": [],
      "components": [
        "workflow-runtime",
        "protobuf-handling",
        "sandboxing"
      ],
      "concepts": [
        "ractor",
        "sandboxing",
        "state-isolation",
        "protobuf-compatibility",
        "experimental-features"
      ],
      "severity": "low",
      "userImpact": "Users could benefit from better workflow state isolation through Ractor-based sandboxing, but the feature is blocked by ecosystem limitations.",
      "rootCause": "Google::Protobuf library does not support Ractors, and ecosystem support is still experimental",
      "proposedFix": "Implement a custom Protobuf solution using method_missing approach (similar to Ruby extension implementation)",
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "Decision made to defer Ractor-based workflows due to Google::Protobuf incompatibility and experimental status. Will revisit when ecosystem support improves.",
      "related": [],
      "keyQuote": "It has been decided that while there are a lot of state-isolation benefits to Ractor-based workflows, since `Google::Protobuf` doesn't support them and since they are experimental, it is not worth the effort to require them today.",
      "number": 184,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:52.153Z"
    },
    {
      "summary": "Feature request to drop Ruby 3.1 support and add Ruby 3.4 support, enabling the use of Ruby's `Data` class instead of `Struct` in the SDK.",
      "category": "feature",
      "subcategory": "version-support",
      "apis": [],
      "components": [
        "ruby-sdk",
        "data-structures"
      ],
      "concepts": [
        "version-support",
        "backwards-compatibility",
        "language-features",
        "ruby-modernization"
      ],
      "severity": "medium",
      "userImpact": "Users on Ruby 3.1 will need to upgrade to a newer version, while users on Ruby 3.4+ will benefit from improved SDK implementation using modern Ruby features.",
      "rootCause": null,
      "proposedFix": "Drop Ruby 3.1 support, add Ruby 3.4 support, and leverage `Data` instead of `Struct` for SDK implementation.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to update version support and modernize the SDK codebase.",
      "related": [],
      "keyQuote": "Confirm with users that 3.1 is not a requirement. In addition to dropping 3.1 support, we can now leverage `Data` instead of `Struct` if we want.",
      "number": 182,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:37.127Z"
    },
    {
      "summary": "Allow users to access a Temporal client instance from within an activity context. Currently, there's no direct way to get the client from Activity::Context, which users need for various operations within activities.",
      "category": "feature",
      "subcategory": "activity-context",
      "apis": [
        "Activity::Context"
      ],
      "components": [
        "activity",
        "context",
        "client"
      ],
      "concepts": [
        "activity-execution",
        "client-access",
        "context-api",
        "activity-utilities",
        "temporal-client"
      ],
      "severity": "medium",
      "userImpact": "Users cannot access the Temporal client from within activities, limiting their ability to perform client operations during activity execution.",
      "rootCause": null,
      "proposedFix": "Add a `client` instance method on `Activity::Context` to provide access to the Temporal client.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to provide client access from activity context via Activity::Context method.",
      "related": [
        203
      ],
      "keyQuote": "Allow users to access Temporal client from within an activity. This is likely a `client` instance method on `Activity::Context`.",
      "number": 181,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:35.509Z"
    },
    {
      "summary": "Feature request to expose workflow and activity instances through class methods for easier access from context. Workflows should be accessible via `Temporalio::Workflow.instance` and activities via `Temporalio::Activity::Context#instance`.",
      "category": "feature",
      "subcategory": "context-access",
      "apis": [],
      "components": [
        "workflow-runtime",
        "activity-runtime",
        "context"
      ],
      "concepts": [
        "instance-access",
        "context-binding",
        "workflow-instance",
        "activity-instance",
        "reflection"
      ],
      "severity": "low",
      "userImpact": "Allows users to more easily access the current workflow or activity instance from within execution context without storing it manually.",
      "rootCause": null,
      "proposedFix": "Make workflow instance available as `Temporalio::Workflow.instance` class method and activity instance available as `Temporalio::Activity::Context#instance` instance method.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to provide instance access through the specified methods.",
      "related": [
        572
      ],
      "keyQuote": "The created instance of the workflow class should be made available as `Temporalio::Workflow.instance` class method.",
      "number": 180,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:38.687Z"
    },
    {
      "summary": "Add workflow-local storage capability to Ruby SDK, allowing users to store and retrieve data scoped to the current workflow execution. Request sketches using `Workflow[\"myValue\"]` syntax similar to thread-local and fiber-local variables.",
      "category": "feature",
      "subcategory": "workflow-context",
      "apis": [],
      "components": [
        "workflow",
        "context-storage",
        "ruby-runtime"
      ],
      "concepts": [
        "workflow-local-storage",
        "thread-local",
        "fiber-local",
        "execution-scope",
        "context-management"
      ],
      "severity": "medium",
      "userImpact": "Users lack a convenient way to store workflow-scoped data, forcing them to use workarounds instead of idiomatic storage patterns.",
      "rootCause": null,
      "proposedFix": "Implement workflow-local storage accessible via `Workflow[\"myValue\"]` syntax, similar to existing thread-local and fiber-local patterns.",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [
        571
      ],
      "keyQuote": "like thread-local and fiber-local, a user can use `Workflow[\"myValue\"]` to get or set workflow-local data",
      "number": 179,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:21.384Z"
    },
    {
      "summary": "Feature request to add buffered metrics support to the Ruby SDK, similar to the Python SDK implementation, allowing users to provide a metric buffer to the runtime as an alternative to OTel and Prometheus.",
      "category": "feature",
      "subcategory": "metrics",
      "apis": [],
      "components": [
        "metrics",
        "runtime",
        "buffer"
      ],
      "concepts": [
        "metrics",
        "buffering",
        "observability",
        "telemetry",
        "alternative-backends"
      ],
      "severity": "medium",
      "userImpact": "Users of the Ruby SDK are unable to use buffered metrics as an alternative to OTel and Prometheus for metric collection.",
      "rootCause": null,
      "proposedFix": "Implement buffered metrics feature in Ruby SDK similar to Python SDK implementation, with specialized Rust-side work required.",
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "Issue closed due to active development. The team indicated it would be difficult to contribute at the early stage until stable release, and specialized Rust work is required.",
      "related": [],
      "keyQuote": "Since it is under so much active development right now, it would be a bit difficult to contribute. We have a large PR coming within the next few weeks for full workflow support that changes so much it may not be worth contributing at least until then.",
      "number": 176,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:21.964Z"
    },
    {
      "summary": "Windows CI tests are segfaulting during execution. Backtraces indicate the issue occurs within the Rust bridge's parking_lot mutex locking mechanism, which appears to be calling Ruby's rb_w32_Sleep from a non-Ruby thread, causing NULL pointer dereference.",
      "category": "bug",
      "subcategory": "windows-ci",
      "apis": [],
      "components": [
        "temporalio_bridge",
        "parking_lot_mutex",
        "windows_threading"
      ],
      "concepts": [
        "segmentation_fault",
        "thread_safety",
        "windows_interop",
        "rust_ffi",
        "mutex_locking",
        "thread_local_storage"
      ],
      "severity": "high",
      "userImpact": "Windows users cannot run tests reliably as CI continuously segfaults, blocking development and testing on Windows platforms.",
      "rootCause": "parking_lot::raw_mutex::RawMutex::lock_slow appears to be calling rb_w32_Sleep from a non-Ruby thread context, but rb_w32_Sleep expects Ruby thread-local information via TlsGetValue which returns null in non-Ruby threads, causing segmentation fault.",
      "proposedFix": null,
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "I would expect rb_w32_Sleep to segfault if called from a non-Ruby thread (it asks for Ruby thread local info using TlsGetValue and always assumes that returns a non-null pointer)",
      "number": 172,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:24.769Z"
    },
    {
      "summary": "Request for a metric meter abstraction in the Ruby SDK that can be accessed from the runtime, activities, and workflows for collecting and reporting application metrics.",
      "category": "feature",
      "subcategory": "metrics",
      "apis": [],
      "components": [
        "metrics",
        "runtime",
        "activity-executor",
        "workflow-executor"
      ],
      "concepts": [
        "observability",
        "metrics",
        "instrumentation",
        "monitoring",
        "telemetry"
      ],
      "severity": "medium",
      "userImpact": "Users cannot currently collect and track application metrics from within Temporal Ruby SDK applications, limiting observability and debugging capabilities.",
      "rootCause": null,
      "proposedFix": "Implement a metric meter abstraction accessible from runtime, activities, and workflows",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented and closed; buffer implementation was moved to separate issue #176",
      "related": [
        176
      ],
      "keyQuote": "Need metric meter abstraction (i.e. accessible from runtime or activities or workflows)",
      "number": 169,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:06.498Z"
    },
    {
      "summary": "Feature request to allow users to set a Temporalio::Cancellation for client RPC calls in the Ruby SDK, enabling cancellation of in-flight client operations.",
      "category": "feature",
      "subcategory": "client-cancellation",
      "apis": [
        "Cancellation"
      ],
      "components": [
        "client",
        "rpc",
        "cancellation"
      ],
      "concepts": [
        "cancellation",
        "client-calls",
        "rpc-operations",
        "async-operations",
        "lifecycle-management"
      ],
      "severity": "medium",
      "userImpact": "Users cannot currently cancel in-flight client RPC calls, limiting control over long-running operations.",
      "rootCause": null,
      "proposedFix": "Implement support for setting Temporalio::Cancellation on client calls",
      "workaround": null,
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "Need to allow users to set a `Temporalio::Cancellation` for client calls",
      "number": 168,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:07.771Z"
    },
    {
      "summary": "Need activity test environment for Ruby SDK that can capture heartbeats, inject cancellation, and mock activity info during testing.",
      "category": "feature",
      "subcategory": "test-framework",
      "apis": [],
      "components": [
        "activity-executor",
        "test-utilities",
        "worker"
      ],
      "concepts": [
        "testing",
        "heartbeat",
        "cancellation",
        "mocking",
        "activity-environment"
      ],
      "severity": "medium",
      "userImpact": "Users need better testing capabilities for activities with the ability to simulate heartbeats and cancellation scenarios.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Implemented as part of PR #161",
      "related": [
        161
      ],
      "keyQuote": "Need activity test environment that can capture heartbeats, inject cancellation, mock info, etc.",
      "number": 167,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:44:09.248Z"
    },
    {
      "summary": "Request to support dynamic activities in the Ruby SDK, allowing activities to be defined and executed dynamically at runtime rather than requiring static registration.",
      "category": "feature",
      "subcategory": "dynamic-activities",
      "apis": [],
      "components": [
        "activity-registry",
        "activity-executor",
        "worker"
      ],
      "concepts": [
        "dynamic-execution",
        "runtime-definition",
        "activity-registration",
        "reflection"
      ],
      "severity": "low",
      "userImpact": "Users cannot dynamically define and execute activities at runtime, limiting flexibility in activity composition.",
      "rootCause": null,
      "proposedFix": "Implement support for dynamic activities in the Ruby SDK, with potential extension to dynamic workflows if needed.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to support dynamic activity definition and execution in the Ruby SDK.",
      "related": [],
      "keyQuote": "Support dynamic activities. Only activities are supported as of this issue creation, but if workflows come about in the interim, support their dynamic items too.",
      "number": 166,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:55.696Z"
    },
    {
      "summary": "Feature request to enable replacement of the client on a live worker in the Ruby SDK. Currently, workers cannot update their client configuration at runtime without stopping and restarting.",
      "category": "feature",
      "subcategory": "worker-configuration",
      "apis": [],
      "components": [
        "worker",
        "client"
      ],
      "concepts": [
        "runtime-replacement",
        "client-management",
        "worker-lifecycle",
        "dynamic-configuration"
      ],
      "severity": "medium",
      "userImpact": "Users cannot update the worker's client connection at runtime, requiring worker restarts to switch clients.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to allow dynamic client replacement on live workers",
      "related": [],
      "keyQuote": "Need to be able to replace the client on a live worker",
      "number": 165,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:53.521Z"
    },
    {
      "summary": "Feature request to enable setting API key and RPC metadata on the live Temporal Ruby client, allowing users to configure authentication and metadata for RPC calls.",
      "category": "feature",
      "subcategory": "client-configuration",
      "apis": [
        "Client"
      ],
      "components": [
        "client",
        "rpc",
        "authentication"
      ],
      "concepts": [
        "api-key",
        "rpc-metadata",
        "authentication",
        "client-configuration",
        "security"
      ],
      "severity": "medium",
      "userImpact": "Users cannot dynamically configure API keys and RPC metadata on the Ruby client, limiting authentication and request customization options.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The issue was closed, indicating the feature was implemented in the Ruby SDK",
      "related": [],
      "keyQuote": "Need to be able to set the API key and RPC metadata on the live client",
      "number": 164,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:52.165Z"
    },
    {
      "summary": "Request for a full-featured schedule client in the Ruby SDK to enable users to create, manage, and execute scheduled workflows.",
      "category": "feature",
      "subcategory": "schedule-client",
      "apis": [
        "ScheduleClient"
      ],
      "components": [
        "schedule-client",
        "ruby-sdk",
        "temporal-client"
      ],
      "concepts": [
        "scheduling",
        "workflow-scheduling",
        "temporal-scheduling",
        "client-api",
        "feature-parity"
      ],
      "severity": "medium",
      "userImpact": "Users cannot use the Ruby SDK to create and manage scheduled workflows, limiting SDK completeness compared to other language SDKs.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Schedule client was implemented and released in the Ruby SDK.",
      "related": [],
      "keyQuote": "Need full featured schedule client",
      "number": 163,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:36.269Z"
    },
    {
      "summary": "Fiber-based workers hang in Ruby 3.1/3.2 when Queue.push is called from a separate thread, but work correctly in Ruby 3.3+. The issue appears related to changes in Ruby's M:N scheduling model, preventing fibers waiting on queue.pop() from being woken up by pushes from other threads.",
      "category": "bug",
      "subcategory": "fiber-workers",
      "apis": [],
      "components": [
        "worker",
        "fiber-scheduler",
        "queue-communication"
      ],
      "concepts": [
        "fiber",
        "threading",
        "queue",
        "scheduling",
        "concurrency",
        "callback",
        "M:N-scheduling"
      ],
      "severity": "high",
      "userImpact": "Ruby 3.1/3.2 users cannot use fiber-based workers, limiting concurrency improvements to Ruby 3.3+ only.",
      "rootCause": "Likely related to M:N scheduling changes introduced in Ruby 3.3. Queue.push from a separate thread does not reliably wake up a fiber waiting on queue.pop in Ruby < 3.3, though the exact mechanism is not fully understood.",
      "proposedFix": "Consider reworking callback logic to use `captured_fiber_scheduler.fiber { queue.push }` instead of pushing from another thread, or investigate alternative methods to wake fibers from other threads.",
      "workaround": "Restrict fiber-based workers to Ruby 3.3+ only; use thread-based workers for earlier Ruby versions.",
      "resolution": null,
      "resolutionDetails": null,
      "related": [],
      "keyQuote": "in some cases when we have one Ruby thread that pushes to a queue, a fiber that is waiting on queue pop is not woken up",
      "number": 162,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:36.602Z"
    },
    {
      "summary": "Initialize Ruby SDK with scaffolding, bare-bones client for starting/executing workflows, and Ruby/Rust bridge. Excludes full RBS signatures, complete gRPC service set, and advanced features like payload codecs.",
      "category": "feature",
      "subcategory": "sdk-initialization",
      "apis": [
        "StartWorkflow",
        "ExecuteWorkflow"
      ],
      "components": [
        "client",
        "ruby-rust-bridge",
        "grpc-service",
        "interceptor",
        "workflow-handle"
      ],
      "concepts": [
        "scaffolding",
        "initialization",
        "client-setup",
        "testing-infrastructure",
        "bare-bones-implementation",
        "data-conversion",
        "error-handling"
      ],
      "severity": "high",
      "userImpact": "Enables Ruby developers to start using the Temporal Ruby SDK with basic workflow starting and execution capabilities.",
      "rootCause": null,
      "proposedFix": "Implement scaffolding (proto gen, build, lint, docs, test, GitHub actions), Ruby/Rust bridge, bare-bones client with minimal gRPC calls, workflow handle, basic interceptor, and test infrastructure with local ephemeral server.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue closed after implementing the requested scaffolding and bare-bones client for the Ruby SDK.",
      "related": [],
      "keyQuote": "Need the scaffolding and initial client for this repo. Namely: Proto gen, build, lint, docs, test, etc tasks; Ruby/Rust bridge; Bare-bones start/exec-workflow-only client.",
      "number": 154,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:40.634Z"
    },
    {
      "summary": "Request to add workflow update support to the Ruby SDK, enabling dynamic workflow code updates without losing workflow state.",
      "category": "feature",
      "subcategory": "workflow-updates",
      "apis": [],
      "components": [
        "workflow-engine",
        "ruby-sdk"
      ],
      "concepts": [
        "workflow-updates",
        "code-deployment",
        "state-preservation",
        "versioning",
        "backward-compatibility"
      ],
      "severity": "high",
      "userImpact": "Without workflow update support, users cannot deploy new versions of workflow code without losing in-flight workflow state.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Workflow update support has been implemented in the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 141,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:23.545Z"
    },
    {
      "summary": "Request for worker versioning support in the Ruby SDK. This issue was closed as it applied to a previous version of the SDK that is no longer applicable following the SDK's rewrite and refresh.",
      "category": "feature",
      "subcategory": "worker-versioning",
      "apis": [],
      "components": [
        "worker",
        "versioning"
      ],
      "concepts": [
        "versioning",
        "worker-lifecycle",
        "sdk-evolution",
        "backward-compatibility"
      ],
      "severity": "low",
      "userImpact": "Users cannot manage multiple versions of workflow and activity code concurrently in the Ruby SDK worker.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The issue applied to a previous version of the SDK that is no longer applicable following the SDK's rewrite and refresh",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 140,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:22.586Z"
    },
    {
      "summary": "RBS type definition files in the sig/ directory are not included in the released Ruby gem, causing Steep type checking to fail with an UnknownLibraryError when users try to use the temporalio gem.",
      "category": "bug",
      "subcategory": "type-definitions",
      "apis": [],
      "components": [
        "gem-packaging",
        "type-definitions",
        "rbs-files"
      ],
      "concepts": [
        "type-checking",
        "static-analysis",
        "gem-distribution",
        "type-safety",
        "developer-experience"
      ],
      "severity": "medium",
      "userImpact": "Users cannot perform type checking with Steep on projects using the temporalio gem, limiting IDE support and catching type errors at development time.",
      "rootCause": "The sig/ directory containing RBS type definition files is not included in the released gem package specification.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The RBS files were added to the gem packaging to be included in released versions.",
      "related": [],
      "keyQuote": "Cannot find type definitions for library: temporalio ([nil]) (RBS::EnvironmentLoader::UnknownLibraryError)",
      "number": 134,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:22.496Z"
    },
    {
      "summary": "Release assets are incorrectly named with Bridge version number (0.0.1) instead of the actual SDK release version. The version in Bridge's Cargo.toml file needs to be updated during pre-release commits.",
      "category": "bug",
      "subcategory": "release-process",
      "apis": [],
      "components": [
        "release-assets",
        "bridge",
        "cargo"
      ],
      "concepts": [
        "versioning",
        "release-automation",
        "build-artifacts"
      ],
      "severity": "medium",
      "userImpact": "Users downloading release assets receive incorrectly versioned artifacts that don't match the published release version.",
      "rootCause": "Bridge's Cargo.toml version number is not synchronized with SDK release version during pre-release process.",
      "proposedFix": "Update the version number in Bridge's Cargo.toml file in the pre-release commit.",
      "workaround": null,
      "resolution": "stale",
      "resolutionDetails": "SDK is undergoing rewrite/refresh and this issue no longer applies to current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 132,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:10.963Z"
    },
    {
      "summary": "User encounters build error when trying to use temporalio gem with Ruby 3.0.4 and Rust 1.68.0. The error appears to be related to gem installation or compilation, and the user notes that some documentation still refers to the old 'temporal' package name instead of 'temporalio'.",
      "category": "bug",
      "subcategory": "gem-installation",
      "apis": [],
      "components": [
        "gem-build",
        "documentation"
      ],
      "concepts": [
        "installation",
        "compilation",
        "gem-dependency",
        "package-naming",
        "documentation-accuracy"
      ],
      "severity": "medium",
      "userImpact": "Users cannot install and use the Ruby SDK due to build failures with the temporalio gem.",
      "rootCause": "Likely a gem compatibility issue or missing dependency, resolved in version 0.1.1",
      "proposedFix": "Upgrade to version 0.1.1 of the temporalio gem",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Maintainer indicated the issue should be resolved in version 0.1.1",
      "related": [],
      "keyQuote": "I think this should work correctly in version 0.1.1. Could you please try that again?",
      "number": 130,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:10.910Z"
    },
    {
      "summary": "Request to add an API for counting workflows in the Ruby SDK. This issue was marked as no longer applicable due to an SDK rewrite/refresh.",
      "category": "feature",
      "subcategory": "workflow-management",
      "apis": [],
      "components": [
        "workflow-api",
        "ruby-sdk"
      ],
      "concepts": [
        "workflow-counting",
        "query-api",
        "sdk-feature"
      ],
      "severity": "low",
      "userImpact": "Users would have a programmatic way to count workflows without manual iteration or external tooling.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "SDK underwent a rewrite/refresh and this feature request is no longer applicable to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 128,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:43:07.903Z"
    },
    {
      "summary": "Three transitive dependencies in the Rust bridge have known vulnerabilities: a critical TOCTOU race condition in remove_dir_all (9.1 CVSS), and two high-severity issues in webpki and hyper affecting certificate verification and HTTP/2 handling. However, this issue was applicable to a previous SDK version and is no longer relevant after the SDK rewrite.",
      "category": "bug",
      "subcategory": "dependency-security",
      "apis": [],
      "components": [
        "bridge",
        "dependencies",
        "cargo"
      ],
      "concepts": [
        "security",
        "vulnerability",
        "transitive-dependency",
        "dos",
        "toctou-race",
        "certificate-verification"
      ],
      "severity": "high",
      "userImpact": "Users of older SDK versions could be exposed to critical and high-severity vulnerabilities including arbitrary file deletion and denial of service attacks through malicious inputs.",
      "rootCause": "Outdated versions of transitive Rust dependencies (remove_dir_all 0.5.3, webpki 0.22.0, hyper 0.14.23) with known security issues",
      "proposedFix": "Upgrade remove_dir_all to 0.8.0 or later, webpki to 0.22.2 or later, and hyper to a patched version",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Resolved by SDK rewrite/refresh which is no longer applicable to the current version",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 126,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:56.848Z"
    },
    {
      "summary": "SDK validation for empty strings when preparing activities and workflows in a worker. This issue applied to a previous version of the Ruby SDK and is no longer applicable after the SDK rewrite.",
      "category": "bug",
      "subcategory": "worker-setup",
      "apis": [],
      "components": [
        "worker",
        "activity-registration",
        "workflow-registration"
      ],
      "concepts": [
        "validation",
        "worker-initialization",
        "empty-strings",
        "input-sanitization"
      ],
      "severity": "low",
      "userImpact": "Users could potentially register activities or workflows with empty string names without immediate validation, causing issues downstream.",
      "rootCause": "Missing empty string validation when preparing activities and workflows during worker initialization in the previous SDK version.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite and refresh, making this issue no longer applicable to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 120,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:53.928Z"
    },
    {
      "summary": "Investigation into compatibility issues with Ruby 3.2 and later versions. The issue was resolved as part of the SDK rewrite and is no longer applicable to the current version.",
      "category": "bug",
      "subcategory": "ruby-compatibility",
      "apis": [],
      "components": [
        "ruby-sdk",
        "runtime-compatibility"
      ],
      "concepts": [
        "version-compatibility",
        "ruby-3.2",
        "sdk-rewrite",
        "deprecation"
      ],
      "severity": "low",
      "userImpact": "Users running Ruby 3.2+ may have experienced compatibility issues with the SDK, but this is resolved in the rewritten version.",
      "rootCause": "Incompatibility between the previous SDK version and Ruby 3.2+",
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue no longer applies to the current version",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 118,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:57.494Z"
    },
    {
      "summary": "Request to add a Temporal CLI-based ephemeral server for testing purposes in the Ruby SDK, similar to what other SDKs provide as a programmatic testing interface. The issue became obsolete after SDK rewrite made the previous implementation no longer applicable.",
      "category": "feature",
      "subcategory": "test-framework",
      "apis": [],
      "components": [
        "testing",
        "server",
        "cli-integration"
      ],
      "concepts": [
        "ephemeral-server",
        "testing-environment",
        "development-server",
        "programmatic-interface",
        "sdk-rewrite"
      ],
      "severity": "low",
      "userImpact": "Developers would have convenient programmatic access to an ephemeral Temporal server for local testing without manual setup.",
      "rootCause": null,
      "proposedFix": "Implement a programmatic interface similar to TestWorkflowEnvironment in TypeScript SDK that downloads and manages an ephemeral server.",
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent rewrite/refresh and this feature request applied to the previous version, making it no longer applicable to the current codebase.",
      "related": [
        485
      ],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 117,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:40.921Z"
    },
    {
      "summary": "Tokio dependency version 1.23.1 contains a critical soundness vulnerability (CVE WS-2023-0027, CVSS 9.8) in the ReadHalf::unsplit function that can violate Pin contract guarantees under specific conditions. Upgrade to tokio 1.18.5, 1.20.4, or 1.24.2 is required.",
      "category": "bug",
      "subcategory": "dependency-security",
      "apis": [],
      "components": [
        "tokio",
        "io-util",
        "dependency-management"
      ],
      "concepts": [
        "security-vulnerability",
        "soundness",
        "memory-safety",
        "pin-contract",
        "use-after-free",
        "async-io"
      ],
      "severity": "critical",
      "userImpact": "Applications using tokio 1.23.1 with the io-util feature and !Unpin types in ReadHalf are vulnerable to potential use-after-free exploits.",
      "rootCause": "The tokio::io::ReadHalf<T>::unsplit function can violate the Pin contract when used with !Unpin types, allowing unsafe memory operations.",
      "proposedFix": "Upgrade tokio to version 1.18.5, 1.20.4, or 1.24.2 or later",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was automatically closed by Mend after the vulnerable library was either marked as ignored or removed from the project dependency inventory.",
      "related": [],
      "keyQuote": "A soundness issue was discovered in tokio. tokio::io::ReadHalf<T>::unsplit can violate the Pin contract.",
      "number": 116,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:43.104Z"
    },
    {
      "summary": "Implement a basic Workflow Worker for the Ruby SDK with timer-only support as an initial foundation.",
      "category": "feature",
      "subcategory": "workflow-worker",
      "apis": [
        "WorkflowWorker"
      ],
      "components": [
        "workflow-worker",
        "timer",
        "ruby-sdk"
      ],
      "concepts": [
        "workflow-execution",
        "timer",
        "worker",
        "concurrency",
        "event-loop"
      ],
      "severity": "high",
      "userImpact": "Users cannot execute workflows in the Ruby SDK without a basic worker implementation.",
      "rootCause": null,
      "proposedFix": "Implement a basic Workflow Worker that supports timer execution as the first step.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Basic workflow worker with timer support was implemented",
      "related": [],
      "keyQuote": null,
      "number": 113,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:37.446Z"
    },
    {
      "summary": "Implement the `operator_service` method on the `Connection` class for the Ruby SDK. This issue became obsolete due to a complete SDK rewrite/refresh.",
      "category": "feature",
      "subcategory": "connection-management",
      "apis": [],
      "components": [
        "connection",
        "operator-service"
      ],
      "concepts": [
        "connection-management",
        "service-implementation",
        "sdk-api"
      ],
      "severity": "low",
      "userImpact": "Users needed access to operator service functionality through the Connection object in the Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue is no longer applicable to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 112,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:25.811Z"
    },
    {
      "summary": "Request to expose individual RPC services through the SDK Connection interface. This issue was superseded by a SDK rewrite and is no longer applicable to the current codebase.",
      "category": "feature",
      "subcategory": "connection-rpc-services",
      "apis": [],
      "components": [
        "connection",
        "rpc-services"
      ],
      "concepts": [
        "rpc",
        "services",
        "connection",
        "api-exposure",
        "sdk-interface"
      ],
      "severity": "low",
      "userImpact": "Users cannot directly access individual RPC services through the Connection API.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "SDK underwent rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 109,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:26.966Z"
    },
    {
      "summary": "Request to implement TestServer environment for the Ruby SDK to support testing Temporal workflows and activities with a local test server.",
      "category": "feature",
      "subcategory": "test-framework",
      "apis": [],
      "components": [
        "test-server",
        "test-framework",
        "ruby-sdk"
      ],
      "concepts": [
        "testing",
        "local-environment",
        "workflow-testing",
        "test-support",
        "development"
      ],
      "severity": "medium",
      "userImpact": "Users can test their Temporal workflows and activities locally without needing a full Temporal cluster.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "TestServer environment was implemented for the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 108,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:24.071Z"
    },
    {
      "summary": "Request to publish YARD documentation to Vercel for the Ruby SDK. The issue is closed as no longer applicable due to SDK rewrite.",
      "category": "docs",
      "subcategory": "documentation-hosting",
      "apis": [],
      "components": [
        "documentation",
        "yard-docs",
        "ci-cd"
      ],
      "concepts": [
        "documentation",
        "hosting",
        "vercel",
        "api-reference",
        "developer-experience"
      ],
      "severity": "low",
      "userImpact": "Users cannot access published YARD documentation online for the Ruby SDK.",
      "rootCause": "SDK was undergoing rewrite and this documentation deployment was deprioritized.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "Issue no longer applicable due to SDK rewrite/refresh. Documentation approach likely changed in the new version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 107,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:10.144Z"
    },
    {
      "summary": "Request for a non-blocking shutdown method for the Worker class. This issue was closed as the SDK underwent a rewrite and the request no longer applies to the current implementation.",
      "category": "feature",
      "subcategory": "worker-lifecycle",
      "apis": [
        "Worker"
      ],
      "components": [
        "worker",
        "shutdown"
      ],
      "concepts": [
        "non-blocking",
        "shutdown",
        "lifecycle",
        "sdk-refresh"
      ],
      "severity": "low",
      "userImpact": "Users needed a non-blocking way to shutdown workers without blocking the calling thread.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite and refresh, making this issue no longer applicable to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 104,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:09.064Z"
    },
    {
      "summary": "This Ruby SDK dependency pull contains 3 high-severity vulnerabilities in transitive Go dependencies (golang.org/x/net and golang.org/x/text), affecting HTTP/2 stream handling and language parsing. The issue was automatically closed by Mend as the vulnerable library was removed from inventory.",
      "category": "bug",
      "subcategory": "dependency-security-vulnerability",
      "apis": [],
      "components": [
        "dependency-management",
        "grpc-client",
        "http2-transport"
      ],
      "concepts": [
        "security",
        "vulnerability",
        "dependency-upgrade",
        "denial-of-service",
        "transitive-dependency",
        "http2"
      ],
      "severity": "high",
      "userImpact": "Applications using this SDK version are exposed to potential denial-of-service attacks through crafted HTTP/2 streams or malicious Accept-Language headers.",
      "rootCause": "Transitive dependencies golang.org/x/net and golang.org/x/text contain unpatched vulnerabilities in HTTP/2 HPACK decoder and language parsing",
      "proposedFix": "Upgrade golang.org/x/net to v0.7.0 or later and golang.org/x/text to v0.3.8 or later",
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "Automatically closed by Mend as the vulnerable library was removed from the dependency inventory",
      "related": [],
      "keyQuote": "This issue was automatically closed by Mend because the vulnerable library in the specific branch(es) was either marked as ignored or it is no longer part of the Mend inventory.",
      "number": 102,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:42:13.097Z"
    },
    {
      "summary": "Feature request to enable graceful worker shutdown based on operating system signals (SIGTERM, SIGINT). This would allow the Ruby SDK to properly handle termination signals and cleanly shut down workers.",
      "category": "feature",
      "subcategory": "worker-lifecycle",
      "apis": [
        "Worker"
      ],
      "components": [
        "worker",
        "signal-handling",
        "shutdown"
      ],
      "concepts": [
        "graceful-shutdown",
        "signal-handling",
        "process-termination",
        "lifecycle-management",
        "clean-exit"
      ],
      "severity": "medium",
      "userImpact": "Users need a way to gracefully shut down workers in response to OS signals, which is essential for containerized deployments and proper process management.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Worker signal handling was implemented to support graceful shutdown based on OS signals.",
      "related": [],
      "keyQuote": null,
      "number": 98,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:54.108Z"
    },
    {
      "summary": "Request to make the Connection class interrupt-friendly for the Ruby SDK, allowing proper handling of Ruby's interrupt semantics in connection operations.",
      "category": "feature",
      "subcategory": "connection-management",
      "apis": [
        "Connection"
      ],
      "components": [
        "connection",
        "client"
      ],
      "concepts": [
        "interrupt",
        "signal-handling",
        "connection-lifecycle",
        "ruby-semantics",
        "thread-safety"
      ],
      "severity": "medium",
      "userImpact": "Users working with Ruby's interrupt mechanisms (signals) would have better integration with Temporal connections.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was closed, likely implemented in a subsequent release",
      "related": [],
      "keyQuote": null,
      "number": 96,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:57.458Z"
    },
    {
      "summary": "Implement a From trait conversion to pass WorkerResult from Rust into Ruby using interop. This is a technical infrastructure issue for the Ruby SDK's Rust bridge layer.",
      "category": "feature",
      "subcategory": "ruby-interop",
      "apis": [],
      "components": [
        "ruby-bridge",
        "worker",
        "ffi"
      ],
      "concepts": [
        "interop",
        "rust-to-ruby",
        "type-conversion",
        "worker-management"
      ],
      "severity": "medium",
      "userImpact": "Enables proper data passing between Rust runtime and Ruby code through standardized conversion traits.",
      "rootCause": null,
      "proposedFix": "Implement `impl From<WorkerResult>` for Ruby interop layer",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "From trait implementation was added to enable WorkerResult passing to Ruby",
      "related": [],
      "keyQuote": "Pass WorkerResult into Ruby land using `impl From<WorkerResult>`",
      "number": 95,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:55.997Z"
    },
    {
      "summary": "Rename the `Temporal` module to `Temporalio` in the Ruby SDK to maintain consistency with naming conventions used in other Temporal SDKs.",
      "category": "feature",
      "subcategory": "naming-alignment",
      "apis": [],
      "components": [
        "module-naming",
        "sdk-structure"
      ],
      "concepts": [
        "naming-convention",
        "api-consistency",
        "cross-sdk-alignment",
        "refactoring"
      ],
      "severity": "medium",
      "userImpact": "Users will need to update imports and references from `Temporal` to `Temporalio` to maintain consistency with other SDKs.",
      "rootCause": null,
      "proposedFix": "Rename the `Temporal` module to `Temporalio` throughout the Ruby SDK codebase.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The module was renamed from `Temporal` to `Temporalio` to align with naming conventions across other Temporal SDKs.",
      "related": [],
      "keyQuote": null,
      "number": 94,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:41.189Z"
    },
    {
      "summary": "Request for graceful timeout handling during worker shutdown in the Ruby SDK. Suggests implementing a configurable timeout mechanism to allow workers to complete in-flight operations before terminating.",
      "category": "feature",
      "subcategory": "worker-shutdown",
      "apis": [],
      "components": [
        "worker",
        "shutdown"
      ],
      "concepts": [
        "timeout",
        "graceful-shutdown",
        "worker-lifecycle",
        "signal-handling"
      ],
      "severity": "medium",
      "userImpact": "Workers may terminate abruptly without allowing in-flight operations to complete gracefully.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Worker shutdown timeout handling was implemented in the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 92,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:41.899Z"
    },
    {
      "summary": "Feature request to document comparison between the official Temporal Ruby SDK and the Coinbase Temporal Ruby library, including motivation for the separate project, key differences, and use case guidance.",
      "category": "docs",
      "subcategory": "documentation",
      "apis": [],
      "components": [
        "documentation",
        "readme"
      ],
      "concepts": [
        "library-comparison",
        "project-motivation",
        "sdk-positioning",
        "community-alternatives"
      ],
      "severity": "low",
      "userImpact": "Users unfamiliar with the Ruby Temporal ecosystem may be confused about which library to use and lack guidance on choosing between implementations.",
      "rootCause": null,
      "proposedFix": "Add comparison section to README explaining the differences between the official SDK and Coinbase's temporal-ruby library",
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "SDK was undergoing rewrite/refresh and this issue became inapplicable to the new version",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 91,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:43.913Z"
    },
    {
      "summary": "Update the README documentation with more detailed information about the Worker component and its usage in the Ruby SDK.",
      "category": "docs",
      "subcategory": "readme-documentation",
      "apis": [
        "Worker"
      ],
      "components": [
        "worker",
        "documentation",
        "readme"
      ],
      "concepts": [
        "worker-configuration",
        "sdk-documentation",
        "getting-started",
        "api-reference"
      ],
      "severity": "low",
      "userImpact": "Users have incomplete documentation about the Worker component, making it harder to understand how to configure and use workers in the Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "README was updated with Worker details as requested",
      "related": [],
      "keyQuote": null,
      "number": 88,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:30.313Z"
    },
    {
      "summary": "Implement proper Worker shutdown mechanism for the Ruby SDK to gracefully terminate worker processes and clean up resources.",
      "category": "feature",
      "subcategory": "worker-lifecycle",
      "apis": [
        "Worker"
      ],
      "components": [
        "worker",
        "lifecycle-management",
        "shutdown-handler"
      ],
      "concepts": [
        "shutdown",
        "graceful-termination",
        "resource-cleanup",
        "lifecycle",
        "worker-management"
      ],
      "severity": "high",
      "userImpact": "Users lack a standardized way to cleanly shut down workers, potentially leading to incomplete work processing and resource leaks.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Worker shutdown implementation was completed and released in the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 87,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:29.586Z"
    },
    {
      "summary": "Proposal to improve the Worker API by allowing Worker#run to accept a block and deprecating the separate Worker#start method, streamlining the Worker lifecycle management in the Ruby SDK.",
      "category": "feature",
      "subcategory": "worker-api",
      "apis": [
        "Worker#run",
        "Worker#start"
      ],
      "components": [
        "worker",
        "api-design",
        "runtime"
      ],
      "concepts": [
        "api-improvement",
        "lifecycle-management",
        "block-syntax",
        "deprecation",
        "ruby-idioms"
      ],
      "severity": "low",
      "userImpact": "Users would benefit from a more Ruby-idiomatic API with simplified Worker lifecycle management.",
      "rootCause": null,
      "proposedFix": "Modify Worker#run to accept an optional block parameter and deprecate Worker#start method.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Worker#run was enhanced to accept a block, providing more idiomatic Ruby API patterns while the separate start method was deprecated.",
      "related": [],
      "keyQuote": null,
      "number": 86,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:28.241Z"
    },
    {
      "summary": "Request to implement activity interceptors for the Ruby SDK, enabling custom logic to be executed around activity execution.",
      "category": "feature",
      "subcategory": "activity-interceptors",
      "apis": [
        "ExecuteActivity"
      ],
      "components": [
        "activity-executor",
        "interceptor",
        "ruby-sdk"
      ],
      "concepts": [
        "interceptor-pattern",
        "middleware",
        "activity-lifecycle",
        "extension-point",
        "custom-logic"
      ],
      "severity": "medium",
      "userImpact": "Users cannot currently extend or customize activity execution behavior with interceptors in the Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Activity interceptors feature was implemented and released in the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 85,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:15.442Z"
    },
    {
      "summary": "This issue tracks activity cancellations in the Ruby SDK, but no description was provided to clarify the specific problem or feature request.",
      "category": "other",
      "subcategory": "activity-cancellation",
      "apis": [],
      "components": [
        "activity-executor",
        "cancellation-handler"
      ],
      "concepts": [
        "cancellation",
        "activity-lifecycle",
        "error-handling",
        "task-execution"
      ],
      "severity": "medium",
      "userImpact": "Users need clarity on how activity cancellations work in the Ruby SDK implementation.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "Issue closed due to lack of description and unclear requirements",
      "related": [],
      "keyQuote": null,
      "number": 84,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:17.327Z"
    },
    {
      "summary": "Activity heartbeat feature for Ruby SDK. This is a feature request to implement heartbeat support for long-running activities, allowing them to report progress and prevent timeout errors.",
      "category": "feature",
      "subcategory": "activity-heartbeat",
      "apis": [
        "RecordActivityHeartbeat"
      ],
      "components": [
        "activity-executor",
        "worker",
        "heartbeat-handler"
      ],
      "concepts": [
        "heartbeat",
        "activity-timeout",
        "progress-reporting",
        "long-running-tasks",
        "cancellation"
      ],
      "severity": "medium",
      "userImpact": "Users need a way to report activity progress and prevent timeouts for long-running activities in Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Activity heartbeat functionality was implemented in the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 83,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:14.049Z"
    },
    {
      "summary": "Add a way to mark APIs as unstable or private in the Ruby SDK to indicate to users which APIs are not part of the stable public interface and may change without warning.",
      "category": "feature",
      "subcategory": "api-design",
      "apis": [],
      "components": [
        "api-documentation",
        "visibility-control"
      ],
      "concepts": [
        "api-stability",
        "private-api",
        "visibility",
        "documentation",
        "api-design"
      ],
      "severity": "low",
      "userImpact": "Users need clear guidance on which Ruby SDK APIs are stable and safe to depend on versus internal implementation details.",
      "rootCause": null,
      "proposedFix": "Use YARD documentation tags (@private) or a combination of Ruby's private_constant and private/protected scope modifiers to mark unstable/private APIs.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Resolved by adopting YARD's @private tag for documentation-based API stability marking.",
      "related": [],
      "keyQuote": "I think this one should work well for us  https://rubydoc.info/gems/yard/file/docs/Tags.md#private",
      "number": 79,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:01.724Z"
    },
    {
      "summary": "Request to simplify Client/Worker initialization in the Ruby SDK. This issue was part of a previous SDK version and is no longer applicable following the SDK rewrite.",
      "category": "feature",
      "subcategory": "client-initialization",
      "apis": [],
      "components": [
        "client",
        "worker"
      ],
      "concepts": [
        "initialization",
        "simplification",
        "api-design"
      ],
      "severity": "low",
      "userImpact": "Simplifying initialization would reduce complexity for users setting up Temporal clients and workers.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue applied to a previous version that is no longer applicable.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 78,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:59.565Z"
    },
    {
      "summary": "Request to add codec support for `to_payload` and `from_payload` methods in the Ruby SDK, enabling users to implement custom serialization and deserialization logic.",
      "category": "feature",
      "subcategory": "codec-support",
      "apis": [
        "to_payload",
        "from_payload"
      ],
      "components": [
        "codec",
        "serialization",
        "ruby-sdk"
      ],
      "concepts": [
        "payload-encoding",
        "custom-serialization",
        "data-transformation",
        "encoding",
        "codec-pattern"
      ],
      "severity": "medium",
      "userImpact": "Users cannot implement custom codecs for payload serialization, limiting flexibility in data encoding strategies.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Codec support for to_payload and from_payload methods was implemented in the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 77,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:41:02.193Z"
    },
    {
      "summary": "Request for lazy thread-pool implementation in the Ruby SDK. This issue was marked as obsolete due to an SDK rewrite/refresh.",
      "category": "feature",
      "subcategory": "thread-pool",
      "apis": [],
      "components": [
        "thread-pool",
        "worker-runtime"
      ],
      "concepts": [
        "lazy-initialization",
        "thread-management",
        "resource-efficiency"
      ],
      "severity": "low",
      "userImpact": "Users could potentially optimize resource usage through lazy thread-pool initialization.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue is no longer applicable to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 76,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:49.733Z"
    },
    {
      "summary": "Feature request to accept Temporal::DataConverter in Client and Worker constructors, allowing users to pass custom data converters during client and worker initialization.",
      "category": "feature",
      "subcategory": "data-converter",
      "apis": [
        "Client",
        "Worker"
      ],
      "components": [
        "client",
        "worker",
        "data-converter"
      ],
      "concepts": [
        "serialization",
        "data-conversion",
        "customization",
        "interoperability"
      ],
      "severity": "medium",
      "userImpact": "Users need the ability to configure custom data converters when creating Client and Worker instances for specialized serialization requirements.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented to accept Temporal::DataConverter in Client and Worker constructors.",
      "related": [],
      "keyQuote": null,
      "number": 75,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:48.171Z"
    },
    {
      "summary": "User requested TLS support to be added to the Ruby SDK Client for secure connections.",
      "category": "feature",
      "subcategory": "tls-support",
      "apis": [],
      "components": [
        "client",
        "connection",
        "tls"
      ],
      "concepts": [
        "encryption",
        "security",
        "tls",
        "ssl",
        "client-configuration",
        "connection-security"
      ],
      "severity": "high",
      "userImpact": "Users cannot establish secure TLS-encrypted connections to Temporal Server using the Ruby SDK Client.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Implemented in issue #129",
      "related": [
        129
      ],
      "keyQuote": "Done in #129",
      "number": 73,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:47.322Z"
    },
    {
      "summary": "Add `run_id` field to the `Temporal::Error::WorkflowExecutionAlreadyStarted` exception based on Rust SDK implementation. This issue is obsolete due to SDK rewrite.",
      "category": "feature",
      "subcategory": "error-handling",
      "apis": [
        "WorkflowExecutionAlreadyStarted"
      ],
      "components": [
        "error-types",
        "exceptions"
      ],
      "concepts": [
        "error-details",
        "run-id",
        "workflow-execution",
        "exception-enhancement"
      ],
      "severity": "low",
      "userImpact": "Users would have access to the run_id when catching WorkflowExecutionAlreadyStarted errors for better debugging.",
      "rootCause": null,
      "proposedFix": "Add run_id field to WorkflowExecutionAlreadyStarted exception similar to Rust SDK implementation",
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "Issue became obsolete due to Ruby SDK rewrite/refresh and is no longer applicable to the current version",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 72,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:36.748Z"
    },
    {
      "summary": "Issue about detecting UnsupportedQuery exceptions correctly based on gRPC status code INVALID_ARGUMENT in the Ruby SDK. This issue is no longer applicable as the SDK underwent a rewrite.",
      "category": "bug",
      "subcategory": "error-handling",
      "apis": [],
      "components": [
        "ruby-sdk",
        "grpc-client"
      ],
      "concepts": [
        "error-detection",
        "status-codes",
        "query-execution",
        "exception-handling"
      ],
      "severity": "low",
      "userImpact": "Users may not be able to correctly identify UnsupportedQuery errors in Ruby SDK workflows.",
      "rootCause": "SDK query exception detection not properly mapping gRPC INVALID_ARGUMENT status codes to UnsupportedQuery exceptions.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue no longer applies to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 71,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:35.539Z"
    },
    {
      "summary": "Request to add an `#execute_workflow` method to the Ruby SDK Client. This issue became obsolete during the SDK rewrite and is no longer applicable.",
      "category": "feature",
      "subcategory": "client-api",
      "apis": [
        "Client"
      ],
      "components": [
        "client",
        "workflow-execution"
      ],
      "concepts": [
        "workflow-execution",
        "client-api",
        "method-addition"
      ],
      "severity": "low",
      "userImpact": "Users would have a direct method to execute workflows from the Client instance.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue is no longer applicable to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 70,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:33.096Z"
    },
    {
      "summary": "Feature request to enable custom converters and codecs on the Ruby SDK client for handling data serialization and type conversion.",
      "category": "feature",
      "subcategory": "converters-codecs",
      "apis": [],
      "components": [
        "client",
        "data-conversion",
        "serialization"
      ],
      "concepts": [
        "custom-converters",
        "codecs",
        "data-serialization",
        "type-conversion",
        "extensibility"
      ],
      "severity": "medium",
      "userImpact": "Users cannot use custom data converters and codecs on the Ruby SDK client, limiting their ability to handle specialized serialization requirements.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented and closed",
      "related": [],
      "keyQuote": null,
      "number": 58,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:19.992Z"
    },
    {
      "summary": "Add YARD documentation generation support for the Ruby SDK. This is a documentation infrastructure request to enable automatic API documentation generation using YARD.",
      "category": "docs",
      "subcategory": "documentation-generation",
      "apis": [],
      "components": [
        "documentation",
        "ruby-sdk"
      ],
      "concepts": [
        "documentation",
        "api-docs",
        "code-generation",
        "developer-experience",
        "inline-documentation"
      ],
      "severity": "low",
      "userImpact": "Developers would have access to better inline API documentation and automated documentation generation for the Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "YARD documentation support was implemented for the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 56,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:21.608Z"
    },
    {
      "summary": "Implement a FailureConverter for the Ruby SDK to provide a way to convert Temporal failures into custom error types.",
      "category": "feature",
      "subcategory": "failure-handling",
      "apis": [],
      "components": [
        "failure-converter",
        "error-handling",
        "worker"
      ],
      "concepts": [
        "error-conversion",
        "failure-serialization",
        "exception-handling"
      ],
      "severity": "medium",
      "userImpact": "Users cannot customize how Temporal failures are converted to Ruby exceptions, limiting error handling flexibility.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "FailureConverter feature was implemented for the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 53,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:22.582Z"
    },
    {
      "summary": "Implement proto converters for JSON and binary serialization in the Ruby SDK. This issue was superseded by the SDK rewrite and is no longer applicable.",
      "category": "feature",
      "subcategory": "serialization",
      "apis": [],
      "components": [
        "serialization",
        "proto-converters",
        "data-conversion"
      ],
      "concepts": [
        "protobuf",
        "json-serialization",
        "binary-serialization",
        "data-conversion",
        "type-conversion"
      ],
      "severity": "low",
      "userImpact": "Users would have had built-in support for protobuf message serialization in JSON and binary formats.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue from a previous version is no longer applicable.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 52,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:01.987Z"
    },
    {
      "summary": "HTTP/2 request smuggling vulnerability (CVE-2022-41721) with CVSS 7.5 in golang.org/x/net transitive dependency through temporalite-v0.1.1. The vulnerability was present in the Ruby SDK's test support files but is no longer applicable after SDK rewrite.",
      "category": "bug",
      "subcategory": "dependency-security",
      "apis": [],
      "components": [
        "temporalite",
        "go-server-test-support",
        "grpc-middleware"
      ],
      "concepts": [
        "security",
        "http2",
        "request-smuggling",
        "vulnerability",
        "dependency",
        "transitive"
      ],
      "severity": "high",
      "userImpact": "Exposes the SDK to potential HTTP/2 request smuggling attacks through a vulnerable transitive dependency in test infrastructure.",
      "rootCause": "MaxBytesHandler in golang.org/x/net v0.0.0-20220708220712-1185a9018129 does not fully consume HTTP request body, allowing attacker-manipulated data to be interpreted as HTTP/2 frames.",
      "proposedFix": "Upgrade golang.org/x/net to v0.2.0 or later (released 2023-01-13).",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was automatically closed by Mend after SDK rewrite/refresh eliminated the vulnerable dependency from the codebase. The dependency is no longer part of the SDK inventory.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 51,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:05.999Z"
    },
    {
      "summary": "A denial-of-service vulnerability (CVE-2022-3171) was identified in google-protobuf 3.21.6, a transitive dependency of grpc, affecting the Ruby SDK. The issue causes long garbage collection pauses when parsing certain binary data formats.",
      "category": "bug",
      "subcategory": "dependency-security-vulnerability",
      "apis": [],
      "components": [
        "grpc",
        "google-protobuf",
        "dependency-management"
      ],
      "concepts": [
        "security-vulnerability",
        "denial-of-service",
        "garbage-collection",
        "protobuf",
        "dependency-upgrade"
      ],
      "severity": "medium",
      "userImpact": "Ruby SDK applications using affected versions of grpc may experience performance degradation due to extended garbage collection pauses triggered by malicious or crafted protobuf data.",
      "rootCause": "Parsing procedure for binary and text format data in protobuf causes objects to be converted back-and-forth between mutable and immutable forms, resulting in long garbage collection pauses.",
      "proposedFix": "Upgrade google-protobuf to version 3.21.7 or later (3.20.3, 3.19.6 also available depending on version requirements).",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was automatically closed by Mend as the vulnerable library was either marked as ignored or is no longer part of the Mend inventory, indicating the dependency has been removed or upgraded.",
      "related": [],
      "keyQuote": "Input streams containing multiple instances of non-repeated embedded messages with repeated or unknown fields cause objects to be converted back-n-forth between mutable and immutable forms, resulting in potentially long garbage collection pauses.",
      "number": 48,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:40:07.908Z"
    },
    {
      "summary": "Refactor the Ruby SDK's Connection class to isolate the workflow_service, creating a structured foundation for integrating operator_service, health_service, and test_service in the future.",
      "category": "feature",
      "subcategory": "connection-architecture",
      "apis": [],
      "components": [
        "Connection",
        "workflow_service",
        "operator_service",
        "health_service",
        "test_service"
      ],
      "concepts": [
        "service-isolation",
        "connection-management",
        "sdk-architecture",
        "service-integration",
        "modularity"
      ],
      "severity": "medium",
      "userImpact": "Improves the SDK's internal architecture to support multiple services through a Connection object, enabling better organization and future extensibility.",
      "rootCause": null,
      "proposedFix": "Isolate workflow_service on the Connection class to establish a pattern for managing multiple services.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The workflow_service was isolated on the Connection class, establishing the foundation for integrating additional services.",
      "related": [],
      "keyQuote": null,
      "number": 47,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:49.200Z"
    },
    {
      "summary": "Five vulnerabilities detected in the go.temporal.io/server dependency (version v1.17.5), including three high-severity CVEs affecting Apache Thrift and Uber Tally libraries. The vulnerabilities relate to SASL negotiation bypass, endless loops in Thrift processing, and metrics buffering issues.",
      "category": "bug",
      "subcategory": "dependency-security",
      "apis": [],
      "components": [
        "dependency-management",
        "thrift-transport",
        "metrics",
        "ringpop"
      ],
      "concepts": [
        "security",
        "vulnerability",
        "dependency",
        "SASL",
        "CVE",
        "transitive-dependency"
      ],
      "severity": "high",
      "userImpact": "Users are exposed to multiple high-severity security vulnerabilities in transitive dependencies that could allow integrity compromise and denial of service attacks.",
      "rootCause": "Outdated versions of Apache Thrift (v0.0.0-20161221203622) and Uber Tally (v4.1.2) in the dependency tree contain known security vulnerabilities without available fixes in those specific versions.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "Issue was automatically closed by Mend because the vulnerable library was either marked as ignored or is no longer part of the Mend inventory.",
      "related": [],
      "keyQuote": "Found in HEAD commit: 63b662559cd583d424ccbd121f96a1194e1fa2eb - detected in multiple dependencies: go.temporal.io/server-v1.17.5",
      "number": 41,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:48.923Z"
    },
    {
      "summary": "Issue applied to a previous version of the SDK that is no longer applicable due to the SDK rewrite/refresh.",
      "category": "other",
      "subcategory": "sdk-maintenance",
      "apis": [],
      "components": [
        "search-attributes"
      ],
      "concepts": [
        "search-attributes",
        "sdk-rewrite",
        "server-compatibility"
      ],
      "severity": "low",
      "userImpact": "No impact - this issue is obsolete due to SDK rewrite.",
      "rootCause": "SDK underwent rewrite/refresh making this issue no longer applicable",
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "Issue no longer applicable after SDK rewrite/refresh",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 40,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:50.372Z"
    },
    {
      "summary": "Establish a comprehensive exception class hierarchy for the Ruby SDK to provide developers with structured error handling capabilities and clear exception categories aligned with Temporal SDK patterns.",
      "category": "feature",
      "subcategory": "error-handling",
      "apis": [],
      "components": [
        "exception-system",
        "ruby-sdk",
        "error-classes"
      ],
      "concepts": [
        "exception-hierarchy",
        "error-handling",
        "type-safety",
        "api-consistency",
        "sdk-design"
      ],
      "severity": "medium",
      "userImpact": "Developers using the Ruby SDK need well-structured exception classes for proper error handling and consistency with other Temporal SDKs.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Exception class hierarchy was implemented for the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 36,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:33.425Z"
    },
    {
      "summary": "A proposal to submit an end-to-end (E2E) testing framework or guidelines for the Ruby SDK.",
      "category": "feature",
      "subcategory": "test-framework",
      "apis": [],
      "components": [
        "testing",
        "e2e-framework"
      ],
      "concepts": [
        "end-to-end-testing",
        "test-coverage",
        "integration-testing",
        "quality-assurance"
      ],
      "severity": "medium",
      "userImpact": "Users need comprehensive E2E testing framework to ensure their Temporal workflows work correctly in realistic scenarios.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "unknown",
      "resolutionDetails": null,
      "related": [],
      "keyQuote": null,
      "number": 35,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:31.151Z"
    },
    {
      "summary": "Issue requesting verification that all Tokio join handlers are properly joined to prevent panics from being silently ignored. This was applicable to a previous version of the SDK but is no longer relevant due to an SDK rewrite.",
      "category": "bug",
      "subcategory": "error-handling",
      "apis": [],
      "components": [
        "tokio-runtime",
        "panic-handling"
      ],
      "concepts": [
        "panic-handling",
        "error-propagation",
        "async-runtime",
        "join-handlers"
      ],
      "severity": "low",
      "userImpact": "Ensures that panics in background tasks are properly surfaced rather than being silently ignored during SDK operations.",
      "rootCause": "Tokio join handlers may not have been fully joined, potentially allowing panics to be ignored in previous SDK versions.",
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue applied to a previous version that is no longer applicable.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 34,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:35.511Z"
    },
    {
      "summary": "Implement a Ruby Worker for the Temporal Ruby SDK. This is a feature request to develop the core worker component required for the Ruby SDK.",
      "category": "feature",
      "subcategory": "worker-implementation",
      "apis": [],
      "components": [
        "worker",
        "runtime",
        "task-processor"
      ],
      "concepts": [
        "worker-initialization",
        "task-polling",
        "activity-execution",
        "workflow-execution",
        "event-loop"
      ],
      "severity": "high",
      "userImpact": "Without a Ruby Worker implementation, users cannot execute workflows and activities using the Temporal Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Ruby Worker has been implemented as part of the Ruby SDK development.",
      "related": [],
      "keyQuote": null,
      "number": 32,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:20.376Z"
    },
    {
      "summary": "Proposal to wrap Core globals within a CoreRuntime singleton pattern in the Ruby SDK to better manage core runtime lifecycle and dependencies.",
      "category": "feature",
      "subcategory": "core-runtime",
      "apis": [],
      "components": [
        "core-runtime",
        "ruby-sdk",
        "globals"
      ],
      "concepts": [
        "singleton",
        "lifecycle-management",
        "core-globals",
        "runtime-initialization",
        "dependency-management"
      ],
      "severity": "medium",
      "userImpact": "Users would benefit from cleaner core runtime management and better control over lifecycle dependencies.",
      "rootCause": null,
      "proposedFix": "Implement a CoreRuntime singleton to wrap Core globals instead of using raw global variables.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The CoreRuntime singleton pattern was implemented to properly manage core runtime globals in the Ruby SDK.",
      "related": [],
      "keyQuote": "Wrap Core globals within a `CoreRuntime` singleton in Ruby",
      "number": 31,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:18.245Z"
    },
    {
      "summary": "Task to generate protobufs for the Temporal Ruby SDK Core component.",
      "category": "feature",
      "subcategory": "protobuf-generation",
      "apis": [],
      "components": [
        "core",
        "protobuf",
        "code-generation"
      ],
      "concepts": [
        "code-generation",
        "protobuf",
        "ruby-sdk",
        "serialization",
        "api-definitions"
      ],
      "severity": "medium",
      "userImpact": "Generated protobufs are necessary for the Ruby SDK to properly serialize and deserialize Temporal Core messages.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was closed, indicating protobuf generation for Ruby SDK Core was completed.",
      "related": [],
      "keyQuote": null,
      "number": 29,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:18.680Z"
    },
    {
      "summary": "Issue requesting a layer between the Bridge and Ruby bindings to better handle and raise VM errors. No longer applicable due to SDK rewrite/refresh.",
      "category": "other",
      "subcategory": "bridge-layer",
      "apis": [],
      "components": [
        "bridge",
        "ruby-bindings",
        "error-handling"
      ],
      "concepts": [
        "vm-errors",
        "error-propagation",
        "binding-architecture"
      ],
      "severity": "low",
      "userImpact": "Users may encounter unhandled or poorly surfaced VM errors during SDK execution.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "wontfix",
      "resolutionDetails": "SDK underwent rewrite/refresh; this issue applied to previous version and is no longer applicable",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 26,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:03.196Z"
    },
    {
      "summary": "Refactor error definitions in the Ruby SDK to use the thiserror crate for more ergonomic error handling.",
      "category": "feature",
      "subcategory": "error-handling",
      "apis": [],
      "components": [
        "error-handling",
        "error-types"
      ],
      "concepts": [
        "error-definitions",
        "code-generation",
        "ergonomics",
        "rust-patterns"
      ],
      "severity": "low",
      "userImpact": "Improves error handling ergonomics and reduces boilerplate code for Ruby SDK error definitions.",
      "rootCause": null,
      "proposedFix": "Adopt the thiserror crate for error type definitions instead of manual implementations.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Likely implemented as a refactoring to improve code quality and reduce error handling boilerplate.",
      "related": [],
      "keyQuote": null,
      "number": 24,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:01.828Z"
    },
    {
      "summary": "Transitive dependency vulnerability in bzip2-0.4.3 crate used by temporal-sdk-core-0.1.0 allows denial of service via integer overflow in large files. CVE-2023-22895 with CVSS score 7.5.",
      "category": "bug",
      "subcategory": "dependency-security",
      "apis": [],
      "components": [
        "temporal-sdk-core",
        "dependency-management",
        "bzip2-binding"
      ],
      "concepts": [
        "security-vulnerability",
        "denial-of-service",
        "integer-overflow",
        "dependency-chain",
        "transitive-dependency"
      ],
      "severity": "high",
      "userImpact": "Users of temporal-sdk-ruby are exposed to potential denial of service attacks through a vulnerable transitive dependency in the Rust SDK core.",
      "rootCause": "Integer overflow in mem.rs of bzip2-0.4.3 crate when processing large files, allowing denial of service attacks.",
      "proposedFix": "Upgrade bzip2 crate from 0.4.3 to 0.4.4 or later version that includes the fix for CVE-2023-22895.",
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Issue was automatically closed by Mend after the vulnerable library was removed from the dependency inventory, indicating the dependency was either upgraded or removed from the project.",
      "related": [],
      "keyQuote": "The bzip2 crate before 0.4.4 for Rust allow attackers to cause a denial of service via a large file that triggers an integer overflow",
      "number": 23,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:39:06.572Z"
    },
    {
      "summary": "Request to add RBS (Ruby Signature) type checker support to the Ruby SDK for improved type safety and IDE integration.",
      "category": "feature",
      "subcategory": "tooling",
      "apis": [],
      "components": [
        "ruby-sdk",
        "type-checking",
        "development-tools"
      ],
      "concepts": [
        "type-safety",
        "rbs",
        "static-analysis",
        "developer-experience"
      ],
      "severity": "low",
      "userImpact": "Enables Ruby developers to use RBS for better type checking and IDE support when using the Temporal Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "RBS type checker support was implemented and integrated into the Ruby SDK development tooling.",
      "related": [],
      "keyQuote": null,
      "number": 20,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:49.172Z"
    },
    {
      "summary": "Initial setup and build scripts integration with the Temporal Core API for the Ruby SDK.",
      "category": "feature",
      "subcategory": "core-api-integration",
      "apis": [],
      "components": [
        "build-system",
        "core-api",
        "sdk-setup"
      ],
      "concepts": [
        "integration",
        "initialization",
        "build-configuration",
        "core-api",
        "sdk-development"
      ],
      "severity": "high",
      "userImpact": "Establishes the foundation for the Ruby SDK to interoperate with Temporal Core.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Initial setup and build scripts were implemented to integrate with Core API.",
      "related": [],
      "keyQuote": null,
      "number": 19,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:47.316Z"
    },
    {
      "summary": "Evaluate and select a bridging gem for integrating with the Temporal Core API in the Ruby SDK. This is a foundational architecture decision for Ruby SDK development.",
      "category": "feature",
      "subcategory": "core-integration",
      "apis": [],
      "components": [
        "core-bridge",
        "ruby-sdk",
        "native-binding"
      ],
      "concepts": [
        "bridging",
        "core-api",
        "gem-integration",
        "ffi",
        "native-code",
        "interop",
        "architecture"
      ],
      "severity": "high",
      "userImpact": "The choice of bridging gem affects the Ruby SDK's performance, maintainability, and ability to access Core API functionality.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "A bridging gem was selected and implemented for Core API integration in the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 18,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:51.032Z"
    },
    {
      "summary": "Research and evaluate the Temporal Core API to determine compatibility and integration strategy for the Ruby SDK.",
      "category": "other",
      "subcategory": "core-api-research",
      "apis": [],
      "components": [
        "core-api",
        "sdk-integration"
      ],
      "concepts": [
        "api-compatibility",
        "sdk-design",
        "integration-strategy",
        "core-evaluation",
        "research"
      ],
      "severity": "medium",
      "userImpact": "Understanding the Core API is essential for proper Ruby SDK implementation and ensuring alignment with other language SDKs.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Research task completed and Core API evaluated as part of Ruby SDK development",
      "related": [],
      "keyQuote": null,
      "number": 17,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:35.428Z"
    },
    {
      "summary": "Set up a basic CI pipeline for the Ruby SDK that runs rspec tests and rubocop linting checks on each commit.",
      "category": "feature",
      "subcategory": "ci-pipeline",
      "apis": [],
      "components": [
        "ci",
        "testing",
        "linting"
      ],
      "concepts": [
        "continuous-integration",
        "automated-testing",
        "code-quality",
        "rspec",
        "rubocop"
      ],
      "severity": "medium",
      "userImpact": "Ensures code quality and test coverage are maintained automatically across Ruby SDK development.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Basic CI pipeline was set up with rspec and rubocop checks",
      "related": [],
      "keyQuote": null,
      "number": 16,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:37.262Z"
    },
    {
      "summary": "Request to implement an end-to-end integration test that verifies interoperability between a Go workflow and Ruby client with activities.",
      "category": "feature",
      "subcategory": "test-framework",
      "apis": [],
      "components": [
        "ruby-client",
        "activity-executor",
        "workflow-executor"
      ],
      "concepts": [
        "integration-testing",
        "cross-language-interop",
        "end-to-end-testing",
        "workflow-execution"
      ],
      "severity": "medium",
      "userImpact": "Users need confidence that Ruby SDK works correctly with workflows written in other languages like Go.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Integration test was implemented and merged into the Ruby SDK test suite.",
      "related": [],
      "keyQuote": null,
      "number": 15,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:34.341Z"
    },
    {
      "summary": "Integrate Client and Worker with Payload Codecs to enable custom serialization/deserialization of workflow inputs, outputs, and other payloads in the Ruby SDK.",
      "category": "feature",
      "subcategory": "payload-codecs",
      "apis": [
        "Client",
        "Worker"
      ],
      "components": [
        "client",
        "worker",
        "payload-codec"
      ],
      "concepts": [
        "serialization",
        "deserialization",
        "payload-encoding",
        "codec-integration",
        "custom-encoding",
        "data-transformation"
      ],
      "severity": "medium",
      "userImpact": "Users cannot implement custom payload encoding/decoding strategies for sensitive data or optimization purposes in Ruby SDK workflows.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Payload codec integration was implemented in the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 14,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:20.222Z"
    },
    {
      "summary": "Integrate payload converters with the Ruby SDK Client and Worker components to enable consistent serialization and deserialization of data across distributed workflows.",
      "category": "feature",
      "subcategory": "payload-conversion",
      "apis": [
        "Client",
        "Worker"
      ],
      "components": [
        "client",
        "worker",
        "payload-converter",
        "serialization"
      ],
      "concepts": [
        "payload-conversion",
        "serialization",
        "data-transformation",
        "codec",
        "interoperability",
        "type-handling"
      ],
      "severity": "medium",
      "userImpact": "Users need payload converters integrated into Client and Worker to properly handle data serialization across workflow executions.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Payload converters were integrated with Client and Worker components in the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 13,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:22.329Z"
    },
    {
      "summary": "Implement the Payload Codec interface for the Ruby SDK to enable custom serialization/deserialization of workflow and activity payloads.",
      "category": "feature",
      "subcategory": "payload-codec",
      "apis": [],
      "components": [
        "codec",
        "serialization",
        "payload-handling"
      ],
      "concepts": [
        "payload-codec",
        "custom-serialization",
        "encryption",
        "compression",
        "data-transformation"
      ],
      "severity": "medium",
      "userImpact": "Users need the ability to implement custom payload codecs for encryption, compression, or custom serialization of workflow and activity data.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The Payload Codec interface was implemented in the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 12,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:23.301Z"
    },
    {
      "summary": "Implement basic Payload Converters for the Ruby SDK to handle null, bytes, and JSON data types. This is a core feature needed to support serialization and deserialization of workflow and activity payloads.",
      "category": "feature",
      "subcategory": "payload-conversion",
      "apis": [],
      "components": [
        "payload-converter",
        "serialization",
        "data-handling"
      ],
      "concepts": [
        "serialization",
        "deserialization",
        "type-conversion",
        "data-encoding",
        "protocol-support"
      ],
      "severity": "high",
      "userImpact": "Without payload converters, users cannot properly serialize and deserialize data in workflows and activities, blocking core SDK functionality.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature implemented in Ruby SDK to support null, bytes, and JSON payload converters",
      "related": [],
      "keyQuote": null,
      "number": 11,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:06.169Z"
    },
    {
      "number": 10,
      "summary": "Implement a Payload Converter interface for the Ruby SDK to enable custom serialization and deserialization of workflow/activity payloads.",
      "category": "feature",
      "subcategory": "payload-conversion",
      "apis": [],
      "components": [
        "payload-converter",
        "serialization"
      ],
      "concepts": [
        "serialization",
        "deserialization",
        "payload-handling",
        "custom-conversion",
        "data-encoding"
      ],
      "severity": "medium",
      "userImpact": "Users need a standard way to customize how payloads are converted to/from their preferred serialization formats.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The Payload Converter interface has been implemented in the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:09.070Z"
    },
    {
      "summary": "Implement the Activity class for the Ruby SDK to provide core activity functionality for Temporal workflows.",
      "category": "feature",
      "subcategory": "activity-framework",
      "apis": [],
      "components": [
        "activity",
        "ruby-sdk",
        "class-implementation"
      ],
      "concepts": [
        "activity-execution",
        "worker-integration",
        "sdk-feature"
      ],
      "severity": "high",
      "userImpact": "Users cannot use activities in Ruby workflows until this core class is implemented.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Activity class was implemented for the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 9,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:38:07.507Z"
    },
    {
      "summary": "Implement Activity Context for the Ruby SDK to provide context information to activity functions, enabling access to workflow and task metadata during activity execution.",
      "category": "feature",
      "subcategory": "activity-context",
      "apis": [
        "ActivityContext"
      ],
      "components": [
        "activity-executor",
        "context-management",
        "ruby-sdk"
      ],
      "concepts": [
        "activity-execution",
        "context-passing",
        "metadata-access",
        "task-information"
      ],
      "severity": "medium",
      "userImpact": "Ruby SDK users cannot access activity context information like workflow execution details, task metadata, and execution history during activity execution.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Activity Context was implemented and integrated into the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 8,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:37:53.922Z"
    },
    {
      "summary": "Implement a basic activity Worker for the Ruby SDK to handle activity execution and lifecycle management.",
      "category": "feature",
      "subcategory": "worker",
      "apis": [
        "ExecuteActivity",
        "Worker"
      ],
      "components": [
        "worker",
        "activity-executor",
        "activity-handler"
      ],
      "concepts": [
        "activity",
        "worker",
        "task-execution",
        "activity-lifecycle",
        "concurrency",
        "heartbeat"
      ],
      "severity": "high",
      "userImpact": "Users cannot run activities in the Ruby SDK without this fundamental worker implementation.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented and issue closed.",
      "related": [],
      "keyQuote": null,
      "number": 7,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:37:51.924Z"
    },
    {
      "summary": "Request to implement a shared thread pool for the Ruby SDK. This issue was closed as obsolete due to an SDK rewrite that made the previous implementation no longer applicable.",
      "category": "feature",
      "subcategory": "thread-pool",
      "apis": [],
      "components": [
        "thread-pool",
        "worker",
        "executor"
      ],
      "concepts": [
        "concurrency",
        "resource-pooling",
        "performance",
        "threading"
      ],
      "severity": "low",
      "userImpact": "Users would benefit from optimized thread pool management for better resource utilization and performance.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "invalid",
      "resolutionDetails": "The SDK underwent a rewrite/refresh and this issue no longer applies to the current version.",
      "related": [],
      "keyQuote": "The SDK is undergoing a rewrite/refresh and this issue applied to a previous version and is no longer applicable",
      "number": 6,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:37:55.676Z"
    },
    {
      "summary": "Implement WorkflowHandle for the Ruby SDK to provide a handle for workflow execution interactions.",
      "category": "feature",
      "subcategory": "workflow-handle",
      "apis": [
        "WorkflowHandle"
      ],
      "components": [
        "workflow-client",
        "workflow-execution",
        "ruby-sdk"
      ],
      "concepts": [
        "workflow-handle",
        "workflow-execution",
        "client-api",
        "async-operations"
      ],
      "severity": "high",
      "userImpact": "Users cannot interact with or manage workflow executions through a handle interface in the Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "WorkflowHandle was implemented for the Ruby SDK",
      "related": [],
      "keyQuote": null,
      "number": 5,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:37:40.126Z"
    },
    {
      "summary": "Implement the Temporal::Client class for the Ruby SDK to enable client-side communication with Temporal services.",
      "category": "feature",
      "subcategory": "client-implementation",
      "apis": [],
      "components": [
        "client",
        "connection",
        "rpc"
      ],
      "concepts": [
        "initialization",
        "service-communication",
        "sdk-core"
      ],
      "severity": "high",
      "userImpact": "Users cannot interact with Temporal services without a working Client implementation in the Ruby SDK.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "Feature was implemented as part of Ruby SDK development.",
      "related": [],
      "keyQuote": null,
      "number": 4,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:37:41.970Z"
    },
    {
      "summary": "Implement the Temporal::Connection class for the Ruby SDK, providing the foundation for establishing and managing connections to Temporal servers.",
      "category": "feature",
      "subcategory": "connection-management",
      "apis": [
        "Connection"
      ],
      "components": [
        "connection",
        "client",
        "sdk-core"
      ],
      "concepts": [
        "connection",
        "server-communication",
        "initialization",
        "ruby-sdk",
        "client-setup"
      ],
      "severity": "high",
      "userImpact": "Users cannot establish connections to Temporal servers without the Connection class implementation.",
      "rootCause": null,
      "proposedFix": null,
      "workaround": null,
      "resolution": "fixed",
      "resolutionDetails": "The Temporal::Connection class was implemented as a core component of the Ruby SDK.",
      "related": [],
      "keyQuote": null,
      "number": 3,
      "repo": "temporalio-sdk-ruby",
      "generatedAt": "2026-01-11T21:37:38.413Z"
    }
  ]
}