{"assignees":[],"author":{"id":"MDQ6VXNlcjI2NDQwMDQ0","is_bot":false,"login":"AndresBena19","name":"Andres Benavides"},"body":"###  Is your feature request related to a problem? Please describe.\n\nCurrently, Temporal Java SDK users who need OpenTelemetry integration must rely on the temporal-opentracing module with an OpenTelemetry compatibility layer (https://github.com/open-telemetry/opentelemetry-java/tree/main/opentracing-shim).\n\n  There are documented considerations in the https://opentelemetry.io/docs/specs/otel/compatibility/opentracing/#when-to-use, particularly with baggage propagation, as it specifically warns:  _\"The related Baggage may not be properly propagated if the OpenTelemetry API is consumed along the OpenTracing Shim.\"_, _\"Consuming both the OpenTracing Shim and the OpenTelemetry API in the same codebase is not recommended for the following scenarios\"_\n\n  The documentation explicitly recommends against using the shim when:  _\"consuming both OpenTracing Shim and OpenTelemetry API in the same codebase,\"_ which is precisely the scenario I am facing while trying to use [OpenTelemetry Baggage Span Processor.](https://github.com/open-telemetry/opentelemetry-java-contrib/tree/main/baggage-processor)\n\n  As OpenTracing is in maintenance mode and OpenTelemetry is the industry standard (https://www.cncf.io/projects/opentelemetry/), a native implementation would provide the recommended path forward for reliable, feature-complete tracing in Temporal workflows.\n\n###  Describe the solution you'd like\n\n I would like to contribute with a new temporal-opentelemetry module that provides native OpenTelemetry integration for the Temporal Java SDK. This module:\n\n  1. Offers direct OpenTelemetry integration without requiring compatibility shims\n  2. Provides full W3C TraceContext compatibility\n  4. Integrates seamlessly with the broader OpenTelemetry ecosystem\n\n  The module will be similar to opentracing but using native opentelemetry API components\n\n###  Describe alternatives you've considered\n  1. Continuing to use temporal-opentracing with the OpenTelemetry compatibility layer, but add new SpanProcessor to capture the baggage data but not using the recommend approach\n 2. Create custom temporal interceptors in order to create out own traces and span using open-telemetry directly  \n\n\n###   Additional context\nThis implementation parallels the structure of the `temporal-opentracing` module, making it easy for users to migrate to use native opentelemetry instrumentation without configure a shim/bridge. It provides a cleaner, more efficient way to integrate Temporal with OpenTelemetry observability stacks.\n\n","closedAt":"2025-09-25T22:47:55Z","comments":[{"id":"IC_kwDODN12PM7G2gjq","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Yes we would like to add pure open telemetry tracing interceptor. The exact standard still needs to be designed across our various SDKs so this is something that would need to be done by a core Temporal member.\n\nIf you would like to share your own implementation of an open telemetry interceptor I would encourage you to share it on our [code exchange](https://temporal.io/code-exchange)\n\n","createdAt":"2025-09-25T22:56:42Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/2671#issuecomment-3336177898","viewerDidAuthor":false}],"createdAt":"2025-09-25T15:45:07Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":null,"number":2671,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":3}}],"state":"CLOSED","title":"Tracing - Native OpenTelemetry Interceptors","updatedAt":"2025-10-06T19:00:14Z","url":"https://github.com/temporalio/sdk-java/issues/2671"}
