{"assignees":[],"author":{"id":"MDQ6VXNlcjEwODc0MQ==","is_bot":false,"login":"robzienert","name":"Rob Zienert"},"body":"**Is your feature request related to a problem? Please describe.**\n\nIt's great that the Spring starter exists, but it has deviated from standard Spring autoconfiguration practices that make it more difficult to extend and use in an enterprise setting.\n\nThere are two major areas of non-standard behaviors that come immediately to mind:\n\n1. Using bean names to resolve `TemporalOptionsCustomizer<T>` implementations for root / non-root namespaces. This is against Spring conventions, which would normally encourage using an annotation or interface method for filtered selection.\n2. Related, forcing a single `TemporalOptionsCustomizer<T>` per-namespace, and not allowing use of Spring bean precedence or ordering semantics.\n\nSome concrete examples of how this manifests:\n\nAt Netflix, we have our own Spring Boot Netflix library suite that extends Spring Boot for our purposes, often customizing behavior of upstream starters and libraries as well as our own. Similarly, we have a Netflix Temporal starter that everyone in Netflix uses. It handles stuff like wiring up the SDK with our tracing, metrics, and configuring mTLS for our clients on behalf of our users.\n\nDue to the first issue, we needed to write a `BeanPostProcessor` that iterates `TemporalProperties` to register bean definitions implementing `TemporalOptionsCustomizer<WorkflowServiceOptions.Builder>` to use our custom `SslContext` implementation such that every root and non-root namespace is able to connect to our proxy.\n\nDue to the second issue, if we wanted to say - for example - customize the `SpanBuilderProvider` from `temporal-opentracing` to fix #2117, we'd implement `TemporalOptionsCustomizer<WorkerClientOptions.Builder>` and `TemporalOptionsCustomizer<WorkerFactoryOptions.Builder>` to first remove the `OpenTracingInterceptor` provided by the SDK and replace it with one using our custom `SpanBuilderProvider`. Because the starter forces 1 customizer per-namespace, it would take away the freedom from our users to customize either of these options builders. Though, due to how `AutoConfigurationUtils.chooseTemporalCustomizerBean` is implemented, there's no guarantee that the platform-provided customizer would even be chosen because it doesn't respect Spring bean precedence nor ordering, so if one of our users were to implement either interface, there is a random chance their customizer would be applied or ours. Because bean precedence is not respected, creating a composite customizer with `@Primary` is also not possible.\n\nI haven't reviewed the rest of the starter very closely, but a spot-check does show the same issue also exists with `DataConverter` selection as well.\n\n\n**Describe the solution you'd like**\n\nThe starter should approach integrating with Spring in a more standard/idiomatic Spring way. \n\nA couple suggestions:\n\n1. `TemporalOptionsCustomizer<T>` could add a new filter method to provide what namespace(s) it pertains to (read: supporting individual or global customizers).\n2. Always accept `List<TemporalOptionsCustomizer<T>>` and if there are more than 1 after filtering, apply them in order, rather than `findFirst` on a map that leads to non-determinstic configuration and loss of desired configuration.\n\n**Describe alternatives you've considered**\n\n1. Implement concrete singletons of `TemporalOptionsCustomizer<T>` for each `T`, and introduce a new interface for our users to implement. We'd need to add some validation to assert no one else implements this interface. Discarded as we already have users who implement `TOC<T>`, and its an unobvious contract.\n\n**Additional context**\nAdd any other context or screenshots about the feature request here.\n","closedAt":"2025-09-23T16:50:28Z","comments":[{"id":"IC_kwDODN12PM7CzN9b","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Note, since there are a couple great suggestions here pulling them out into a [separate issue](https://github.com/temporalio/sdk-java/issues/2656) so each issue can focus on a concrete deliverable ","createdAt":"2025-09-08T22:18:43Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/2638#issuecomment-3268206427","viewerDidAuthor":false}],"createdAt":"2025-08-25T16:52:48Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":null,"number":2638,"reactionGroups":[],"state":"CLOSED","title":"Spring Boot: Allow multiple TemporalOptionsCustomizer per namespace ordered by Springboot convention ","updatedAt":"2025-09-23T16:50:28Z","url":"https://github.com/temporalio/sdk-java/issues/2638"}
