{"assignees":[],"author":{"id":"MDQ6VXNlcjYxMjQ2MDI=","is_bot":false,"login":"djivko","name":"Zhivko Donev"},"body":"## Description\nI want to implement a custom FailureConverter which serializes custom application exception into ApplicationFailure and deserializes Failures back to the custom application exception. The goal is to make the temporal RPC communication transparent to the application logic and have better cross-language compatibility.  \n\n\n## Expected Behavior\n1. Activity throws exception -> FailureConverter.exceptionToFailure -> SDK internal logic and failure wrapping as needed -> Temporal Server\n2. Temporal Server -> Worker processing -> FailureConverter.failureToException -> Workflow code\n3. Workflow throws exception -> FailureConverter.exceptionToFailure -> SDK internal logic and failure wrapping as needed -> Temporal Server\n4. Temporal Server -> Client processing -> FailureConverter.failureToException -> Client raises exception\n\n## Actual Behavior\n1 to 3 work as expected.\nThe control is never returned to the calling code and the workflow gets stuck in never ending loop\n\n## Steps to Reproduce the Problem\n\nAttaching a simple test file that reproduces the issue\n[FailureConverterTest.java](https://github.com/user-attachments/files/23730477/FailureConverterTest.java)\n## Specifications\n\n  - Version: Java-SDK 1.32.0\n\nNote: Prior to SDK 1.28 failureToException required to return TemporalFailure. However with the change of the signature to RuntimeException the expectation is that any runtime exception returned from that method are supported.\n\nNote 2: GO-SDK seems to properly handle the same use case. There the result of failureToError method will be attached as the cause of either WorkflowExecutionError or ActivityFailureError and due to error unwrapping in GO you will be able to get the original error.\n\nNote 3: The documentation about FailureConverter is really poor and there are literary 0 examples (in any language) about proper implementation of custom converter. The only external source I managed to find that touches on error handling with temporal was [this blog post](https://www.flightcontrol.dev/blog/temporal-error-handling-in-practice) which again stress out the lack of documentation and examples and instead implements custom logic with interceptors. \n","closedAt":"2025-11-25T02:55:02Z","comments":[{"id":"IC_kwDODN12PM7VAH7r","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"Looking at your reproduction everything is operating correctly. Your custom `FailureConverter` is throwing a runtime exception inside a workflow which will cause a workflow task failure. If you want your exception to fail the workflow then you need to tell the SDK. \n\nexample:\n```\n  @Rule\n  public TestWorkflowRule testWorkflowRule =\n      TestWorkflowRule.newBuilder()\n          .setWorkflowTypes(\n              WorkflowImplementationOptions.newBuilder()\n                  .setFailWorkflowExceptionTypes(CustomException.class)\n                  .build(),\n              TestWorkflowImpl.class)\n          .setDoNotStart(true)\n          .setWorkflowClientOptions(\n              WorkflowClientOptions.newBuilder()\n                  .setDataConverter(\n                      DefaultDataConverter.newDefaultInstance().withFailureConverter(new FC()))\n                  .build())\n          .build();\n```\n\nI will say this use of failure converter is not recommend or really supported. Per the SDK docs\n\n```\n   * <p>WARNING: Most users should _never_ need to override the default failure converter. To\n   * encrypt the content of failures, see {@link CodecDataConverter} instead.\n```\n\nThe intended use case of failure converters is to help with encryption of potentially sensitive data inside exceptions. I would recommend you stick with normal Temporal failures then trying to hack serialization.\n\n>The goal is to make the temporal RPC communication transparent to the application logic and have better cross-language compatibility.\n\nTemporal application failures are fully compatible across languages and the recommend error format to pass errors across Temporal. For more details on handling errors in Temporal I would recommend you take a look at our course https://temporal.io/blog/error-handling-strategy-free-hands-on-training \n\n\n","createdAt":"2025-11-25T02:55:02Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/2737#issuecomment-3573579499","viewerDidAuthor":false}],"createdAt":"2025-11-24T19:18:53Z","labels":[],"milestone":null,"number":2737,"reactionGroups":[],"state":"CLOSED","title":"Returning custom RuntimeException from FailureConverter leads to stuck workflows","updatedAt":"2025-11-25T02:55:02Z","url":"https://github.com/temporalio/sdk-java/issues/2737"}
