{"assignees":[],"author":{"id":"MDQ6VXNlcjUyNDgz","is_bot":false,"login":"tylercunnion","name":"Tyler Cunnion"},"body":"**Is your feature request related to a problem? Please describe.**\r\nIt doesn't seem easy (or possible) to test Activity methods which make use of HeartbeatDetails for resuming an aborted process, etc. The `TestActivityEnvironment` does not allow for Activity retries (all exceptions are set to non-retryable), and there is no method for \"faking\" a previous heartbeat call before calling the Activity method under test.\r\n\r\n**Describe the solution you'd like**\r\nI'd like to be able to call a method to simulate a previous heartbeat. Whatever mechanism this is would have to be accessible from the `executeActivity` method [here](https://github.com/temporalio/sdk-java/blob/9d843cd927cc0039eb77d30182080f40926eac62/temporal-testing/src/main/java/io/temporal/testing/TestActivityEnvironmentInternal.java#L270). Since the only real externally-facing part of the test environment is the `TestActivityEnvironment` object itself, that would probably be the place to hook into. We'd have to add something like a `setHeartbeatDetails` with parameters indicating the Activity name to apply this heartbeat to as well as the heartbeat payload. Then, inside `executeActivity` it would call a `getHeartbeatDetails` for the given Activity name which would return the heartbeat payload and clear the buffer. (Definitely not married to any of the specifics here, just my initial thought)\r\n\r\n**Describe alternatives you've considered**\r\nAllowing the `TestActivityEnvironment` to retry Activity executions could also work, as long as heartbeats are persisted and available to the retry as normal.\r\nThe final option would be to work around this entirely and use `TestWorkflowEnvironment` together with an ad-hoc Workflow that only executes the Activity being tested.","closedAt":"2023-01-05T22:13:13Z","comments":[{"id":"IC_kwDODN12PM5J5siO","author":{"login":"Bennett-Lynch"},"authorAssociation":"NONE","body":"+1. Have a long-running activity that resumes from a previous heartbeat's checkpoint and it's difficult or not possible to test.","createdAt":"2022-09-07T20:49:21Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/1310#issuecomment-1239861390","viewerDidAuthor":false}],"createdAt":"2022-07-16T01:14:27Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":null,"number":1310,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":3}}],"state":"CLOSED","title":"Provide a way to set Heartbeat details in TestActivityEnvironment","updatedAt":"2023-01-05T22:13:13Z","url":"https://github.com/temporalio/sdk-java/issues/1310"}
