{"assignees":[],"author":{"id":"MDQ6VXNlcjUzMjEwOA==","is_bot":false,"login":"Spikhalskiy","name":"Dmitry Spikhalsky"},"body":"We should add an init method to workflows that allow some code to be run before any query, signal, or workflow method is processed.\r\nThis method should have access to workflow method input parameters.\r\nThis method doesn't have the same properties and guarantees as a workflow method. It shouldn't omit commands and doesn't work with WFT, because it would make it indistinguishable from the workflow method. It should be just a regular Java method.\r\n\r\nThis should solve the following situation:\r\n1. A signal method can arrive before the workflow main method execution (reset preserving the signals on the first workflow task)\r\n2. A signal method may require some initialization to be done.\r\n3. General advice is to perform the initialization in the constructor or init block, BUT some initialization may require access to workflow input parameters. In this situation, users have to perform non-trivial gymnastics saving the signals in the field and processing them in a delayed manner in the workflow code.\r\n\r\nIt will also make it extra clear that Signals may arrive before the workflow code in triggered and the initialization should be handled with caution in some cases.\r\n\r\nAn alternative is to make the constructor such an init method. It will play nicely because it will be clear that it's not a workflow code and doesn't have properties of the workflow code.\r\n\r\n# Dynamic Workflow\r\nWith regular typed workflows, listeners (signals and queries) are registered by SDK before processing signals. Currently, it's impossible to mimic this behavior with Dynamic Workflows.\r\nRight now the only way to register listeners in Dynamic Workflow is to call the register methods from the workflow code. \r\nBut with signalToStart, signal is getting delivered before the execution of the workflow method, at the moment when Dynamic Workflow code didn't execute yet, hence no listener is present. \r\nThis makes init() method a necessity for Dynamic Workflows, not a convenience.\r\n\r\n\r\nRelated to #864\r\nRelated to a discussion under a user request in a community slack: https://temporalio.slack.com/archives/CTT84KXK9/p1636375128042600\r\n","closedAt":"2024-09-17T01:28:01Z","comments":[{"id":"IC_kwDODN12PM6HaMUR","author":{"login":"cretz"},"authorAssociation":"MEMBER","body":"Saw #2166 was marked as dupe.\r\n\r\nI do want to make sure there is a clear difference between \"run any code before start/signal/update\" and \"initialize state before start/signal/update\". I think `@WorkflowInit` can be a constructor annotation that, when set, means the constructor accepts the exact params as the primary workflow method (enforced at registration). Users can use this to set `final` fields that rely on start parameters. But I don't think we'd want to encourage command-creating logic in the constructor (though I guess it's technically possible in Java where you don't have to mark it async). I think general initialization code that creates commands is a different topic.","createdAt":"2024-08-06T17:28:10Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/865#issuecomment-2271790353","viewerDidAuthor":false},{"id":"IC_kwDODN12PM6HaO62","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"> I think general initialization code that creates commands is a different topic.\r\n\r\nI agree, but that is not covered by the [feature request](https://github.com/temporalio/features/issues/400)","createdAt":"2024-08-06T17:34:06Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":1}}],"url":"https://github.com/temporalio/sdk-java/issues/865#issuecomment-2271801014","viewerDidAuthor":false}],"createdAt":"2021-11-10T18:26:33Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":null,"number":865,"reactionGroups":[{"content":"THUMBS_UP","users":{"totalCount":5}}],"state":"CLOSED","title":"Add init method to workflow","updatedAt":"2024-09-17T01:28:01Z","url":"https://github.com/temporalio/sdk-java/issues/865"}
