{"assignees":[],"author":{"id":"MDQ6VXNlcjEwODc0MQ==","is_bot":false,"login":"robzienert","name":"Rob Zienert"},"body":"**Is your feature request related to a problem? Please describe.**\r\nIt's currently unclear the SDK's thread usage, as no thread pools are reporting their metrics. This makes it more difficult to tune workers.\r\n\r\n**Describe the solution you'd like**\r\nAdding a scheduled thread to get snapshot metrics on the thread pool's core, active, and max sizes would help. A synthetic \"blocked\" tasks metric may also be useful via subtracting `taskCount - completedTaskCount`.\r\n\r\nWhat I'm unclear about is how to correctly tag these metrics. `Poller` has an `identity`, but as best as I can tell this is going to be different per-process so tracking how thread pool usage changes through application deployments would be impossible. Is there a good option here where pollers could get a deterministic name to reference them by for use in metric tags?\r\n","closedAt":"2021-09-28T15:52:22Z","comments":[{"id":"IC_kwDODN12PM40rOaG","author":{"login":"robzienert"},"authorAssociation":"NONE","body":"@vitarb I could use your opinion on implementation here...\r\n\r\nI believe I need to introduce either: A) An `identity` naming scheme, or B) A new `identityGroup` property for `WorkflowClientOptions`. Right now the `identity` defaults to `ManagementFactory.getRuntimeMXBean().getName()`, which make sense since we want all pollers to have unique identifiers. However, for the purposes of tracking metrics, we want an identifier that will stay consistent across processes and new worker deployments to correlate metrics.\r\n\r\nDo you have a preference on which path to take? I think adding a new property (such as `identityGroup`) would be the most unobtrusive path forward for existing SDK users. This property would be nullable and default to `null`. This value, when nonnull, would be added as a `group` tag to the metric scope.\r\n\r\nThoughts?","createdAt":"2021-07-20T22:25:20Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/535#issuecomment-883746438","viewerDidAuthor":false},{"id":"IC_kwDODN12PM40rPJJ","author":{"login":"Spikhalskiy"},"authorAssociation":"CONTRIBUTOR","body":"@robzienert as we discussed, you can use ```WorkflowClientOptions#identity``` to set a worker identity, it's exposed and allowed to be overridden specifically for this purpose.","createdAt":"2021-07-20T22:32:48Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/535#issuecomment-883749449","viewerDidAuthor":false},{"id":"IC_kwDODN12PM40rRk2","author":{"login":"robzienert"},"authorAssociation":"NONE","body":"My question is not about identifying a single worker, which `identity` is perfectly suited for. My question is identifying a group of like-workers, across processes. Here's an example:\r\n\r\nLet's say we have an autoscaling group of workers, named `myworker-v000`. There are 3 EC2 instances inside of it, all of them using the same AMI, and so also configured exactly the same. In this case, there will be 3 unique `identity` values for each worker: This is desirable.\r\n\r\nNow let's say I deploy a new version of my workers, named `myworker-v001`. These workers will still be doing the same thing, but with potentially new workflow / activity code. These will also all get new `identity` values: This is also desirable.\r\n\r\nWhat is missing is a metric scope tag that will allow me to correlate the thread pools of these worker pollers between processes within the same ASG, as well as correlate the thread pools _across_ ASGs as the software changes. For this, I'm proposing that a new field called `identityGroup` is added, this field is _not unique_ and would be static across all processes and autoscaling groups. It would provide SDK users a means of understanding thread pool usage changes as code changes. Without such a tag, what I'm describing is impossible if there is more than 1 poller in the process. Defining a static `identity` value would provide us this capability, but then we would lose the ability to identify pollers uniquely, which would be a regression.","createdAt":"2021-07-20T23:01:15Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/535#issuecomment-883759414","viewerDidAuthor":false},{"id":"IC_kwDODN12PM43ZOCh","author":{"login":"Spikhalskiy"},"authorAssociation":"CONTRIBUTOR","body":"Rob was able to solve the problem with the APIs and abilities Temporal provides now.\r\nFeel free to reopen any time if something is lacking.","createdAt":"2021-09-28T15:52:16Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/535#issuecomment-929357985","viewerDidAuthor":false}],"createdAt":"2021-06-09T23:15:46Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":null,"number":535,"reactionGroups":[],"state":"CLOSED","title":"Add pollExecutor thread pool metrics","updatedAt":"2021-09-28T15:52:22Z","url":"https://github.com/temporalio/sdk-java/issues/535"}
