{"assignees":[{"id":"MDQ6VXNlcjUzMjEwOA==","login":"Spikhalskiy","name":"Dmitry Spikhalsky","databaseId":0}],"author":{"id":"MDQ6VXNlcjUzMjEwOA==","is_bot":false,"login":"Spikhalskiy","name":"Dmitry Spikhalsky"},"body":"WorkflowWorker.TaskHandlerImpl#handle:\r\n\r\n```\r\nif (...) {\r\n        runLock = runLocks.getLockForLocking(task.getWorkflowExecution().getRunId());\r\n        // Acquiring a lock with a timeout to avoid having lots of workflow tasks for the same run\r\n        // id waiting for a lock and consuming threads in case if lock is unavailable.\r\n        if (!runLock.tryLock(1, TimeUnit.SECONDS)) {\r\n          throw new UnableToAcquireLockException(\r\n              \"Workflow lock for the run id hasn't been released by one of previous execution attempts, \"\r\n                  + \"consider increasing workflow task timeout.\");\r\n        }\r\n      }\r\n      ...\r\n      } finally {\r\n        if (runLock != null) {\r\n          System.out.println(\"released a lock for: \" + task.getWorkflowExecution().getRunId());\r\n          runLocks.unlock(task.getWorkflowExecution().getRunId());\r\n        }\r\n      }\r\n```\r\n\r\nIf the exception is thrown and the lock is not taken\r\n- it means that another thread acquired the lock and still processing this runId\r\n- the `finally` block will actually release the lock while another thread is still working on the task\r\nIf the task gets distributed to the same worker after that, two threads will start working on the same instance of the workflow, which will lead to all kinds of problems, because workflow state machines are expected to be managed by one thread only.\r\n\r\nThis scenario is not happening on a normal happy path. This scenario usually doesn't happen on a bad path too, because if JavaSDL detects blocking of workflow task, it kills it with DeadlockDetector. Situations where local activities keep Workflow Task open also have special handling. But it may happen if something causes blocking of workflow tasks that are not getting detected by the Deadlock Detector.\r\n","closedAt":"2022-04-19T15:03:11Z","comments":[],"createdAt":"2022-04-16T22:50:17Z","labels":[],"milestone":{"number":11,"title":"1.10.0","description":"","dueOn":"2022-05-03T00:00:00Z"},"number":1146,"reactionGroups":[],"state":"CLOSED","title":"Code using WorkflowRunLockManager may release locks that are owned by other threads","updatedAt":"2022-04-19T15:03:11Z","url":"https://github.com/temporalio/sdk-java/issues/1146"}
