{"assignees":[],"author":{"id":"U_kgDODjRnTA","is_bot":false,"login":"sivakumarpalakurthi","name":""},"body":"I am implementing a custom ContextPropagator named TenantIdContextPropagator to propagate MDC attributes such as tenant_id across the logs generated by Temporal workflows. My goal is to ensure that the tenant context flows seamlessly throughout the entire Temporal workflow execution.\n\nTo enable this propagation, I need to register my custom ContextPropagator with the WorkflowClientOptions so that the context is correctly applied in the workers.\n\nMy understanding is that the WorkflowClient instances used to create workers for workflows must be configured with this propagator to ensure the context is propagated properly.\n\nI created a class implementing TemporalOptionsCustomizer<WorkflowClientOptions.Builder> and overridden the customize method to include my custom ContextPropagator. This approach works correctly with default namespace.\n\nHowever, my Spring Boot application is configured with three different namespaces using the Temporal Spring Boot autoconfiguration via application.yaml. I am unsure how to register the custom ContextPropagator across all these namespaces in this multi-namespace setup.\n\nCould you please advise on the best approach to register my custom ContextPropagator for all configured namespaces in a Spring Boot application?\nBTW, I was referring to this https://docs.temporal.io/develop/java/spring-boot-integration#customize-options\nThanks in advance.","closedAt":"2025-10-16T14:22:50Z","comments":[{"id":"IC_kwDODN12PM7LUjLm","author":{"login":"Quinn-With-Two-Ns"},"authorAssociation":"MEMBER","body":"You can configure a different [customizer](https://github.com/temporalio/sdk-java/tree/master/temporal-spring-boot-autoconfigure#customization) per namespace. So in your customizer you can set a `ContextPropagator`","createdAt":"2025-10-16T14:22:51Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/2687#issuecomment-3411161830","viewerDidAuthor":false}],"createdAt":"2025-10-15T17:46:55Z","labels":[],"milestone":null,"number":2687,"reactionGroups":[],"state":"CLOSED","title":"How to Register a Custom ContextPropagator for Multiple Temporal Namespaces in Spring Boot","updatedAt":"2025-10-16T14:22:51Z","url":"https://github.com/temporalio/sdk-java/issues/2687"}
