{"assignees":[],"author":{"id":"MDQ6VXNlcjc4Mzc3ODM1","is_bot":false,"login":"ranand-git","name":""},"body":"## Expected Behavior\r\nThe Data class input parameter to a Workflow method could be changed in the following ways as part of a new deployment/rollout:\r\n- remove an existing field in the input parameter class definition and/or\r\n- add a new field and/or\r\n- modify the type (and/or name) of a field. \r\n\r\nNote that it could be a combination of the above as well.\r\n\r\nTemporal needs to ensure that the old workers running the old version of the code don't break. Ideally, nothing should break.\r\n\r\n## Actual Behavior\r\nThe observed behavior is that when say a new field is added, the old worker code fails during de-serialization because of the additional fields added.\r\n\r\nAre we **expected** to annotate our data classes with: \"@JsonIgnoreProperties(ignoreUnknown = true)\" before we rollout a breaking change?\r\n\r\nI haven't tried to repro what happens when a field is removed or when the data type and/or name of a field is changed. Perhaps we need to use custom de-serializators for the latter.\r\n\r\nAll of this should be well documented. Currently, all that is documented is Temporal versioning which kicks in only after de-serialization has happened. While Temporal versioning is good for branching code when the behavior is drastically different, there is a gap on how to handle data class changes.\r\n\r\nNote that this issue exists even for activities (when the input/output classes they use change). However, it is a blocker for data class changes for workflow methods. The fundamental question is it **even possible** to iterate on data classes used in Workflow methods or is that a sailed ship?\r\n\r\n## Steps to Reproduce the Problem\r\n\r\n  1. Change the data class input to a Workflow or activity by adding, removing and changing some fields and deploy this change to a running system. Ideally, test addition, removal and change separately to correctly observe the behavior.\r\n  2. Rollout this change.\r\n  3. The old workers running the old code will barf when they try to de-serialize the data input serialized by the new code.\r\n\r\n## Specifications\r\n\r\n  - Version: 1.0.3\r\n  - Platform: Java SDK\r\n","closedAt":"2021-09-28T15:45:40Z","comments":[{"id":"IC_kwDODN12PM43ZMuI","author":{"login":"Spikhalskiy"},"authorAssociation":"CONTRIBUTOR","body":"Temporal doesn't handle the serialization of inputs/outputs in its code.\r\nBy default Temporal uses Jackson in it's data converters and this behavior is defined by Jackson mapper configuration.\r\nYou can set your own data converter with your own settings, for example ignoring newly added fields.\r\nWe use pretty much an [original mapper](https://github.com/temporalio/sdk-java/blob/30420212a26283cf7cbe6339512058a3186074e8/temporal-sdk/src/main/java/io/temporal/common/converter/JacksonJsonPayloadConverter.java#L40) to give users the default behavior they get used to.\r\n\r\nI don't think that Temporal documentation should have the details of how to make changes in data classes that are compatible with **Jackson** or any other serialization framework that may be used.\r\n\r\n\r\nWe will consider adding information about default out-of-the-box serializers we supply in data converters.\r\nWe will make sure to express an idea \"You should be aware of the serializer that you use and its configuration and make changes to data classes that are compatible with your combination of serializer and options if you want to maintain compatibility\".\r\n\r\nClosing the issue for being not a bug and more of misconfiguration.\r\nThe steps should be to improve Temporal documentation in this area.","createdAt":"2021-09-28T15:45:40Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/328#issuecomment-929352584","viewerDidAuthor":false}],"createdAt":"2021-02-01T18:47:12Z","labels":[{"id":"MDU6TGFiZWwzMTgwNzE1ODU0","name":"invalid","description":"This doesn't seem right","color":"e4e669"}],"milestone":null,"number":328,"reactionGroups":[],"state":"CLOSED","title":"JSON de-serializer fails on field additions and removals","updatedAt":"2021-09-28T15:47:16Z","url":"https://github.com/temporalio/sdk-java/issues/328"}
