{"assignees":[],"author":{"id":"MDQ6VXNlcjUzMjEwOA==","is_bot":false,"login":"Spikhalskiy","name":"Dmitry Spikhalsky"},"body":"If workflow code is broken and creates an invalid command, workflow task gets failed-> recreated-> retried in a cycle. As a result, all workers end up utilizing all of their allowed by `maxConcurrentWorkflowTaskExecutionSize` (200 by default) parallel tasks processors to just hammer the server with either faulty commands or just reports about failed-again-workflow-task.\r\nWe need some kind of backoff or rate-limiting.\r\n\r\nCaused by user report in the community slack: https://temporalio.slack.com/archives/CTT84KXK9/p1637700233132300\r\nRelated to: #898 #900","closedAt":"2021-11-29T23:32:10Z","comments":[{"id":"IC_kwDODN12PM46ihpM","author":{"login":"Spikhalskiy"},"authorAssociation":"CONTRIBUTOR","body":"We can't handle it on the SDK side only in effective manner and we need support from Server to have an Exponential Backoff for Workflow Tasks, hence https://github.com/temporalio/temporal/issues/2238\r\n\r\nOn the SDK side, we implement proactive validation of Options that could cause invalid commands, so at least we have the default SDK side backoff utilizing Workflow Task Run Timeout.\r\n\r\nBut we make a conscious decision that we don't try to fully duplicate server-side validation logic and we will be performing only basic sanity checks on SDKs, which leaves the opportunity for a workflow code to effectively DDOS the server until server-side exponential backoff is in place.","createdAt":"2021-11-29T23:31:03Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/901#issuecomment-982129228","viewerDidAuthor":false}],"createdAt":"2021-11-24T22:45:22Z","labels":[],"milestone":null,"number":901,"reactionGroups":[],"state":"CLOSED","title":"Workers hammering server with incorrectly formed commands without rate limit or backoff","updatedAt":"2021-11-29T23:37:32Z","url":"https://github.com/temporalio/sdk-java/issues/901"}
