{"assignees":[],"author":{"id":"MDQ6VXNlcjYyMTQ3Mzg2","is_bot":false,"login":"vaclavbroz","name":""},"body":"In order to be able to analyse the activity implementation object in an activity interceptor the interceptor needs a reference to the object. This could be done by changing the init(context) method to init(context,activity). The typical use case will be to analyse annotations of the activity method to see what should be the behaviour of the interceptor.\r\n\r\nMore specifically it may be useful to e.g. raise an alarm in a monitoring system whenever an activity fails for the 10th time while for other activities this is not necessary. A good way to do that e.g. in Java would be to define a new annotation and annotate only some of the activity methods (in the implementation class). To allow reflection to work properly a reference to the real object should be passed to the interceptor, not the proxy.\r\n\r\nAn alternative would be to provide to the interceptor a limited number of additional information about the activity implementation object, so for instance all annotations of the activity method both at the interface level as well as at the implementation level. But that would be reinventing the wheel in each programming language.\r\n\r\nWhile this proposal seems like breaking the encapsulation of the activity implementation object by temporal, users tend to use interceptors for that type of business logic and need to overcome the challenge by maintaining references to the activity implementations using some other patterns which is in fact worse.","closedAt":"2025-05-15T02:15:18Z","comments":[],"createdAt":"2023-04-18T12:49:32Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":null,"number":1750,"reactionGroups":[],"state":"CLOSED","title":"Pass activity in init to ActivityInboundCallInterceptor","updatedAt":"2025-05-15T02:15:18Z","url":"https://github.com/temporalio/sdk-java/issues/1750"}
