{"assignees":[],"author":{"id":"MDQ6VXNlcjk1MzAwMDQ=","is_bot":false,"login":"40lsgy1","name":"40lsgy1"},"body":"I'm encountering an issue while using Temporal to build a DSL system. In my implementation, each Activity is wrapped in a CancellationScope to enable individual cancellation handling (with retry/skip options after cancellation). The CancellationType is set to WAIT_CANCELLATION_COMPLETED. I have two related problems:\n\n1. Worker Crash During Activity Execution: I recently observed that if a worker crashes during an Activity's business logic execution and fails to recover within the StartToCloseTimeout period, the Activity does not retry its business logic after the worker recovers. According to the documentation, StartToCloseTimeout should only limit the duration of a single Activity attempt. My expectation is that after worker recovery, the Activity should retry (allowing cancellation cleanup logic to execute) rather than terminating due to timeout.\n\n2. Detecting CancellationScope Status After Exit: My Activities nest CancellationScope within Async.procedure Promises. When a CanceledFailure occurs, the WAIT_CANCELLATION_COMPLETED policy ensures the Activity's logic completes successfully before exiting the scope. After exiting the CancellationScope, I need to execute state update logic (via other Activities). Is there a way to determine whether the CancellationScope was canceled immediately after exiting it? This would allow me to conditionally execute state updates using newDetachedCancellationScope.\n\n","closedAt":"2026-01-08T16:44:52Z","comments":[{"id":"IC_kwDODN12PM7eAuJa","author":{"login":"maciejdudko"},"authorAssociation":"MEMBER","body":"1. When an activity is requested to cancel, then it will not be retried anymore. This is by design. Activities are non-durable and there are no guarantees that any cleanup logic will execute in case of failure or worker crash. If the workflow needs to ensure cleanup is done, it needs to catch the activity failure and run the cleanup logic as a separate activity. One common way is the saga design pattern, where every activity is paired with a compensation activity that undoes its work and in case of failure, the workflow executes a list of compensations for all activities run up to this point. You can learn more about it from this blog post: https://temporal.io/blog/saga-pattern-made-easy You can also find more resources on sagas in [Temporal documentation](https://docs.temporal.io/evaluate/use-cases-design-patterns#saga).\n\n2. If you still have a reference to the `CancellationScope`, you can call the `isCancelRequested` method to check if it was canceled even after it finishes running. However, this is not a perfect representation of whether the activities inside have completed successfully or not. It's always better to memorize the result of activity execution itself, e.g. by storing the potential exception in a variable and later checking if it's null or not.\n\nIf you have more questions or need assistance, always feel free to post on `#java-sdk` channel in [Temporal Community Slack](https://t.mp/slack). I will close this issue as there's nothing to be fixed here.","createdAt":"2026-01-08T16:44:47Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/temporalio/sdk-java/issues/2753#issuecomment-3724730970","viewerDidAuthor":false}],"createdAt":"2025-12-31T08:23:53Z","labels":[],"milestone":null,"number":2753,"reactionGroups":[],"state":"CLOSED","title":"Unexpected Activity Timeout Behavior After Worker Crash & Need for CancellationScope Status Check","updatedAt":"2026-01-08T16:44:52Z","url":"https://github.com/temporalio/sdk-java/issues/2753"}
