{"assignees":[],"author":{"id":"MDQ6VXNlcjE1MDkzNTM1","is_bot":false,"login":"jeffschoner","name":"Jeff Schoner"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nActivity timeouts are only detectable by activity code when a heartbeat attempt reaches the Temporal server. Heartbeat throttling can significantly delay timeout detection because it prevents or delays some heartbeats from reaching the server. This in turn causes activity attempts to continue running even when any result will be rejected.\r\n\r\n**Describe the solution you'd like**\r\n\r\nWhile this exact model isn't directly applicable in Java, the Go SDK sets a context deadline when executing activities in `internal.activity.WithActivityTask` ([source](https://github.com/temporalio/sdk-go/blob/master/internal/activity.go#L251)) that allows for local detection of start-to-close and schedule-to-close timeouts being reached.\r\n\r\nInstead, I propose having the `heartbeat` method on the activity context throw a subclass of `ActivityCompletionException` when these timeouts are violated. All the information for calculating this is already present on the activity task (start-to-close timeout, schedule-to-close timeout, task attempt start time, task first scheduled time). This approach is consistent with other exceptions already thrown by this method for worker shutdown and activity cancellation.\r\n\r\n**Describe alternatives you've considered**\r\n\r\n*Interrupt the activity thread.* While it might be more thorough, this would be a much more invasive change to the existing activity programming model. Developers are already encouraged to catch `ActivityCompletionException` upon heartbeating to detect a need to exit activity execution early.\r\n\r\n*Add methods to the activity context for timeout detection.* This could be done in addition to or instead of the above. An exception does not have to be thrown, but is consistent with existing behavior of `heartbeat` around other activity completion actions.\r\n\r\n**Additional context**\r\n\r\nWhen I chatted with Maxim a while back about this on the Temporal Community Slack, he was supportive. Unfortunately, the thread appears to have been retentioned away. I don't believe an issue was ever opened for this.","closedAt":"2025-06-02T15:29:43Z","comments":[],"createdAt":"2023-05-21T21:22:34Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":null,"number":1770,"reactionGroups":[],"state":"CLOSED","title":"Timeouts should be detected locally during activity execution","updatedAt":"2025-06-02T15:29:43Z","url":"https://github.com/temporalio/sdk-java/issues/1770"}
