{"assignees":[{"id":"MDQ6VXNlcjUzMjEwOA==","login":"Spikhalskiy","name":"Dmitry Spikhalsky","databaseId":0}],"author":{"id":"MDQ6VXNlcjUzMjEwOA==","is_bot":false,"login":"Spikhalskiy","name":"Dmitry Spikhalsky"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nRight now WorkflowServiceStubsOptions#rpcLongPollTimeout has to be 70s or more because Server's default timeout is 60s.\r\nIt looks like now Server uses a timeout from the client that initiates the long poll to return the result (empty or non-empty) in time. And 60s is just a cap for this timeout.\r\n\r\n> Yimin Chen \r\n> To be clear, if the context timeout on the connection is less than 60s, server would return empty response before timeout hit.\r\n> there is a small gap server added to make sure the empty response is delivered before actual context timeout when it is less than 60s.\r\n> \r\n\r\nNot allowing users to configure the long polls to be shorter than 70s, Temporal makes configuration tricky for some of the users who may be using middle layers with a strict configuration (like reverse proxies) that may limit the durtion of long polls.\r\n\r\n**Describe the solution you'd like**\r\nTaking into account that the Server takes a time limit from the request timeout/deadline to return a response in an amount of time shorter than 60s, we can allow an SDK to accept rpcLongPollTimeout values less than the 70s. that and returns a response in a shorter amount of time.\r\n\r\nGoSDK: https://github.com/temporalio/sdk-go/issues/705\r\n","closedAt":"2022-05-16T03:52:26Z","comments":[],"createdAt":"2022-01-19T03:17:03Z","labels":[{"id":"MDU6TGFiZWwxNjIyNzE5ODQ0","name":"enhancement","description":"User experience","color":"a2eeef"}],"milestone":{"number":14,"title":"1.12.0","description":"","dueOn":"2022-05-19T00:00:00Z"},"number":988,"reactionGroups":[],"state":"CLOSED","title":"Make WorkflowServiceStubsOptions#rpcLongPollTimeout configurable","updatedAt":"2022-05-16T03:52:26Z","url":"https://github.com/temporalio/sdk-java/issues/988"}
